[{"签位":"钟离成道 上签","签文":"开天辟地作良缘，吉日良时万物全；若得此签非小可，人行忠正帝王宣。","解签":"受拥而发。"},
{"签位":"苏秦不第 下签","签文":"鲸鱼未变守江河，不可升腾更望高；异日峥嵘身变化，许君一跃跳龙门。","解签":"时机未熟，若熟则大。"},
{"签位":"董永遇仙 下签","签文":"临风冒雨去还乡，正是其身似燕儿；衔得坭来欲作垒，到头垒坏复须坭。","解签":"徒劳无功。"},
{"签位":"玉莲会十朋 上签","签文":"千年古镜复重圆，女再求夫男再婚；自此门庭重改换，更添福禄在儿孙。","解签":"破镜重圆。下又能上。失能复得。倒又能起。"},
{"签位":"刘晨遇仙 中签","签文":"一锥凿地要求泉，努力求之得最难；无意偶然遇知己，相逢携手上青天。","解签":"有心摘花花不开，无心插柳柳成荫。"},
{"签位":"仁贵遇主 中签","签文":"投身岩下铜鸟居，须是还他大丈夫；拾得营谋谁可得，通行天地此人无。","解签":"乱世出英雄，大难见真友。"},
{"签位":"苏娘走难 下签","签文":"奔波阻隔重重险，带水拖坭去度山；更望他乡求用事，千乡万里未回还。","解签":"事虽困顿，随遇而安。人生海海，看淡是福。"},
{"签位":"斐度还带 上签","签文":"茂林松柏正兴旺，雨雪风霜总莫为；异日忽然成大用，功名成就栋梁材。","解签":"苦练成才。积善成福。"},
{"签位":"孔明点将 中签","签文":"烦君勿作私心事，此意偏宜说问公；一片明心光皎洁，宛如皎月正天心。","解签":"善用贤将得天下，反修己心得解脱，智握精髓事轻驾，慈悲无私走天涯。"},
{"签位":"庞涓观阵 中签","签文":"石藏无价玉和珍，只管他乡外客寻；宛如持灯更觅火，不如收拾枉劳心。","解签":"怀中有宝可曾见，提灯觅火增劳倦。福禄在前当知足，清心寡欲幸福源。"},
{"签位":"书荐姜维 上签","签文":"欲求胜事可非常，争奈亲姻日暂忙；到头竟必成鹿箭，贵人指引贵人乡。","解签":"因祸得福。因害得利。因故得势。"},
{"签位":"武吉遇师 上签","签文":"否去泰来咫尺间，暂交君子出于山；若逢虎兔佳音信，立志忙中事即闲。","解签":"否极泰来，发旺在即。"},
{"签位":"罗通拜帅 中签","签文":"自小生在富贵家，眼前万物总奢华；蒙君赐紫金玉带，四海声名定可夸。","解签":"一向亨通，虽逢瓶颈，但行仁义，故能得援。"},
{"签位":"子牙弃官 中签","签文":"宛如仙鹤出樊笼，脱得樊笼路路通；南北东西无阻隔，任君直上九霄宫。","解签":"仙鹤出笼，尽飞四海。怀才得遇，任展西东。"},
{"签位":"苏秦得志 中签","签文":"行人怨日气难吞，忽有灾事勿近前；鸟破林巢无所宿，可寻深处稳安身。","解签":"不听忠告，故遭失败。与人口舌，故惹苦恼。与人冲突，故有不安。"},
{"签位":"叶梦熊朝 中签","签文":"愁眉思虑暂时开，启出云霄喜自来；宛如粪土中藏玉，良工荐举出尘埃。","解签":"拨云见日，君子出线。贵人荐举，苦恼摆开。"},
{"签位":"话梅止渴 中签","签文":"莫听闲言说是非，晨昏只好念弥陀；若将狂话为真实，画饼如何止得饥。","解签":"所求虚得，犯戒之报。当行忏悔，勤修戒行，多积阴德，以图改善。"},
{"签位":"曹国舅为 上签","签文":"金乌西坠兔东升，日夜循环至古今；僧道得知无不利，士农工商各从心。","解签":"谷底翻上，用心者吉。阴阳换位，女性出头。"},
{"签位":"子仪封王 中签","签文":"急水滩头放船归，风波作浪欲何为；若要安然求稳静，等待浪静道此危。","解签":"营谋选时机，任用选上官，若适配得宜，方能建大功。"},
{"签位":"姜太公遇文王 中签","签文":"当春久雨喜开晴，玉兔金乌渐渐明；旧事消散新事遂，看看一跳过龙门。","解签":"困顿渐分明，脱困向天堂。"},
{"签位":"李旦龙凤配合 上签","签文":"阴阳道合总由天，女嫁男婚喜偎然；但见龙蛇相会合，熏熏入梦喜团圆。","解签":"阴阳调和，就在龙蛇。"},
{"签位":"六郎逢救 中签","签文":"旱时田里皆枯藁，谢天甘雨落淋淋；花果草木皆润泽，始知一雨值千金。","解签":"久旱幸逢及时雨。"},
{"签位":"怀德招亲 中签","签文":"欲扳仙桂入蟾宫，岂虑天门不任君；忽遇一般音信好，人人欢笑领顶花。","解签":"改头换面，除旧布新。先得仙桂，再求谋望。"},
{"签位":"殷郊遇师 下签","签文":"不成理论不成家，水性痴人似落花；若问君恩须得力，到头方见事如麻。","解签":"不听忠告，故成祸源。违背誓言，故成灾祸。"},
{"签位":"李广机智 中签","签文":"过了忧危事几重，从今再立永无空；宽心自有宽心计，得遇高人立大功。","解签":"若自心宽，自有宽心之计。 若逢高人，自有超然妙招。"},
{"签位":"钟馗得道 中签","签文":"上下传来事转虚，天边接得一封书；书中许我功名遂，直到终时亦是虚。","解签":"好事是虚。得而复失，虚名一场。"},
{"签位":"刘基谏主 中签","签文":"一谋一用一番书，虑后思前不敢为；时到贵人相助力，如山壁立可安居。","解签":"屡败屡战，屡退屡进。"},
{"签位":"李后寻包公 中签","签文":"东边月上正蝉娟，顷刻云遮亦暗存；或有圆时还有缺，更言非者亦闲言。","解签":"虽有障碍，智慧可解。"},
{"签位":"赵子龙救阿斗 中签","签文":"宝剑出匣耀光明，在匣全然不惹尘；今得贵人携出现，有威有势众人钦。","解签":"脱离困境，杀出重围，贵人赏赐，扬威耀武。"},
{"签位":"棋盘大会 中签","签文":"劝君切莫向他求，似鹤飞来暗箭投；若去采薪蛇在草，恐遭毒口也忧愁。","解签":"其中有诈，事中有骗。向前则险，退守则安。"},
{"签位":"佛印会东坡 中签","签文":"清闲无忧静处坐，饱后喝茶时坐卧；放下身心不用忙，必定不招冤与祸。","解签":"莫庸自扰，莫受诱惑。待守则吉，持戒则安。 机未到，当行待候。火候不足，当行精练。"},
{"签位":"刘备求贤 中签","签文":"前程杳杳定无疑，石中藏玉有谁知；一朝良匠分明剖，始觉安然碧玉期。","解签":"石中藏玉，明人得赏。宝藏既得，事乃大昌。"},
{"签位":"咬金聘仁贵 中签","签文":"内藏无价宝和珍，得玉何须外界寻；不如等待高人识，宽心犹且更宽心。","解签":"宝藏自内寻，或待高人引，点出宝藏处，用之理事灵。"},
{"签位":"桃园结义 中签","签文":"行藏出入礼义恭，言必忠良信必聪；心不了然且静澈，光明红日正当空。","解签":"善于做人，有利万事。心无欠咎，凡事得成。"},
{"签位":"唐僧取经 中签","签文":"衣冠重整旧家风，道是无穹却有功；扫却当途荆棘刺，三人约议再和同。","解签":"重整旗鼓，大振雄风。众志合同，无往不利。"},
{"签位":"湘子遇宾 中签","签文":"眼前病讼不须忧，满地资财尽可求；恰似猿猴金锁脱，自归山洞去来游。","解签":"受困一时，解脱有日。"},
{"签位":"李靖归山 中签","签文":"欲待身安运泰时，风中灯烛不相宜；不如收拾深堂坐，庶免光摇静处明。","解签":"欲要得道，须弃名利，两者不可兼得。"},
{"签位":"何文秀遇难 下签","签文":"月照天书静处期，忽遭云雾又昏迷；宽心祈待云霞散，此时更改好施为。","解签":"展现非时，静待障离，改变作风，则有转机。"},
{"签位":"姜女寻夫 下签","签文":"天边消息实难思，切莫多心望强求；若把石头磨作镜，曾知枉费己工夫。","解签":"磨砖为镜，白费功也。"},
{"签位":"武则天登位 中签","签文":"红轮西坠兔东升，阴长阳消百事亭；若是女人宜望用，增添财禄福其心。","解签":"阴阳换位，阴者出头。先苦后乐，先困后舒。"},
{"签位":"董卓收吕布 中签","签文":"无限好言君记取，却为认贼将作子；莫贪眼下有些甜，更虑他年前样思。","解签":"认贼为子，视粪为金。错认善恶，故遭失败。 莫贿他人，莫被他贿。贿或被贿，双必灾殃。"},
{"签位":"目莲救母 上签","签文":"君皇圣后总为恩，复待祈禳无损增；一切有情皆受用，人间天上得期亨。","解签":"无私之功，恩泽之果，只求神佛，即可如愿。"},
{"签位":"行者得道 上签","签文":"天地变通万物全，自营自养自安然；生罗万象皆精彩，事事如心谢圣贤。","解签":"英雄不怕出身低。小兵立大功。"},
{"签位":"姜维邓艾斗阵 中签","签文":"棋逢敌手着相宜，黑白盘中未决时；皆因一着知胜败，须教自有好推宜。","解签":"观机应变，以智取胜。"},
{"签位":"仁宗认母 上签","签文":"温柔自古胜刚强，积善之门大吉昌；若是有人占此卦，宛如正渴遇琼浆。","解签":"以柔克刚。行善更吉。"},
{"签位":"渭水钓鱼 中签","签文":"劝君耐守旧生涯，把定心肠勿起歹；直待有人轻着力，枯枝老树再生花。","解签":"谨守当前，静待机缘。"},
{"签位":"梁灏登科 上签","签文":"锦上添花色愈鲜，运来禄马喜双全；时人莫恨功名晚，一举登科四海传。","解签":"双喜临门"},
{"签位":"韩信挂帅 中签","签文":"昆鸟秋来化作鹏，好游快乐喜飞腾；翱翔万里云霄去，余外诸禽总不能。","解签":"当前了了，未来大旺。"},
{"签位":"王祥求鲤 中签","签文":"天寒地冻水成冰，何须贪吝取功名；只好守己静处坐，待时兴变自然明。","解签":"感动可化冰，冰溶可成事。等待真相明，再行求功名。"},
{"签位":"陶朱归五湖 中签","签文":"五湖四海任君行，高挂帆蓬自在撑；若得顺风随即至，满船宝贝喜层层。","解签":"一帆风顺，直抵目地。"},
{"签位":"孔明入川 上签","签文":"夏日炎炎天日长，人人愁热闷非常；天地也解知人意，熏风拂拂自然凉。","解签":"天神暗助，诸事能遂。"},
{"签位":"太白醉捞明月 中签","签文":"水中捞月费功夫，费尽功夫却又无；莫说闲言并乱语，枉劳心力强身孤。","解签":"眼看得到吃不到，若逢贵人可改造。"},
{"签位":"刘备招亲 中签","签文":"失意反成得意时，龙呤虎啸两相宜；青天自有通霄路，许我功名再有期。","解签":"有惊无险，因祸得福。越挫越勇，越困越发。"},
{"签位":"马超追曹 下签","签文":"梦中得宝醒来无，自谓南山只是锄；若问婚姻并问病，别寻条路为相扶。","解签":"美梦一场。功名如幻。另寻出路，以得解脱。(逢险时弃功名可保平安)"},
{"签位":"周武王登位 中签","签文":"父贤传子子传孙，衣食丰隆只靠天；堂上椿萱人快乐，饥饭渴饮困时眠。","解签":"安乐祥和，凡事称心。"},
{"签位":"禄山谋反 中签","签文":"滩小石溪流水响，清风明月贵人忙；路须借问何方去，莫取林中花草香。","解签":"莫被色利惑。莫招惹无谓。"},
{"签位":"董仲寻亲 中签","签文":"说是说非风过耳，好衣好禄自然丰；君莫记取当年事，汝意还如我意同。","解签":"如子遇母般得到依靠或协助。"},
{"签位":"文王问卜 中签","签文":"直言说话君须记，莫在他乡求别艺；切须守己旧生涯，除此其余都不利。","解签":"安守则吉，外求则凶。忠告当记，馀皆不是。"},
{"签位":"张良隐山 中签","签文":"直上重楼去藏身，四围荆棘绕为林；天高君命长和短，得一反成失二人。","解签":"躲藏避灾，凶险犹存。"},
{"签位":"赤壁鏖兵 下签","签文":"抱薪救火大皆燃，烧遍三千亦复然；若问荣华并出入，不如收拾枉劳心。","解签":"恶性循环，越搞越糟。借酒消愁愁更愁。"},
{"签位":"苏小妹难夫 中签","签文":"日上吟诗月下歌，逢场作戏笑呵呵；相逢会遇难藏避，唱彩齐唱连理罗。","解签":"乐观以应对，小兵也立功。"},
{"签位":"唐僧得道 中签","签文":"晨昏全赖佛扶持，须是逢危却不危；若得贵人相引处，那时财帛亦相随。","解签":"先困后舒，因贵则安。"},
{"签位":"女娲氏炼石 中签","签文":"昔然行船失了针，今朝依旧海中寻；若然寻得原针在，也费工夫也费心。","解签":"海底寻针。费功费心。得不偿失。不理可也。"},
{"签位":"马前覆水 下签","签文":"游鱼却在碧波池，撞遭罗网四边围；思量无计翻身出，事到头来惹事非。","解签":"覆水难收。困境难脱。大势已去。无得挽捉。没得翻身。"},
{"签位":"孙膑困庞涓 下签","签文":"眼前欢喜未为欢，亦不危时亦不安；割肉补疮为甚事，不如守旧待时光。","解签":"割肉补疮还是伤，挖东补西还是漏。若欲伤人己亦伤，若能知止则自宽。"},
{"签位":"霸王被困 下签","签文":"路险马乏人行急，失群军卒困相当；滩高风浪船棹破，日暮花残天降霜","解签":"屋漏偏逢连夜雨。雪上加霜。四面楚歌。十面埋伏。"},
{"签位":"金精试窦儿 上签","签文":"一条金线秤君心，无减无增无重轻；为人平生心正直，文章全具艺光明。","解签":"锺情如一，故能成事。"},
{"签位":"汾阳祝寿 中签","签文":"门廷吉庆喜非常，积善之门大吉昌；婚姻田蚕诸事遂，病逢妙药即安康。","解签":"善有善报。"},
{"签位":"梅开二度 中签","签文":"冬来岭上一枝梅，叶落枝枯终不摧；但得阳春悄急至，依然还我作花魁。","解签":"再度获得。"},
{"签位":"李密反唐 下签","签文":"朝朝恰似采花蜂，飞出西南又走东；春尽花残无觅处，此心不变旧行踪。","解签":"移情别恋。叛变。"},
{"签位":"文君访相如 中签","签文":"认知苍龙下九衢，女子当年嫁二夫；自是一弓架两箭，欲恐龙马不安居。","解签":"两边应付"},
{"签位":"王莽求贤 中签","签文":"养蜂须用求他蜜，只怕遭触尾上针；须是眼前有异路，暗里深如荆棘林。","解签":"刀口吃蜜"},
{"签位":"陈桥兵变 上签","签文":"春来雷震百虫鸣，番身一转离泥中；始知出入还来往，一朝变化便成龙。","解签":"发迹之始，大事欲成。"},
{"签位":"秦败擒三帅 下签","签文":"似鹄飞来自入笼，欲得番身却不通；南北东西都难出，此卦诚恐恨无穹。","解签":"自投罗网。进退两难。准败无疑。"},
{"签位":"伍员夜出昭关 中签","签文":"恰如抱虎过高山，战战竞竞胆碎寒；不觉忽然从好事，切须保守一身安。","解签":"前程有险，若欲脱险，则须智取。"},
{"签位":"洪武看牛 中签","签文":"鱼龙混杂意相同，耐守深潭待运通；不觉一朝头耸出，禹门一跳过龙宫。","解签":"事未成熟，耐守待时，必能成事。"},
{"签位":"捧璧归赵 中签","签文":"梦中说得是多财，声名云外总虚来；水远山遥难信实，贵人指点笑颜开。","解签":"莫被虚名所迷。莫被外表所惑。有眼不识泰山。凡眼误信虚物。"},
{"签位":"临潼救驾 上签","签文":"冷水未烧白涕汤，不寒不热有温凉；要行天下无他事，为有身中百艺强。","解签":"两者互调，平衡互补。只在功夫，则能成事。"},
{"签位":"暗扶倒铜旗 中签","签文":"虚空结愿保平安，保得身安愿不还；莫忘神圣宜还了，此知神语莫轻慢。","解签":"有愿未还。有承诺未实践。 广结善缘、感恩心、恭敬心，是成就人际关系的法宝。"},
{"签位":"智远投军 上签","签文":"直上仙岩要学仙，此知一旦帝王宣；青天日月常明照，心正声名四海传。","解签":"胸怀大志，贵人相助，诸事遂意，功名成就。"},
{"签位":"风送滕王阁 上签","签文":"梧桐叶落秋将暮，行客归程去似云；谢得天公高着力，顺风船载宝珍归。","解签":"天神相助，诸事遂意。"},
{"签位":"火烧葫芦谷 中签","签文":"炎炎烈火焰连天，焰里还生一朵莲；到底得成终不害，依然生叶长根枝。","解签":"中流砥柱，坚持理想，根基还在。"},
{"签位":"李渊登位 中签","签文":"譬若初三四五缺，半无半有未圆全；等待十五良宵夜，到处光明到处圆。","解签":"历险难而获得机会。目前时机未熟。"},
{"签位":"庄子试妻 下签","签文":"因名丧德如何事，切恐吉中变化凶；酒醉不知何处去，青松影里梦朦胧。","解签":"莫为名位损道义，莫因盲目而造凶。"},
{"签位":"韩文公遇雪 中签","签文":"云开雾罩山前路，万物圆中月再圆；若得诗书沉梦醒，贵人指引步天台。","解签":"此困有救，荣景再现。"},
{"签位":"商辂中三元 上签","签文":"春来花发映阳台，万里车来进宝财；若得禹门三级浪，恰如平地一声雷。","解签":"惊喜连连。"},
{"签位":"咬金探地穴 中签","签文":"人行半岭日衔山，竣岭崖岩未可安；仰望上天为护佑，此身犹在太平间。","解签":"处境艰辛，虽安尤虚。"},
{"签位":"庞洪畏包公 中签","签文":"木为一虎在当门，须是有威不害人；分明说是无防事，忧恼迟疑恐惊心。","解签":"理性看待，则无惊恐。"},
{"签位":"智服姜维 上签","签文":"出入营谋大吉昌，似玉无瑕石里藏；若得贵人来指引，斯时得宝喜风光。","解签":"石中藏玉，开发可得。"},
{"签位":"苇佩遇仙 上签","签文":"忽言一信向天飞，泰山宝贝满船归；若问路途成好事，前头仍有贵人推。","解签":"如鱼得水，即能腾达。如鱼得水，有难即解。"},
{"签位":"三战吕布 中签","签文":"好展愁眉出众来，前途改变喜多财；一条大路如天阔，凡有施财尽畅怀。","解签":"潜力大大。"},
{"签位":"蔡卿报恩 上签","签文":"自幼为商任设谋，财禄盈丰不用求；若是双身谋望事，秀才出去状元回。","解签":"越作越好。步步高升。"},
{"签位":"高君保招亲 中签","签文":"鸾凤翔毛雨淋漓，当时却被雀儿欺；终教一日云开达，依旧还君整羽衣。","解签":"还我清白。重归旧好。"},
{"签位":"伯牙访友 下签","签文":"君子莫体小人为，事若差池各是非；琴鸣须用知音听，守常安静得依稀。","解签":"不解风情故不遂，体解他意则吉顺。"},
{"签位":"曹丕称帝 中签","签文":"志气功业在朝朝，今将酒色不胜饶；若见金鸡报君语，钱财福禄与君招。","解签":"赢在操守，输在失德。"},
{"签位":"窦燕山积善 上签","签文":"巍峨宝塔不寻常，八面玲珑尽放光；劝君立志勤顶礼，作善苍天降福祥。","解签":"福德之光，故能吉祥。"},
{"签位":"六出祁山 中签","签文":"当风点烛空疏影，恍惚铺成镜里花；累被儿竟求牧拾，怎知只是幻浮槎。","解签":"如梦幻泡影。"},
{"签位":"吉平遇难 下签","签文":"出入求谋事宜迟，只恐闲愁惹是非；如鸟飞入罗网内，脱困能有几多时。","解签":"凡事宜迟，以免受困。"},
{"签位":"陶三春挂帅 下签","签文":"勒马持鞭直过来，半有忧危半有灾；恰似遭火焚烧屋，天降时雨荡成灰。","解签":"因好事而得灾。因坏事而吉祥。"},
{"签位":"三教谈道 下签","签文":"佛神灵通与君知，痴人说事转昏迷；老人求得灵签去，不如守旧待来时。","解签":"末日之签。"},
{"签位":"巍巍独步向云间","签文":"巍巍独步向云间，玉殿千官第一班；富贵荣华天付汝，福如东海寿如山。","解签":"云间独步，拔萃超群，名登甲第，谈笑功勋。终身光显，皆天所相，禄厚寿高，意称谋望。"},
{"签位":"盈虚消息总天时","签文":"盈虚消息总天时，自此君当百事宜；若问前程归宿地，更须方寸好修为。","解签":"万事乘除，随时而处，否极泰来，事无龃龉。收成结果，方寸修为，切莫妄动，万福来宜。"},
{"签位":"衣食自然生处有","签文":"衣食自然生处有，劝君不用苦劳心；但能孝悌存忠信，福禄来成祸不侵。","解签":"富贵前定，何须强求，徒劳心力，反致伤忧。事亲待人，动合循理，天必佑之，有泰无否。"},
{"签位":"去年百事颇相宜","签文":"去年百事颇相宜，若较今年时运衰；好把瓣香告神佛，莫教福谢悔无追。","解签":"先吉后凶，时运将否，谋事无成，顿非前比。秉诚祷神，以求福祉，若无远虑，悔无及己。"},
{"签位":"子有三般不自由","签文":"子有三般不自由，门庭萧索冷如秋；若逢牛鼠交承日，万事回春不用忧。","解签":"荣枯有时，不由人力，泰运将亨，终于否极。月日子丑，凡事皆吉，如木逢春，才见荣益。"},
{"签位":"何劳鼓瑟更吹笙","签文":"何劳鼓瑟更吹笙，寸步如登万里程；彼此怀疑不相信，休将私意忆浓情。","解签":"凡事劳心，有退无进，谋望不成，怀疑不信。求合未合，将圆未圆，只宜守己，不宜变迁。"},
{"签位":"仙风道骨本天生","签文":"仙风道骨本天生，又遇仙宗为主盟；指日丹成谢岩谷，一朝引领向天行。","解签":"天生富贵，况得神助，凡骨成仙，升腾云路。庶人遇贵，财物皆聚，百事大吉，何必疑虑。"},
{"签位":"年来耕稼苦无收","签文":"年来耕稼苦无收，今岁田畴定有秋；况遇太平无事日，士农工贾百无忧。","解签":"凡事求谋，昔否今泰，时运将亨，有喜无害。士农工商，悉逢嘉会，财物倍收，普均内外。"},
{"签位":"望渠消息向长安","签文":"望渠消息向长安，常把菱花仔细看；见说文书将入境，今朝喜色上眉端。","解签":"谋望已久，忽得好音，音书到手，喜在目今。利有攸往，财获千金，所谋遂意，凡百称心。"},
{"签位":"病患时时命蹇衰","签文":"病患时时命蹇衰，何须打瓦共钻龟；直教重见一阳复，始可求神仗佛持。","解签":"命运多蹇，疾病连绵，但须修省，托在苍天。直须冬至，祷神方痊，凡百谋望，作事必全。"},
{"签位":"今年好事一番新","签文":"今年好事一番新，富贵荣华萃汝身；谁道机关难料处，到头独立转伤神。","解签":"命运难亨，亦不如意，吉中有凶，事实无济。切莫贪求，出外不利，如或妄动，福消祸至。"},
{"签位":"营为期望在春前","签文":"营为期望在春前，谁料秋来又不然；直遇清江贵公子，一生活计始安全。","解签":"作事迟疑，求财未遂，临江贵人，望之如意。万一他求，徒劳心志，且谨践修，以俟时至。"},
{"签位":"君今庚甲未亨通","签文":"君今庚甲未亨通，且向江头作钓翁；玉兔重生应发迹，万人头上逞英雄。","解签":"命运当蹇，万事迟疑，且宜守旧，藏器待时。年与月日，逢卯则宜，或遇望日，方称所为。"},
{"签位":"一见佳人便喜欢","签文":"一见佳人便喜欢，谁知去后有多般；人情冷暖君休讶，历涉应知行路难。","解签":"事望团圆，反生龃龉，人多不情，恐难凭据。只宜自省，毋为他误，戒之戒之，且疑且虑。"},
{"签位":"两家门户各相当","签文":"两家门户各相当，不是姻缘莫较量；直待春风好消息，却请琴瑟向兰房。","解签":"两意未合，宜可待时，防忧与患，谨慎愆期。直待来春，万事方佳，若或妄动，徒劳心怀。"},
{"签位":"官事悠悠难辨明","签文":"官事悠悠难辨明，不如息了且归耕；傍人煽惑君休信，此事当谋亲兄弟。","解签":"讼事未决，且宜从和，傍人煽惑，平地风波。慎勿轻信，自投网罗，谋之兄弟，谁能奈何。"},
{"签位":"田园价贯好商量","签文":"田园价贯好商量，事到公庭彼此伤；纵使机关图得胜，定为后世子孙殃。","解签":"事依本份，自有前程，若用机关，反害其身。如作交易，当合人情，若见妄作，难保安宁。"},
{"签位":"知君指拟是空华","签文":"知君指拟是空华，底事茫茫未有涯；牢把脚根踏实地，善为善应永无差。","解签":"作事未成，空自指拟，且宜缓图，急则损己。更宜向善，祷神求安，转祸为福，可免多端。"},
{"签位":"嗟子从来未得时","签文":"嗟子从来未得时，今年星运颇相宜；营求动作都如意，和合婚姻诞贵儿。","解签":"久困沈埋，时运今泰，作事有成，名利俱快。更无阻滞，宜为买卖，士人占之，前程远大。"},
{"签位":"一生心事向谁论","签文":"一生心事向谁论，十八滩头说与君；世事尽从流水去，功名富贵等浮云。","解签":"心事未决，且宜缓图，时势纵吉，须仗神扶。凡事退省，终保无虞，更加修福，可履亨途。"},
{"签位":"与君夙昔结成冤","签文":"与君夙昔结成冤，今日相逢那得缘；好把经文多讽诵，祈求户内保婵娟。","解签":"旧有夙冤，作事随缘，急宜向善，方保安全。力行好事，心契上天，变凶为吉，出自福田。"},
{"签位":"碧玉池中开白莲","签文":"碧玉池中开白莲，庄严色相自天然；生来骨格超凡俗，正是人间第一仙。","解签":"事见明白，不假人为，更宜出入，切莫迟疑。士人占之，高攀桂枝，一切谋望，好趁明时。"},
{"签位":"花开花谢在春风","签文":"花开花谢在春风，贵贱穷通百岁中；羡子荣华今已矣，到头万事总成空。","解签":"凡百谋望，有成有败，始虽快意，终竟成害。吉中有凶，否生于泰，若不敛藏，后忧方大。"},
{"签位":"一春万事苦忧煎","签文":"一春万事苦忧煎，夏里营求始帖然；更遇秋成冬至后，恰如骑鹤与腰缠。","解签":"春日谋望，事多不成，夏秋冬月，始见光亨。更宜出入，福禄丰盈，营求如意，时至即行。"},
{"签位":"寅午戌年多阻滞","签文":"寅午戌年多阻滞，亥子丑月渐亨嘉；更逢玉兔金鸡会，枯木逢春自放花。","解签":"春夏秋时，作事迟疑，直待三冬，百事亨通。卯酉月日，所谋则吉，待此时来，枯木花开。"},
{"签位":"年来丰歉皆天数","签文":"年来丰歉皆天数，自是今年旱较多；与子定期三日内，田畴沾足雨滂沱。","解签":"吉凶天数，目下多遁，直待时至，如木逢春。祷求皆应，定在三辰，谋望必遂，好事临门。"},
{"签位":"世间万物皆有主","签文":"世间万物皆有主，一粒一毫君莫取；英雄豪杰自天生，也须步步循规矩。","解签":"富贵分定，切莫强求，若或妄取，必有后忧。且宜守旧，更务进修，心行平等，自获天麻。"},
{"签位":"公侯将相本无种","签文":"公侯将相本无种，好把勤劳契上天；人事尽从天理见，才高岂得困林泉。","解签":"荣华富贵，勤苦得之，目下虽困，后必逢时。切勿自怠，更勉修为，人事既尽，天理可知。"},
{"签位":"祖宗积德几多年","签文":"祖宗积德几多年，源远流长庆自然；苦更操修无倦已，天须还汝旧青毡。","解签":"善恶胚胎，由人自栽，修善者泰，积恶者灾。若能修持，福自天来，依旧荣华，自有安排。"},
{"签位":"奉公谨守莫欺心","签文":"奉公谨守莫欺心，自有亨通吉利临；目下营求且休矣，私期与子定佳音。","解签":"公平处己，切莫自欺，福禄虽有，更宜待时。若要进取，未可施为，凡百谋望，秋以为期。"},
{"签位":"秋冬作事只寻常","签文":"秋冬作事只寻常，春到门庭渐吉昌；千里信音符远望，萱堂快乐未渠央。","解签":"凡事谋望，秋冬平平，春来运至，次第光亨。远行有信，所作皆成，家道清吉，可保安宁。"},
{"签位":"劳心泊泊竟何归","签文":"劳心泊泊竟何归，疾病兼多是与非；事到头来浑似梦，何如休要用心机。","解签":"谋事不成，徒自劳心，口舌立至，祸患来侵。不如退步，暂避山林，随其所在，可遇知音。"},
{"签位":"不分南北与西东","签文":"不分南北与西东，眼底昏昏耳似聋；熟读黄庭经一卷，不论贵贱与穷通。","解签":"吉凶祸福，报应分明，若知祈禳，如谷应声。无分贵贱，宜养精神，定则能虑，福自骈臻。"},
{"签位":"春夏才过秋又冬","签文":"春夏才过秋又冬，纷纷谋虑搅心胸；贵人垂手来相援，休把私心情意浓。","解签":"一岁营谋，未有发达，方得贵人，垂手提挈。渐渐亨通，可免激聒，莫信私人，巧语间谍。"},
{"签位":"一山如画对清江","签文":"一山如画对清江，门里团圆事事双；谁料半途分析去，空帏无语对银缸。","解签":"坟宅虽吉，命运未通，家门招祸，好事成空。夫妻离散，骨肉西东，凡事不遂，有始无终。"},
{"签位":"功名富贵自能为","签文":"功名富贵自能为，偶着仙鞭莫问伊；万里鹏程君有分，吴山顶上好钻龟。","解签":"富贵分定，迟速有时，藏器以待，切莫怨迟。掀天事业，时至即为，若到天边，便可决疑。"},
{"签位":"焚香来告复何辞","签文":"焚香来告复何辞，善恶平分汝自知；屏却昧公心里事，出门无碍是通时。","解签":"作善降祥，作恶降殃，何必祷神，当自揣量。公心莫昧，勉为善良，前程远大，可保安康。"},
{"签位":"蛩吟唧唧守孤帏","签文":"蛩吟唧唧守孤帏，千里悬悬望信归；等得荣华公子到，秋冬括括雨霏霏。","解签":"作事无聊，空自惆怅，纵得好音，依然凄怜。谋望不遂，心神徒丧，家道未安，祷神阴相。"},
{"签位":"北山门下好安居","签文":"北山门下好安居，若问终时慎厥初；堪笑包藏许多事，鳞鸿虽便莫修书。","解签":"静处安身，是非莫理，欲保终吉，作事谋始。无惑人言，切防害己，勿轻传信，暗中有鬼。"},
{"签位":"新来换得好规模","签文":"新来换得好规模，何用随他步与趋；只听耳边消息到，崎岖历尽见亨衢。","解签":"谋望更改，修为尽好，何必依人，自可达到。须历艰难，必获好报，平步青霄，荣捧恩诏。"},
{"签位":"自南自北自东西","签文":"自南自北自东西，欲到天涯谁作梯；遇鼠逢牛三弄笛，好将姓名榜头题。","解签":"若求名利，先难后有，白日青云，必在子丑。声誉显赫，题名榜首，百事亨通，显然在后。"},
{"签位":"我曾许汝事和谐","签文":"我曾许汝事和谐，谁料修为汝自乖；但改新图莫依旧，营谋应得称心怀。","解签":"神许和合，自乖所为，急须更变，方得其宜。心行正直，毋好自欺，若能悔过，天必相之。"},
{"签位":"一纸官书火急催","签文":"一纸官书火急催，扁舟速下浪如雷；虽然目下多惊险，保汝平安去复回。","解签":"官书火急，激聒之兆，目下虽惊，终无纷扰。有神阴扶，收功谈笑，往来平安，吉星高照。"},
{"签位":"汝是人中最吉人","签文":"汝是人中最吉人，误为误作损精神；坚牢一念酬香愿，富贵荣华萃汝身。","解签":"心行平等，反误非为，急宜改过，切莫自欺。尽诚作福，神必佑之，荣华富贵，付汝非迟。"},
{"签位":"好将心地力耕耘","签文":"好将心地力耕耘，彼此山头总是坟；阴地不如心地好，修为到底却输君。","解签":"好修心地，莫用他求，但依本分，可获天麻。勿与人竞，福力自优，子孙之庆，皆善之由。"},
{"签位":"君是山中万户侯","签文":"君是山中万户侯，信知骑马胜骑牛；今朝马上看山色，争似骑牛得自由。","解签":"本等富贵，已胜常人，愈吉愈贪，祸及己身。宜依本分，当享和平，劝君静处，可免灾运。"},
{"签位":"与君万语复千言","签文":"与君万语复千言，祇欲平和雪尔冤；讼则终凶君记取，试于清夜把心扪。","解签":"讼则终凶，不可多说，若得和平，旧冤可雪。凡所谋望，皆当谨节，反求诸己，祸端自灭。"},
{"签位":"登山涉水正天寒","签文":"登山涉水正天寒，兄弟姻亲那得安；幸遇虎头人一唤，全家遂保汝重欢。","解签":"历涉艰难，时运辄左，家道不齐，事多坎坷。遇富贵人，提挈方可，倘无所济，难逃后祸。"},
{"签位":"彼此家居只一山","签文":"彼此家居只一山，如何似隔鬼门关；日月如梭人易老，许多劳碌不如闲。","解签":"安闲易处，出门有阻，时迍易过，枉自劳苦。且宜守旧，随分而去，运未亨通，那宜进取。"},
{"签位":"人说今年胜旧年","签文":"人说今年胜旧年，也须步步要周旋；一家和气多生福，萋菲谗言莫听偏。","解签":"谋望胜前，却宜进取，人事周旋，祸消福至。勿信谗言，惶惑思虑，慎终如始，切莫颠坠。"},
{"签位":"君今百事且随缘","签文":"君今百事且随缘，水到渠成听自然；莫叹年来不如意，喜逢新运称心田。","解签":"目下谋望，且随缘分，一朝荣达，身显如愿。休自嗟怨，待时迁变，渐遇亨通，好事叠见。"},
{"签位":"兀坐幽居叹寂寥","签文":"兀坐幽居叹寂寥，孤灯掩映度清宵；万金忽报秋光好，活计扁舟渡北朝。","解签":"席珍待聘，休嗟未遇，忽际明时，青云稳步。好音一来，得意高举，凡事必谐，皆有佳趣。"},
{"签位":"艰难险阻路蹊跷","签文":"艰难险阻路蹊跷，南鸟孤飞依北巢；今日贵人曾识面，相逢却在夏秋交。","解签":"艰难历遍，作事皆非，南鸟北巢，失其所依。夏秋之交，贵人相提，应称谋望，荣达可期。"},
{"签位":"万人丛里逞英豪","签文":"万人丛里逞英豪，便欲飞腾霄汉高；争奈承流风未便，青灯黄卷且勤劳。","解签":"谋望过高，便其远到，争奈时乖，徒自狂躁。且宜守己，勉行善道，直待时亨，凡事皆好。"},
{"签位":"勤耕力作莫蹉跎","签文":"勤耕力作莫蹉跎，衣食随时安分过；纵使经商收倍利，不如逐岁廪禾多。","解签":"衣食自足，强求则损，不如归耕，种植为本。纵巧经营，岂能长远，安分守成，荣达未晚。"},
{"签位":"心头理曲强词遮","签文":"心头理曲强词遮，直欲欺官行路斜；一旦丑形临月镜，身役宪网莫咨嗟。","解签":"心邪理曲，饰词欺公，明镜照破，必致终凶。何如退步，正直是从，庶免其祸，可保厥躬。"},
{"签位":"事端百出虑虽长","签文":"事端百出虑虽长，莫听人言自主张；一着仙机君记取，纷纷闹里更思量。","解签":"事务多端，纷纭不已，三思后行，悉归条理。莫信人言，当自揣己，挤先一着，何事不济。"},
{"签位":"苏秦三寸足平生","签文":"苏秦三寸足平生，富贵功名在此行；更好修为阴骘事，前程万理自通亨。","解签":"凡百谋望，远行则吉，求财必丰，求名必得。更行好事，以助阴骘，富贵荣华，始自今日。"},
{"签位":"门衰户冷苦伶仃","签文":"门衰户冷苦伶仃，自叹祈求不一灵；幸有祖宗阴骘在，香烟未断续螟蛉。","解签":"门户衰微，空自祈祷，幸有祖宗，阴骘可保。若问后嗣，异姓方好，更行善事，当得美报。"},
{"签位":"羡君兄弟好名声","签文":"羡君兄弟好名声，只管谦伪莫自矜；丹诏槐黄相逼近，巍巍科甲两同登。","解签":"兄弟联芳，声名自起，凡事谦撝，以全其美。前程远大，好事近矣，两两相高，同登甲第。"},
{"签位":"啸聚山林凶恶俦","签文":"啸聚山林凶恶俦，善良无事苦煎忧；主人大笑出门去，不用干戈盗贼休。","解签":"恶少操戈，欲害良善，彼何能为，徒逞强健。君子善胜，收功不战，神明相之，阴消祸变。"},
{"签位":"百千人面虎狼心","签文":"百千人面虎狼心，赖汝干戈用力深；得胜回时秋渐老，虎头城里喜相寻。","解签":"人多谋害，汝善却敌，纵有忧惊，终自消释。得胜回时，定在秋日，图向西方，事事皆吉。"},
{"签位":"曩时败北且图南","签文":"曩时败北且图南，筋力虽衰尚一堪；欲识生前君大数，前三三与后三三。","解签":"前后谋望，皆有所成，晚年经商，尚堪一行。福分数定，不亏不盈，若欲多取，徒自劳神。"},
{"签位":"吉人相遇本合同","签文":"吉人相遇本合同，况有持谋天水翁；人力不劳公论协，事成功倍笑谈中。","解签":"与人谋合，况遇朝贵，援手提携，事皆称意。勿劳余力，成就甚易，出入皆宜，吉无不利。"},
{"签位":"朔风凛凛正穷冬","签文":"朔风凛凛正穷冬，多羡门庭喜气浓；更入新春人事后，衷言方得信先容。","解签":"数极于冬，穷久则通，交季冬月，喜气重重。新春一至，和气愈充，好遇贵客，百事皆同。"},
{"签位":"耕耘只可在乡邦","签文":"耕耘只可在乡邦，何用求谋向外方；见说今年新运好，门阑喜气事双双。","解签":"出外不宜，在家必达，时运将亨，财禄俱发。好事重重，门庭改革，若欲远图，弄巧成拙。"},
{"签位":"谗发君心天已知","签文":"谗发君心天已知，何须问我决狐疑；愿子改图从孝悌，不愁家室不相宜。","解签":"所谋未善，何必祷神，当决于理，改过自新。但能孝友，奉亲事君，和气生福，家道回春。"},
{"签位":"南贩珍珠北贩盐","签文":"南贩珍珠北贩盐，年来几倍侦财添；劝君止此求田舍，心欲多时何日厌。","解签":"谋望既遂，利亦倍收，贪心不止，必获后忧。知足不辱，可乐优游，凡事如意，可休则休。"},
{"签位":"舍舟遵路总相宜","签文":"舍舟遵路总相宜，慎勿嬉游逐贵儿；一夜樽前兄与弟，明朝仇敌又相随。","解签":"舍舟登路，宜踏实地，莫伴贵儿，事当牢记。好中成恶，口舌宜至，戒之慎之，撙节游戏。"},
{"签位":"雷雨风云各有司","签文":"雷雨风云各有司，至诚祷告莫生疑；与君约定为霖日，正是蕴隆中伏时。","解签":"吉凶悔吝，各有神司，若问济事，在中伏时。如旱得雨，恰慰云霓，凡所谋望，直待其时。"},
{"签位":"喜鹊檐前报好音","签文":"喜鹊檐前报好音，知君千里欲归心；绣帏重结鸳鸯带，叶落霜飞寒色侵。","解签":"好音报喜，远涉方回，交冬之际，家室和谐。凡事终吉，且待时来，自有成就，不必疑猜。"},
{"签位":"河渠傍路有高低","签文":"河渠傍路有高低，可叹长途日己西；纵有荣华好时节，直须猴犬换金鸡。","解签":"修路崎岖，况当衰晚，求事多难，徒自嗟叹。逢申酉戌，年月日见，若遇此时，稍可如愿。"},
{"签位":"忆昔兰房分半钗","签文":"忆昔兰房分半钗，而今忽把信息乖；痴心指望成连理，到底谁知事不谐。","解签":"事多离散，难望再成，痴心未解，尚有萦情。纵能强合，终必败盟，凡事谋望，另改途程。"},
{"签位":"崔巍崔巍复崔巍","签文":"崔巍崔巍复崔巍，履险如夷去复来；身似菩提心似镜，长安一道放春回。","解签":"路途倾险，心却平欢，转凶为吉，终免忧疑。更宜守正，切莫改移，履道坦坦，何福不随。"},
{"签位":"生前结得好姻缘","签文":"生前结得好姻缘，一笑相逢情自亲；相当人物无高下，得意休论富与贫。","解签":"既有夙约，一见如故，所谋皆同，事多就绪。何必相逢，又分尔汝，且顺而行，事无龃龉。"},
{"签位":"三千法律八千文","签文":"三千法律八千文，此事如何说与君；善恶两途君自做，一生祸福此中分。","解签":"吉凶多变，非止一端，言不尽意，当以心观。福因积善，祸胎稔恶，知所趋避，宜自先觉。"},
{"签位":"木有根亥水有源","签文":"木有根亥水有源，君当自此究其原；莫随道路人闲话，讼则终凶是至言。","解签":"祸因恶积，当究其源，最宜向善，病保安全。自当谨慎，勿信人言，若有偏徇，祸不踵旋。"},
{"签位":"家道丰腴自饱温","签文":"家道丰腴自饱温，也须肚里立乾坤；财多害己君当省，福有胚胎祸有门。","解签":"家道昌盛，犹宜谨守，自立主张，祈求护佑。轻财重道，方能长久，善善恶恶，自作自受。"},
{"签位":"干亥来龙仔细看","签文":"干亥来龙仔细看，坎居午向自当安；若移丑艮阴阳逆，门户凋零家道难。","解签":"立宅安坟，当明正向，龙穴虽吉，向差则病。凡百谋望，南向则善，一或他向，恐不如意。"},
{"签位":"一朝无事忽朝官","签文":"一朝无事忽朝官，也是门衰坟未安；改换阴阳移祸福，劝君莫作等闲看。","解签":"风水不利，门户衰蹇，致招殃咎，有此祸变。急宜速改，避恶向善，若能戒意，庶几脱免。"},
{"签位":"假君财物自当还","签文":"假君财物自当还，谋赖欺心他自奸；幸有高堂明月镜，请来对照破机关。","解签":"负人财物，欺赖自奸，幽有神鬼，显有清官。一朝照破，难逃其祸，每事依心，无施不可。"},
{"签位":"彼亦俦中一辈贤","签文":"彼亦俦中一辈贤，劝君特达与周旋；此时宾主欢相会，他日王侯却并肩。","解签":"事有相干，宜与效力，君既周旋，他必报德。凡所谋为，遇贵方得，神力阴扶，福报有日。"},
{"签位":"随分堂前赴粥坛","签文":"随分堂前赴粥坛，何须妄想苦忧煎；主张门户诚难事，百岁安闲得几年。","解签":"好事随缘，莫贪莫竞，且宜守成，庶保安静。若更妄求，必主多忧，何如退省，以遂优游。"},
{"签位":"个中事绪更纷然","签文":"个中事绪更纷然，当局须知一着先；长舌妇人休酷听，力行礼义要心坚。","解签":"万事一理，各有先见，莫听人言，激成多变。依理而行，祸自可免，当坚乃心，毋或退转。"},
{"签位":"一春风雨正潇潇","签文":"一春风雨正潇潇，千里行人去路遥；移寡就多君得计，如何归路转无聊。","解签":"时之未遇，历涉艰阻，巧计虽多，终于无补。且宜守旧，毋过于取，庶保已成，祸散福聚。"},
{"签位":"一舟行货好招邀","签文":"一舟行货好招邀，积少成多自富饶；常把他人比自己，管须日后胜今朝。","解签":"同时经营，皆欲成家，将人比己，不必矜夸。自然天佑，福禄亨嘉，更宜方便，锦上添花。"},
{"签位":"阴里详看怪尔曹","签文":"阴里详看怪尔曹，舟中敌国笑中刀；藩篱剖破浑无事，一种天生惜羽毛。","解签":"骨肉乖张，操戈入室，面上春风，胸中荆棘。何必思维，人己则一，若能和同，变凶为吉。"},
{"签位":"从前作事总徒劳","签文":"从前作事总徒劳，才见新春时渐遭；百计营求都得意，更须守己莫心高。","解签":"平生劳苦，百事无成，时运将泰，谋望称心。更宜谨守，贪心莫生，随缘受用，坐享安荣。"},
{"签位":"樽前无事且高歌","签文":"樽前无事且高歌，时未来时奈若何；白马渡江嘶日暮，虎头城里看巍峨。","解签":"时运未遇，且自开怀，年月逢午，好事方来。虽临晚景，掀轰一回，众人耸看，积粟多财。"},
{"签位":"崆峒城里事如麻","签文":"崆峒城里事如麻，无事如君有几家；劝汝不顺勤致祷，徒劳生事苦咨叹。","解签":"人事扰扰，君独清闲，不必渎神，妄求多般。反招口舌，激起祸端，急宜静守，以保平安。"},
{"签位":"佛说淘沙始见金","签文":"佛说淘沙始见金，只缘君子不劳心；荣华总得诗书效，妙里工夫仔细寻。","解签":"淘沙见金，勤苦方得，富贵荣华，皆是书力。肯用功夫，自然有益，惰于经营，终无所获。"},
{"签位":"今年禾谷不如前","签文":"今年禾谷不如前，物价喧腾倍百年；灾数流行多疫疠，一阳复后始安全。","解签":"目下求谋，今不如昔，口舌叠来，病多啾唧。时运尚乖，至今不吉，待冬至后，方始宁息。"},
{"签位":"春来雨水太连绵","签文":"春来雨水太连绵，入夏晴干雨又愆；节气直交三伏始，喜逢滂沛足田园。","解签":"盈虚消息，天道之常，春多如意，夏却乖张。直交三伏，时运方昌，财多积聚，事事平康。"},
{"签位":"一般器用与人同","签文":"一般器用与人同，巧斫轮舆梓匠工；凡事有缘且随分，秋冬方至主人翁。","解签":"机关谋望，人事虽同，随缘随分，心合苍穹。秋冬时至，遇主人翁，藉此提携，凡事皆通。"},
{"签位":"知君袖内有骊珠","签文":"知君袖内有骊珠，生不逢辰亦强图；可叹头颅已如许，而成方得贵人扶。","解签":"藏器待时，弄巧成拙，今当晚景，遇贵提携。凡事谋望，各有时节，福禄胜前，自当发越。"},
{"签位":"婚姻子息莫嫌迟","签文":"婚姻子息莫嫌迟，但把精神把佛持；四十年前须报应，功圆行满有馨儿。","解签":"谋望虽迟，终有所遇，福神相佑，扶持门户。中年运泰，事宜进取，凡百称心，咸无忧虑。"},
{"签位":"五十功名心已灰","签文":"五十功名心已灰，那知富贵逼人来；更行好事存方寸，寿比冈陵位鼎台。","解签":"功名志退，一豆逢时，逼人富贵，皆善所基。便行好事，相与扶持，寿高贵显，大胜前时。"},
{"签位":"经营百出费精神","签文":"经营百出费精神，南北奔驰运未新；玉兔交时当得意，恰如枯木再逢春。","解签":"营谋艰力，见逢时否，奔北趋南，百事未遂。卯年月日，方可营计，转悴为荣，节节生意。"},
{"签位":"贵人遭遇水云卿","签文":"贵人遭遇水云卿，冷淡交情滋味长；黄阁开时延故客，骅溜应得骤康庄。","解签":"忆昔贵人，忽见邂逅，从此提携，命运亨泰。出入图谋，凡事利快，士庶占之，前程远大。"},
{"签位":"我本天仙雷雨师","签文":"我本天仙雷雨师，吉凶祸福我先知；至诚祷祝皆灵应，抽得终签百事宜。","解签":"吉凶祸福，神先知之，更修阴骘，神必佑之。凡百谋为，有进无止，数虽已终，周而复始。"},
{"签位":"王母祝寿","签文":"蓬莱东阁玉桃香，顺水行舟仙赐方；宜男正好图全计，不必他方卜地长。","解签":"王母娘娘大寿，各仙家前往致贺，场面极为浩大。王母对贺客皆赐以仙桃仙丹等长生不老的美食。众仙大会，乐韵钧天，属吉庆征兆。这签的卦像是 见龙在田，利见大人；表示正处好运，但不可见好运而生出怠惰之心，以防自己做成不必要的阻力。"},
{"签位":"潜龙变化","签文":"潜藏自有光明日，守耐无如待丙丁；龙虎相争生定数，春风一转渐飞惊。","解签":"以龙喻示人的际遇，潜龙即隐藏着的龙，为什么要隐藏，因为时运不际，未得其时，所以潜藏以待，一旦风云际会，即可飞龙在天，利见大人了。求得此签者，万事待时，自有光明之日。至于腾飞之时，当在丙丁月日。"},
{"签位":"唐明皇游月殿","签文":"明月当三五，天地自无私；一阳来已复，得意在秋时。","解签":"唐明皇梦游于太虚之间，欲一会嫦娥，心念所至，游至月殿，得睹嫦娥歌舞，即霓裳羽衣舞，仙音仙乐，遂得以传至凡间。求得此签者，当知月在十五，为月圆之夜，阴盛阳衰，喻示小人得志，凡事不可相争，以忍气为妙；此签若在秋季时求得更为大吉。"},
{"签位":"唐三藏取经","签文":"正大有鬼神之助，吉祥成忠厚之报；不怕邪魔小崇，只看秋收冬藏。","解签":"唐时唐三藏立志弘扬佛法，为寻求正道，往西天竺取经，历尽千辛万苦，涉足山川险阻，凭着坚持之心，鬼神之庇护，终于得偿所愿，满载而归。求得此签者，只要行事光明正大，忠厚待人，必有鬼神之助，逢凶化吉。求谋以秋季为有利。"},
{"签位":"亢龙得水","签文":"柔顺而静，坤之六爻皆吉。阴盛于阳，不怕亢龙之悔。若此消息，只待羊兔相宜。","解签":"所谓亢龙，喻示人到极度好的时候；极度好是一件好事吗?严格来说，是不太好的，因为是到了极限的缘故，由最高极限，不会再有更高的，接着来的只有是慢慢走下坡，因此必须要有抑压疏导。求得此签者，凡事小心则吉，最好能随遇而安。"},
{"签位":"刘备取西川","签文":"如争如战，长子克家，从吉而贞。当知天从人愿，不必二二三三。","解签":"三国初期，刘备仍未建立蜀国，无立足之地，故进取西川，以为安身立命之地。得诸葛孔明之助力，终夺取西川。求得此签者，营谋合宜，且必定得到，是属于平步青云之象。但须谨慎，如欲以奸以营谋他人，则此签凶险非常。"},
{"签位":"盘古初开","签文":"临物易与，天地人合；一到春风，百祥骈集。","解签":"天地混沌，盘古初开，万物未齐，一切皆由天地慢慢地孕育出来。由于阴阳的涵盖，三才俱备，一到春风化育，万物祯祥。求得此签者，如能应时，则百事遂心，是大吉之兆，如春风未到，则困在这段时间，往后才能名利双收。"},
{"签位":"文叙中三元","签文":"喜喜喜，春凤桃李。鹊噪檐前，锦衣归里。酉戍相看，天佑好子。","解签":"伦文叙乃广东才子，尤擅长于对联赋诗。前赴京城考殿试，连中三元，钦点为状元及第，光耀门楣。求得此签者，名利两全，诸事皆吉，虽不能暴富骤贵，却可持久，无中途变更虞。春风桃李，喜鹊报喜于檐前的时间当在酉戍年月日。"},
{"签位":"岳飞出世","签文":"鲲化为鹏一任飞，长安路上好光辉；阴谋阴卜皆如许，顺水行舟定好归。","解签":"岳飞字鹏举，相传出生时有大鹏鸟在其屋顶盘旋。后洪灾暴发，飞坐于木盘上得逃难，求得此签者，凡事先凶后吉，有贵人扶助，险中有救。但必须要行为正直，安守本份为妙，若强行其事，反遭凶险。"},
{"签位":"古城相会","签文":"问仙须要酬天地，百事如心定有利；果能春秋两处好，龙虎呈祥，风云际会。","解签":"做每一样事情都要经过一些过程才能成功，所谓有因才有果。因此要遇仙的话。一定要先酬谢天地，以表明自己的真诚。求得此签者，初时必有异象，但如能处事心诚，勤俭克己，则必风云际会而有所成。"},
{"签位":"合兵破曹","签文":"一个兔儿一个鸡，等全无不合人思；有朝遇着东风力，且看天公造化机。","解签":"三国时刘备与孙权联合起来，在赤壁火烧连环船，大破曹兵。此大事业之成功在于双方合作及能借得东风之助，然后才可成功。求得此签者，除要得另一人的合作商量，互补长短外，还须有东风(时机)之助，然后才能顺风得利，是大吉之兆。"},
{"签位":"刘阮遇仙","签文":"十日坐，一日行；矶头有水，不碍利前程。问到如何境，刘阮天台不误人。","解签":"刘阮看破世情，慕道求仙，后游天台遇仙得成正果。求得此签者，对于自己追求的目标或理想必须坚定信念，一步一步地向前行，前途虽有幻景如海市蜃楼也不要为其痴迷，最后自不然能历尽崎岖而到达自己的理想。如占者能放弃故土风情，往外地发展则会大吉大利，必有所成。"},
{"签位":"宝剑出匣","签文":"有剑开神路，何妖敢犯神；君子道长，小人道消。月明终有望，河上任逍遥。","解签":"玉不琢，不成器，不能让人发现它的美质，同样，宝剑神兵，如果只是用匣藏着，那里显出其锋芒呢?因此，只要神剑出匣，就不会有妖魔鬼怪来相害，令到道长魔消任逍遥。求得此签者，如能忠信孝悌，自然奇逢佳境。"},
{"签位":"牛皋战兀术","签文":"一虎出山，一龙飞天。天缘人缘，上国收贤。生育之美，造化两全。","解签":"宋朝勇将牛皋，力拒金将金兀术大军之进犯，遂大战兀术。龙虎相斗，一定有所损伤，究竟是那一方会受到严重的灾害呢?就要看双方的造化谁属。求得此签者，可以乘时而起，既易且速，但切勿轻易与人争吵，以免转盈为亏。"},
{"签位":"仙姬相会","签文":"月到天心人有望，牛郎巧合属天成；不须辗转求良偶，天喜从人命自荣。","解签":"牛郎与织女虽然因为人仙的相合不为天帝所容，但亦被允许每年的七月七日在银河相会一次。喜鹊群集加桥以渡，让有情人可以得偿所愿，一解相思之苦。求得此签者，有偶然之喜，前进之象，凡事平安吉兆，尤以秋季七月时份大吉。"},
{"签位":"王勃中状元","签文":"时来风送滕王阁，运至何忧跨仙鹤。甲乙两运天云梯，也知桂香味早卓。","解签":"王勃为初唐四大才子之一，年纪轻轻便聪明绝顶，文思非常敏捷，其著名作品滕王阁序更传诵千古，为不可多得之佳品。所以常人以「时来风送滕王阁」来表示时来运到，春风得意。求得此签者，事事如意，若能积德行仁，更会逢凶化吉。"},
{"签位":"张飞喝断长板桥","签文":"一旦雷声震，四方皆有庆；转吉又增祥，壬癸子午定。","解签":"三国时关羽被曹操款待为上宾，但不许其与刘备会面。后关羽得悉刘备的去处，遂潜走出关，过五关斩六将，至长板桥附近人马疲乏，幸得张飞接应。张飞力拒曹兵，一声吆喝，长板桥为之折断，曹兵遂不敢再追。求得此签者，创业不会很艰难，但要守业则很辛苦，唯有以勤力、谦虚来处事即可。"},
{"签位":"孔明借东风","签文":"十日滩头生，一日过九滩。东风须着力，人事自完全。","解签":"三国时期曹操率兵南下，欲灭蜀、吴，蜀、吴联盟共抗曹兵。孔明与周瑜定计用火攻，但须有东风之助才能使火烧向曹兵。孔明于作战当日登坛作法，终借得东风火烧赤壁，大败曹兵。求得此签者，凡事得失不必看得太重，并要提防小人作祟。"},
{"签位":"崔梦熊得第","签文":"喜得秋风万事足，一举成中天下福；风凰五彩利飞行，只看子午时日卜。","解签":"崔梦熊初时运蹇时乖，屡试不第。后再奋进，勤加苦读，终在秋围之试得第，扬名天下。求得此签者，喻示努力坚心，做事有始有终，终必会名利成就，春风得意，喜气盈门。时间当应在子午年月日。"},
{"签位":"王道人炼丹","签文":"人转丹成白日升，神仙有数利人营；一朝走马龙行会，此是荣华一美因。","解签":"修道之人炼取仙丹，必须坚心持节，然后才能炼得丹药，令自己白日飞升。炼丹不独在初期要坚定，在接近丹成时更由于已反复的烧炼而要特别小心，一不在意则前功尽废。求得此签者，进一步好一步，但切勿停顿，否则很易功败垂成。"},
{"签位":"永乐王登基","签文":"吉人天相，子丑相当；西北有荣，风行水上。","解签":"永乐是明成祖朱棣的年号，他是朱元璋的第四子，后发兵以「靖雄」为名夺取帝位。求得此签者，其命运如云烟散尽，当见皎月当空，其光辉可达四面八方，喻示事事亨通，先难后易，其时应在子丑午月，方向在西北位有吉。"},
{"签位":"顺治过江","签文":"上上等，利有攸往。一日遇合，鼠牛相放。好好机会，名登天榜。","解签":"清顺治皇帝，在顺治元年入关，击败李自成迁都北京，由叔父多尔衮摄政，正是垂手可重天下。求得此签者，乃是白屋出公候之象，凡事皆吉，万事宜勉励进修，万不可有妒人之心，才可以如签所言，百事皆吉。得到好机会之时间在子丑年月。"},
{"签位":"煮酒论英雄","签文":"海上一龙飞，春风得意回；从此欣荣遇，只待一壬来。","解签":"曹操刘备共宴，当时曹为汉之大臣，挟天子以令诸侯，刘仍没有一兵半卒。边饮边说时，曹与刘谈论政治人物谁为英雄。当时谈及刘及孙权，刘听罢，汗流浃背，恐曹加害。求得此签者，虽危中有救，亦恐有无妄之灾，凡事三缄其口为妙。"},
{"签位":"陈万年再世姻缘","签文":"说到龙蛇马又来，看看无不遂心怀；前生俱是有缘份，及到今时运已该。","解签":"陈万年家境贫寒，家徒四壁，其妻差点饥饿而死，后发愤求学，经十年寒窗，终得高中进士，并与其妻劫后重逢。求得此签者，先凶后吉，在辰巳午年月好运至，营谋无不遂意。但需要谨记，占得此签的人要坚守心志，方可得愿，若三心两意，纵有富贵亦不能久享。"},
{"签位":"冯诚修告老","签文":"猪鼠相合，卯酉相同；一船满载，载载不空，得心应手；只在三四五成功。","解签":"冯诚修忠心为国，以天之任为己任，可惜奸臣当道，壮志不得伸展，遂不欲为官，辞官归故里，以待其时。求得此签者，要懂得时机知所进退，并以退守为最妙，故此勿心高气傲，一味冒进，适可而止，才可以见到吉祥。"},
{"签位":"梁灏大器晚成","签文":"一天喜气一门吉，一人有庆皆受益。一箭中红心，功名成遂转，祥风生四壁，门庭光奕奕。","解签":"梁灏为北宋时人，相传其年八十中状元，故称大器晚成。实际梁灏登第时年仅二十三岁而已!古时以「一人受皇恩(即有功名官禄)，全家食俸禄。」所以家中能得一人做官，则全家都受福荫。求得此签者，万事如意，可进则进，当止则止，一切顺其自然，勿强求则得天佑。"},
{"签位":"卞和进宝","签文":"凤翥丹山报晓时，人生得意是奇奇；看来自有探龙宝，日月光辉申与鸡。","解签":"卞和乃春秋时楚国人，他觅得玉璞，两次献给楚王，都被认为虚假，被砍去双脚。楚文王即位，他再次抱璞哭于荆山下，王使人雕琢此璞，果然得到宝玉，就是「和氏之壁」。求得此签者，初段困难，但切勿因谋未得遂而怨叹心灰，宜坚守忍耐，否极泰来，佳景将至。"},
{"签位":"赵子龙佐刘备","签文":"前生原是此家人，今世相逢定有因；龙虎呈祥遂天子，五三六二是奇期。","解签":"赵云字子龙，乃三国时常山真定人，初期辅佐公孙瓒，并忠心失志扶助汉室。曾以数十骑力拒曹操大军，有「一身是胆」的称号。求得此签者，功名富贵有神明护助，目前虽困，但终必逢时，如往东西方发展，营谋会得到丰收。"},
{"签位":"孙真人行医","签文":"猴儿来，兔儿去，龙呤虎啸；乃是收成佳遇，不须求际。","解签":"孙真人道法功深，善于治理奇难杂症，其行医济世，活人无数。求得此签者，如和志同道合之人合伙，则事业大有可为，名利皆成，能共患难共安乐之象。好运当在卯年月之后，待得申年月时便是。"},
{"签位":"湘子得道","签文":"干三爻，渐三爻；一时遇合，鹤鸣九皋。","解签":"湘子即是韩湘子，为传说中的八仙之一。传为韩愈族侄，后得道成仙。以易卦而言，一九以成十数，而六与十相逢谓之遇合，此时即可转为昌盛，正如鹤鸣于九天之中，任你遨游。求得此签者，则运颇为亨通，但名位则仍未彰显，凡作事如逢六或十则有好佳音。"},
{"签位":"姜维辅蜀","签文":"水上顺风吹，高才得意挥；学成文武艺，自有好栽培。","解签":"三国时蜀之诸葛亮辅助后王刘禅，后不幸病逝于五丈原，临终时将辅助蜀后之主的大任交予姜维。姜维受命于诸葛亮后，忠心辅佐，于是九伐中原，以期完成孔明之遗志，但最终也只是失败，姜维战死，蜀后主降魏。求得此签者，宜谨慎防守以避祸患，切戒除妄念贪求，凡事当忍让，处处向善，亦可转祸为祥。"},
{"签位":"郭嘉遗计定辽东","签文":"荣华贵，富贵来；天地生成，多吉少悔。三九遂心怀，虔许善功福自来。","解签":"三国时郭嘉，字奉孝，为魏曹操一员将领，为征服辽东而兴兵，不幸阵亡。临终时遗下计取辽东之策略予曹操，后曹操依计而行，终获成功。求得此签者，目下困厄，寸步难行，必须候灾星退尽，始无妨碍。因此暂不宜鲁莽行事，要知所进退。"},
{"签位":"梅花开二度","签文":"梅占花魁及第巍，天生福禄禄同辉；问到终身何所就，三七之内是荣华。","解签":"梅花傲雪，在冬春之间茂发盛开，除喻示纯结、气节外，更表示其情操与傲骨。梅花每年开花一次，但记载中，梅花亦有二度之开，以示再接再励。求得此签者，凡事务必忍耐，不宜强行施为，自然有吉祥临身。"},
{"签位":"龙马负图","签文":"自从河洛周天数，演到出门交有功；一生际遇须龙马，不用踌躇自合行。","解签":"伏羲时代，有龙马出自黄河，背负一图，是为河图。河图之数，天一生水，地六成之，居于北，为北方壬癸水，阳一与阴六相配，象征阳气始生。因此河图可说是敬受天命而来。求得此签者，正处运至时来，宜发愤努力向前，以达前途无量之境。"},
{"签位":"白马跳檀溪","签文":"阴德不是非凡事，积善之家度有余；厄去福来天凑巧，龙飞虎跃一鸡啼。","解签":"三国时蜀国刘备将降将坐骑「的卢」收为己用。后赴刘表宴会，蔡瑁等人欲杀备，备潜出乘的虏逃亡。堕襄阳城西檀溪之中，不能出。备说 「的卢，今日厄矣，可努力!」的卢一跃三丈，遂得脱。得此签者，虽危而有救，险处逢生，凡事谨慎。"},
{"签位":"张九龄出世","签文":"芹香鹿鸣，不远不近，二五之内，自然有幸，天喜文昌照命。","解签":"张九龄为唐朝玄宗时之大臣，他和赵冬曦评定吏部，选拔人才，都获得社会上的称誉公允。当张九龄出世时，鹿鸣于野，紫气东来，相传他是文昌照命，故此文章争命。求得此签者万事如意，十年之内当有成就。"},
{"签位":"大舜耕田","签文":"黄金自重，人天雨映；春花秋果，何悔何吝。","解签":"古时舜帝为有德行之人，故大尧退位即禅位让予舜帝，他努力耕耘，与民同耕食，故得万民爱载，同心协力，秋天收成时可得大丰收。求得此签者，喻示旦夕有喜，尤其是在秋天时节，做事营谋将渐入佳境及有收益。"},
{"签位":"鲤鱼化龙","签文":"时行运遂不须愁，一到桃花皆自由；果然渊内龙飞跃，脱俗超化始出头。","解签":"在中国一处叫龙门的地方，鲤鱼全部逆流而上，只要跃过龙门这一关，就可以化成龙腾上天。故求得此签者，现时正处于交接运势的关头，一旦跃过龙门三尺浪，就会超凡脱俗，有大的作为，正是否极而泰来，每事大吉。"},
{"签位":"三顾草芦","签文":"鞭策长安路，天仙第一班。已及时，春风桃李姓名奇。一枝独占梅花上，次第春风到草芦；三十六宫春，上国定观光。","解签":"三国时候的诸葛孔明号称「卧龙」，未出草芦已三分天下。刘备慕其名三顾草芦，礼贤下土，恳请孔明出山相助，以争霸天下。孔明感其诚，遂出山；后造成魏、蜀、吴鼎足三立之局面。求得此签者，由于自己的才能受人尝识，因此可以给自己一展才能的机会，凡事大吉。"},
{"签位":"桃园结义","签文":"富贵功名各有期，龙虎相逢鸡犬宜；果煞采获仙人手，自是金麟上玉时。","解签":"三国时代，刘备、关羽、张飞三人志同道合，希望能干出一番大事业，遂于桃园结义为异性兄弟。后果然凭着三人的努力，建立蜀国，与魏、吴成鼎足三立之势。求得此签者，凡事大吉，名成利就，尤其是合伙者其利益更为丰厚。"},
{"签位":"马超追曹","签文":"圆又缺，缺又圆；连又断，断又连；遇渡桥，舟在前；也须慎言，方得周全。","解签":"三国时曹操用计杀凉州人马超之父。后马超遇曹操于潼关，遂追杀曹操，弄得曹操要割须弃袍，后致命的一枪亦由柳树所挡，然后始得保全性命。求得此签者，喻示危中有救，会有虚惊，切要积善可保无扰。"},
{"签位":"赤壁鏖兵","签文":"只说有愁烦，事到其中兴不阑；逢午方可良，不必乱张惶。","解签":"三国时曹操率百万军队南下，孙权大为震惊；时朝上下臣子主战主和争持不下。刘备为自己利益，派出孔明入东吴欲联同孙权抗曹。后孔明与孙权大将周瑜取得共职，于赤壁用火攻曹兵，大获全胜。求得此签，目前虽有愁烦，但至午年月日即可解决。"},
{"签位":"刘备智取荆州","签文":"天有时，地有时，人尚少期；要得好时，也看三六九期，忧转嘻嘻。","解签":"三国时曹操发兵南下，刘备与孙权合计火烧赤壁，大破曹兵，令曹操逃返。藉此时机刘备用诸葛孔明之计，谋取荆州以为安身之所。求得此签者，当先惊后喜，作大事业时机未合，应该忍耐，如有人协助尽力扶持，则亦可成就大事。"},
{"签位":"佳人隔帐纱","签文":"莫孤疑，事在可疑。有可疑，不疾不徐，自有出头日子，当看金花一二枝。","解签":"有夫妇二人，为了逃兵乱而失散，闻得该地清山寺之神灵颇为灵验，二人遂分别进入该寺。夫在寺内墙上诗 「早年不到清山寺，得到清山雨未休。」后妻见后，续句 「天地也知离别久，故将风雨为君留。」求得此签者，宜心持善念，则可得贵人出面扶持；如怀恶则祸不远矣!"},
{"签位":"李龙寻妻","签文":"天时人事，正是好佳期，又恐跷蹊；但看双入卯金宜，只待十八子一提携。","解签":"李龙与妻为避兵乱，自家乡逃往京城，途中失败。抵京后李龙竭力寻觅，终能破镜重圆。求得此签者，只要凡事不忘其本，则可成就，如果能见善勇为，则更能获得贵人助力。此提携之人姓李，因「十八子」即「木子」凑合而成的「李」字。"},
{"签位":"蔡中兴修建洛阳桥","签文":"桥已断，路不通。若要通时，也候三五之中；许下善功息不穷。","解签":"蔡中兴乐善好施，常作修桥筑路之事。当时洛阳桥破烂，行人过之诸多不便，故发宏愿筹款修建此桥。由于精诚所至，观音化银相助，终必修建洛阳桥。求得此签者，做事只要诚心则可感动天地，终必有意外之喜，收成必佳。注意子、亥年月日，会是吉昌之时。"},
{"签位":"曹洪失潼关","签文":"已成了，又难保，只待舟济顺风行跑；每事多烦恼，虔心神前修省长安保。","解签":"曹洪为三国时曹操的堂弟，饶勇善战。曹操命洪守潼关以抵御蜀国刘备之大军，因自视过高，为诸葛孔明设计破潼关。求得此签者，须戒暴躁，急进及自以为是的性格，很容易被人所乘而致后悔莫及。故当安份守纪，以静为吉。"},
{"签位":"陈万年不第","签文":"一枝已报晓，恐难得，时尚早；有个成就之时，须向神前恳告。","解签":"陈万年十年窗下苦读，满腹经纶，才高八斗，赴京参加国考，可惜时运不济，命途多蹇，始终只得名落孙山。求得此签者，困厄当前，须待时机，凡事艰难。但因「一枝已报晓」，若再坚持苦练，假以时日，当可成大器，时间当在夏季。"},
{"签位":"陶渊明归隐","签文":"墙头草，篱下花，山穷水尽，未必繁华。若要繁华，也要归家，方可如心得奢。","解签":"晋朝陶渊明生性恬淡，品格天然，不为五斗米而折腰。由于爱好隐逸宁静的生活，放弃做官，归隐田园，过着飘逸的生活。求得此签者，若恋名利，则稍为痛苦，因名利会渐渐退减，若心无挂虑，将名利看淡，则凡事先难后易，可得安享生活。但凡事皆以退让为妙。"},
{"签位":"崔莺小姐","签文":"一声莺报上林春，恐是虚声，未必峥嵘；若要争荣，还候丙丁。","解签":"崔莺之父告老反乡，未至中途病亡，停柩于相国寺守孝。不料被贼人所见，围相国寺以求莺莺。后得张君瑞派人上书于白马将军，出兵退贼。张君瑞遂与崔莺结成夫妇。求得此签者，万事当以守为贵，临危有救，为先凶后吉之象。又丙丁在五行中属火，火旺于夏，故在夏天有利。"},
{"签位":"孙膑被害","签文":"镜破月缺，孙山保得；若要安康，酬神免业。","解签":"战国时孙膑与庞涓同学兵法，后涓任魏将，忌膑之才能，骗膑至魏，处以膑刑(截去膝盖骨)。后经齐国使者载回，齐威王任为军师，后大破魏军于以陵，迫使庞涓自杀。求得此签者，做事营谋艰辛之极，尤其恐防易被最亲密之亲友所计算，破财兼惹出祸端。"},
{"签位":"仁贵父子相会","签文":"虎坐中堂，鸡太相闹；天不如人求，反增多少笑。安而不危，菊花天到。","解签":"薛仁贵为求名利，遂投军从戎，经过连年征战，终于凯旋而归，衣锦还乡，遇见子丁山射雁，仁贵见虎而误射中丁山，后为神人所救。求得些签者，做事切勿急躁，以防内忧外患交并而至。犹幸有神明协助，虽有险而无妨，凡事须当谨慎，好运秋天才到。"},
{"签位":"桃花送药","签文":"一枝好花，风雨未到；只待清明香可味，顺水过渡。","解签":"病向浅中医，当发觉身体不适，立刻延医治理，就不会演变成大病，做事发现有漏洞或阻力，随即想办法解决，往往能阻塞漏洞及消除障碍，这都是防微杜渐。故此有病而有灵药至，即喻示险中有救，药到回春。求得此签者，凡事小心则无碍。"},
{"签位":"刘备借荆州","签文":"一半就，一半不就，惹得争斗。取之不合，治之宜早；吉祥方保，也要慢寻讨。","解签":"三国时代，魏、蜀、吴未鼎足三立。刘备仍未有立足之地，后从军师诸葛孔明的建议，刘备取荆州，遂得以建基立业。求得此签者，须看自己为何人物，如属刘备，则凡事大吉，因有创业之基地。如属借出荆州者，则此借出再无收回之象，属不吉。故为一半可以，一半不可以之卦。"},
{"签位":"王守仁归隐","签文":"月在天心人在船，名已将得，利已将偿，何不耐烦，不久起床，也要斟详。","解签":"明朝至守仁，早年因反对宦官刘瑾，被贬为驿丞，后归隐在故乡筑室于阳明洞中，故世称阳明先生，提倡「知行合一」。后平定「宸濠之乱」，官至兵部尚书。求得此签者，凡事见机行事则大吉，即应进则进，应退则退，谨慎即无灾至。"},
{"签位":"袁有信卖柴","签文":"皇皇典，喜喜贲，天衢平坦；只待小人得志，休得动风，自然既济。","解签":"袁有信为人忠直，分芥不贪。上山打柴往市场卖，公平交易，为人所称颂，后遇贵。求得此签者，宜心存忠厚，处世信义为本，安分守纪，切勿贪求非自己之物。如果命中是有的终须会有的，命中是没有的，任凭如何争取也不能得，故此知足常乐，切勿贪求一时之利而自取其咎。"},
{"签位":"金星戏宝儿","签文":"乐以忘忧，也要踌躇。事未必月在楼头，那得要休要休，可向金木人儿一构。","解签":"天上的金星仙，为试探宝儿是否有福份可登仙界，特自天界下凡相试，后与宝儿同登仙界。求得此签者，亦是吉。但由于金与木相克，故吉中亦藏凶险，宜谦和忍让，以耐守为至吉，不单可以避祸，亦能忍中致吉也。"},
{"签位":"永乐王定番邦","签文":"可罢即罢，不须斩尽杀绝，事到无可奈何；也要守旧安歇，力保无失可得，三七可决。","解签":"永乐乃明成祖年号，为明太祖朱元璋第四子，后夺取皇位，他解除藩王兵权，并屡次出兵打击蒙古势力，使得番邦不敢扰乱边境。求得此签者，须宅心仁厚，贵乎守成，有寸进便不可冒进，处事待人不可赶尽杀绝，留有一点余地给人，纵使非不得已，也要不急躁，不可胡乱地妄动，这样可保无所损失。决事当于二十一日内。"},
{"签位":"孙权坐镇东吴","签文":"去的去，来的来，东南一方。自迩遂依，切莫双疑猜。","解签":"三国时代东吴孙权乃承孙策之基业，在东南独霸一方。该地既民丰物阜，又有长江之险，孙权麾下谋臣、勇将众多，所以坐镇东吴、与蜀、魏鼎足而立，三分天下。求得此签者，名利可有，虽大多为承龚父兄者，亦可由你手中得到拓展。"},
{"签位":"武侯伐魏","签文":"苦而甘，甘而甘，一子一午。送喜不送忧，也要自裁生。","解签":"诸葛亮受蜀汉主刘备于白帝城托孤，除辅助阿斗为蜀后汉主，更预算把魏及吴两国吞并，统一全国。由于魏亦拥有颇多兵力，故此诸葛武侯六出祈山，仍然无功而还，求得此签者，有进又难、退又难的局面，凡事只要坚定心志，则可有小成也。"},
{"签位":"平贵鸿雁传书","签文":"鸿飞天外，舟动无风；人有月明中，自有喜相逢。","解签":"石平贵为保卫国土，征西十八年，未得返家，靠鸿雁得书，以报平安。后完成征讨后回国，返家始得夫妻相会。求得此签者，有久屈而得申之现象，亦先凶后吉之意，使平来抑屈的命运，因突然接获佳音而得以舒展，正如舟楫无风自动一样。"},
{"签位":"文昌三圣","签文":"吉吉吉，益益益，不必多急，自有文章东壁。只在初三十一，方可必，方可必。","解签":"文昌是业管学问的神祗之一，分有文曲星、文星和魁星，主宰功名、禄位，为读书人所祭祀。因此以前的人说某某文昌或文曲入命或魁星点斗，其必得功名利禄，故文昌为吉星，初三、十一日为文昌照顾，自有显赫的文章。求得此签者，可得吉星拱照，虽然途中也有险阻，但终必没有凶险。"},
{"签位":"白帝城托孤","签文":"龙已飞，虎已归，笙歌已歇；兴而不久，万事如灰。","解签":"三国时蜀汉主刘备出兵伐吴，被东吴大将陆逊火烧七百营，忧病不起。诸葛亮至白帝城往见刘备，刘备将其子阿斗(即刘禅)托付予诸葛亮，并拜亮为相父，以辅政事。求得此签者，凡事皆空之象，运乖才高者亦无高升之象，唯修身修德之人或可转危为安。"},
{"签位":"汉玉路逢拐骗","签文":"生之时多乐，半路上下不相逢；只看无妄之卦，方可悔吝分明。","解签":"汉玉长于富贵之家，未知世逢凶险，携金外游，途中被人尽骗金钱。求得此签者，自身作事须小心谨慎，提防外出途中有惊险之事发生，弄至恐惧、忧虑尽现眼前。幸而善人占得之无碍，存心正直者占之亦吉，完全视乎个人的德行而有所不同。"},
{"签位":"杏元和番","签文":"一天星斗灿辉煌，风雨未光；起而不扬，也要两三番。","解签":"古代匈奴屡犯边境，为免两国兵戎相见，祸及无辜的百姓，于是用和亲政策，送出杏元出嫁匈奴王，由于结有姻亲的关系，从此平息两国的纷争。求得此签者，虽处凶险亦藏有象，只要事事以谦和为本，则诸事到头来都会无妨也。"},
{"签位":"姜子牙卖卦","签文":"得失皆天定，忧喜总归命；知天知命，守之为幸。","解签":"以笃信天命来说，一个人的得与失皆由天所定。即如相助周文王灭商的姜子牙，在未得文王器重时，所遇之生活亦是非常艰苦，是靠着人家占卦算命为生。求得此签者，万事宜慎，切勿轻躁行事，如能耐守待时则吉。"},
{"签位":"张飞战张合","签文":"一跌复一跌，只恐卤莽灭裂；果能惜得寸金，也要调摄。","解签":"张飞乃三国时蜀国一员勇将，兼有智谋，张合是三国时魏国一名猛将，亦有智。于蜀魏交战期张飞遇张合而开战，双方愈战愈勇，数次更换坐骑，由大家有虽强烈敌意以至惺惺相惜。求得此签者，只要待人忍让嫌和，当可趋吉避凶，和气致祥。"},
{"签位":"刘禅登位","签文":"一门天赐平安福，只恐小人不理。防犬防牛，应取不取；只在三旬里，也有三分喜。","解签":"刘禅是三国时期汉后主，小字阿斗。公元二二三至二六三年在位，初由丞相诸葛亮辅政，亮死，信任宦官黄皓，朝政日渐腐败。他出降于司马氏的西晋朝，封为安乐公。其登位后做皇帝四十年，亦可谓安乐。求得此签者，虽初段显示吉祥，亦须处处谨慎，时时提防，尤其丑戍之年、月、日，求得此签是不吉之兆。"},
{"签位":"伍员走难夜出昭关","签文":"防口甚于防川，不当顽顽；急水莫开船，也要黄昏，乃命得长。若知消息，方要周旋停当，当在二七三上。","解签":"伍员是春秋时楚国人，又名伍子胥。楚平王七年其父伍奢被楚王所杀，他逃亡辗转入吴，助阖闾杀吴王僚夺取王位。后发兵攻破楚国，时楚平王已死，伍员挖其坟，暴其尸，并鞭尸三百以泄愤。伍员逃亡时要出昭关才能越境，因忧虑过度，一夜白头，因而未被发觉得以逃生。求得此签者，凡事小心，防小人口舌及谨慎则吉。"},
{"签位":"海瑞中龙头凤尾进士","签文":"锦衣万里，劳劳而后喜，一朝可望生成；也是文昌照汝，定是佳人贵子。","解签":"海瑞乃明朝广东琼山人，家庭贫寒，后中进士，为官清廉，甚得人民拥戴。求得此签者，若为忠厚忠诚的人，经过一段奔波劳碌的日子后将可望得青云有路，谋望有成，升职加薪自不待言。东南西北，无往不利。此是天命所赋，亦是精诚所至，自助人助的道理。"},
{"签位":"黄巢归天","签文":"黑云迷径人难走，桥断风吹舟又危；莫思徘徊，且去自思维。","解签":"唐末时盗贼黄巢作乱，率众百万由湘水北上，攻克洛阳，后进入长安即皇帝位，国号为大齐，改元金统。至金统五年，战事失败，退至泰山狼虎谷被围困，自杀死。求得此签者，乃笼中困鸟之象，凡事不吉。如能修德行善，见义勇为，则可免灾危之厄。"},
{"签位":"韩信问路斩樵夫","签文":"白日雨如注，行人已自栖，闻道天衢泰；还有不宁居，何必向前进，危且殆乎?","解签":"楚汉相争之际，韩信协助汉王刘邦与楚兵相战。韩信为出奇谋袭楚，绕道而行。惜道路方向未明，遂下马问樵夫路向，韩信听后，把樵夫斩杀，部将问何故?韩信称恐樵夫泄露他们的行踪。求得此签者，须视其身份而定。如属韩信者，则虽有危险但终必无碍，如属樵夫者，则凶险非常，不吉之兆。"},
{"签位":"王道人收妖","签文":"鬼迷神不佑，须求天神救；立善行功成，好事方成就；三接其画，多许诚求。","解签":"唐朝李小二为人鄙吝，损人利已。好探听人之险私，然后广为宣传，为乡里所不齿。一日在荒郊为妖所惑，返家后即迷惘浑噩，终日痴痴呆呆，后其妻闻得王道人功法精深，遂前往恳请王道人出山收妖，王道人感其妻意诚，遂替李小二除妖，求得此签者，宜改过行善，回头是岸，则可获天福。"},
{"签位":"仁贵投军","签文":"猛虎噬人，恶犬欺生；一个昏天，如何扬眉吐气。","解签":"薛仁贵自少臂力惊人，武艺超卓，但生活清贫，于是报名投军，希望能从武事出身。虽然仁贵在军中屡立战功，但为主帅冒名所夺，终至劳而无功。求得此签者，凡事辛苦，同时受小人羁绊太重，一切皆难开展。逢寅辰年、月则吉，此时开始转运。"},
{"签位":"隋杨广夜看琼花","签文":"天不佑之，时不合也；花被风折，人在海底。","解签":"隋朝君主杨广得悉降琼花，遂驱车前往观尝。此花虽然艳丽，但开花为时很速，喻好景虽好，但时日无多。求得此签者，做事决策宜小心谨慎，最忌是出门，不管是公干私事皆不宜，为不吉之兆，亦事情有所阻滞也。若能修德行善，亦能消灾。"},
{"签位":"六出祈山","签文":"水落石出，荣华已矣!若得一通，除非再起；不宜前进，当守时势。","解签":"三国时期诸葛武候为报答蜀主刘备知遇之恩，在刘备死后经过生息积聚后，六出祈山伐魏，可惜每次皆劳而无功。此显示出运势已到尽头，一时还未畅通，勉强而行，只会劳心劳力而到底不利。所以这时候，应该以守成为佳，不宜再作前进。"},
{"签位":"渭水访贤","签文":"前车已覆，当为殷鉴；安份守命，自然顺便。","解签":"姜太公文韬武略，但时乖命蹇，一直未为明主所重用。八十岁时垂钓于渭水，为当时文王所尝试，亲至渭水聘姜太公为相，相辅政事，后果助文王灭商成立周朝。求得此签者，由于气运所管，贤人君子当要忍耐守候始得其利，凡事不可强求，即使强求也不能得也。即如栽植乔木，亦须经相当时日，始可为人所用。"},
{"签位":"赵子龙救阿斗","签文":"墙倾屋拆，大势已裂；防而无悔，土崩地决。","解签":"赵子龙为三国时蜀国一员勇将。当曹操率魏兵大军压境，蜀主刘备妻携子逃进井中避祸，赵在途中与刘妃及阿斗失散，遂折返找寻，于废墟中与刘及斗相遇，刘将斗交付给赵带返予刘备，然后投井身亡，以免拖累。赵凭一枪一剑一马背着阿斗冲破重围得以逃脱。求得此签者，凡事须经重重艰辛始得成功，亦有虽危有救之象。"},
{"签位":"庄子鼓盘歌","签文":"不是知音不与论，只看镜破风不正；逆水莫行舟，气散宜当尽。","解签":"庄子即庄周，战国时人。其妻子逝世，惠子前往吊唁，庄子拿起一个盘敲击而唱歌。旁人问之，庄子说其妻子不过是去往另一世界生活，不值得悲哀的。以一个拘谨的人来看，庄子的行为是怪诞的，但庄子是一个逍遥而祟尚无为的人，他的思想是有其一定的喻示。求得此签者，对婚姻极之不利，不是其妻子气数已尽，就是夫妻破镜难圆。"},
{"签位":"三国纷争","签文":"三分而已，何须望奢；人要回家，只待日西斜。","解签":"三国时代的魏、蜀、吴三国鼎足而立，虽然初段时间大家互相攻伐，但劳而无功。在当时，魏挟天子以令诸侯，地大物博，蜀得汉中之地，有人和而物质富庶，吴得长江天险，人杰地灵，互有优点，故此产生均衡之局面。求得此签者，要贵乎知足，不要得陇而望蜀，否则亦是劳心劳力，终归无大进展。"},
{"签位":"合兵破曹火烧赤壁","签文":"合而分，分而合；天时人事，雨斟酌。","解签":"三国时代，魏、蜀、吴三分天下，各自都希望打败对方，一统天下。魏国曹操率领百万大军南下，欲灭蜀。时蜀主刘备兵微将寡，难以抗衡，遂联络吴主孙权共同抵御曹兵。借着地利与人事的调动得宜，终于火烧赤壁，得以大败曹操，从而取得鼎足三立之局。求得此签者，作事吉，但亦须事事与人商讨后才做，不可独断独行，这样凡事皆吉，可以无恙。"},
{"签位":"泥马渡康王","签文":"月已落，风又紧，舟无蓬，水底影；若要如心，三春一景。","解签":"本来泥马下海，是一去无踪的，但此泥马于康王落难之际，竟然能驮渡康王，避过一难，实在是精诚之所至，所以才能有此遭遇。求得此签者，喻示险中有救，故虽危但终不至险厄。故处事须谨慎而慎之，时时留下退一步之地，予自己能有所借力也。"},
{"签位":"张士贵投军","签文":"马已疲，人又疾；天不从人，何须亟亟。","解签":"张士贵贫无立锥，于是投笔从戎，初为马步先行，累积颇多之功勋，但均为主帅所冒夺去。其中一次单骑救主，亦只不过是多一点赏赐而已!但至最后，亦终能扬名吐气，为国家立下功劳，为自己奠下名利。求得此签者，初时命运不济，后则春风得意，所以初段时间，诸事不吉，故不要强求名利，假以时日，终必有所作为。"},
{"签位":"蒙正赏月","签文":"秋风正好月当中，忽被雨朦胧；如何往，难成功；不宜谋，须神工。","解签":"蒙正未发迹时，因苦至极，三餐不继。忽见好月当头，虽言赏月，实质触景愁思，满怀浩叹，何赏之有?正如「黄莲树下弹琴」——苦中作乐也!求得此签者，名利未遂，如月上中天，忽然下了一阵雨，弄得月夜迷朦，际此困顿之时，一切宜养晦为妙。运势会在进入冬季时渐趋好转。"},
{"签位":"伦文叙不第","签文":"一去中阻，云雾不开；且自宽怀，须许善愿无碍。","解签":"伦文叙幼读经书，文思畅达，尤擅长于吟诗作对，常有惊人之语。其诗句用词显浅而多触景，故为乡里所称颂，有「鬼才」之誉。他未发迹时，家境清贫，尝参加考试落第，后得中状元，光耀门楣。求得此签者，不管是求名抑或求利，皆有阻障。须经历千辛万苦，始得吉祥。"},
{"签位":"槐阴分别","签文":"席已散堂中，寂寞恐难看；若得重欢，只待一轮月上。","解签":"董永为一个孝子，因父丧无力葬父，遂卖身为奴。后得天上织女垂青，下凡与他结为夫妇。并与家主订下十天织锦百匹为约，使他得以偿债赎身。天帝怒织女私自下凡，令天将捉回织女返天庭。当时织女已怀身孕，相约来年在他们订下婚盟的槐荫树下再见面。天姬送子还。求得此签者，凡事皆平安，如守株待兔，屈而求伸之象，对姻缘犹更不吉。"},
{"签位":"子孔子在陈","签文":"锦绣不成文，只恨修之短；挽回时命，鸡鼠猪牛，也宜推让，问过收成子罕上。","解签":"孔子为春秋时人，被人称为万世师表，至圣先师，有门上第子三千，具圣贤者七十二人。孔子不独为一教育家，亦为一思想家，希望以「仁」治理国家，故曾率领第子周游宋、卫、陈、齐、楚等国，以推广其思想，至陈国时绝粮。其时门下弟子子路怨叹不已，孔子则说，此皆因远不通而有此危。求得此签者，凡做事莫急，待时机来则水到渠成，逢凶化吉之兆。"},
{"签位":"伯牙访友","签文":"悔亡悔亡，空耗两难。人在东，西何可遇，莫劳心力待时遇。","解签":"春秋时代的伯牙善弹七弦琴，唯曲高和寡知已不多。后在江上鼓琴，得遇钟子期从琴音中知其喜乐，知其所指，故结为兄弟。两人约期于某日叙会，不料钟已夭丧，伯牙访之不遇，在其墓前再弹奏一曲「高山流水」以为绝唱，后伯牙更碎琴以表再无知音之人。求得此签者，空怀抱负，终不得展，凡事不吉，需处处小心提防。"},
{"签位":"七擒孟获","签文":"隔了几重山与水，前途终是隔难行；只待草头人，方可两成谋。","解签":"三国时代，诸葛孔明为承继刘备的遗愿，北定中原，所以考虑伐魏，当时南方蛮人经常搔扰蜀中，孔明欲先平定南蛮，再图北伐。南峦主倾心信服，终其一世不再犯境，求得此签者，事虽成但要歴尽艰辛。而且若能与草姓人商量谋事，成功的机会会更大。"},
{"签位":"生祭李彦贵","签文":"雨打梨花，人在天涯。功名多费力，图事不能成。阴阳反复，时过令人嗟。","解签":"李彦贵求功名自家乡上京赴考，途中遇难获救，家人未悉，以为已赴险曹，故祭之。求得此签者，运蹇时乖，诸事欠吉，加上事事反反复覆，时好时坏，令人摸不着头脑。唯有自已处处小心，靠神灵的庇佑，朋友的协助，然后才能从危机中得救援，一切须待时机。"},
{"签位":"李旦受劫","签文":"莫急走，看绊跌，云掩风霾，终是一场冤业；若冤业，修省方免得。","解签":"李旦因受迫害，装疯至陶府拆情，后得马周访主返朝，艰辛之极，然真命天子有百灵护助。求得此签者，命运现正受一时困顿，如舟破加上风狂，当然是危险之极。但由于有第三者的帮助，终能化险为夷。"},
{"签位":"玄德离许都","签文":"雷声大，雨点小，纵好不好；事在解铃人，福自改过，多行善可保。","解签":"刘玄德，即刘备，三国时其蜀国之创国君主，受人民爱戴。未称号帝位时，与军师诸葛孔明占有许都城，后曹操挥军南下，直迫许都城，玄德知己方的军事力量远逊于曹兵，遂离城，并公告欲随其他往者可以一起成行。由于玄德待民宽厚，即号召了十余万人跟随。求得此签者，凡事只要小心，虽先厄但后得大吉。"},
{"签位":"梁山伯路遥访友","签文":"心急马行迟，妄干何有益；且自安份，天神护吉。","解签":"梁山伯与女扮男装的祝英台同窗共读三年，感情非常好，但未知英台为女性。英台返家前向山伯托言其妹之才貌与其一般，并许婚予山伯。唯山伯于约期后三天才至英台府邸，英台已被其父许婚予富豪马家。山伯忧忧而终，英台出嫁日往坟至祭，亦殉情而死。求得此签者虽安份守纪，有缘份当有机遇，此时应把握，倘时机一失，过后很难再次觅求。"},
{"签位":"蒙正捞斋","签文":"事已如此，悔之何及；纵有不祥，还宜阴骘。","解签":"蒙下家贫，但苦学不断，为求得到饱暖，专心致志，于是寄住寺院，以求两餐。依寺院规定，饭前敲钟，由于寺内有些和尚轻视蒙正清贫，于是有一次在饭后才敲钟，使他无食。蒙正自此更艰苦读书，后得中状元。求得此签者，能修德行仁，获福当在其后，此乃先苦后甜，先难后易之象，应多积阴骘才可。"},
{"签位":"孟尝君被害","签文":"已入笼，何可脱；已落空，难觅着。遇鸡鼠，自知觉；病果起，勿服药。","解签":"孟尝君为战国时期齐国的相国，拥有食客三千。未失势时，得食客冯暖为其在食邑薜市义，尽焚该地百姓契约债券，得万民感恩拥戴。后孟尝君被诬告逃亡，抵关卡时因未天晓开关，由门下食客扮鸡啼顺利出关，得保性命，后得冯暖之计再重掌相位。求得此签者，若广积阴德当能转祸为祥，逢凶化吉，险中有救。"},
{"签位":"孟姜女寻夫","签文":"潭深鱼不饵，鸟飞难弋获；时势已如此，一笑又一哭。","解签":"相传秦始皇为巩固其皇朝千古不易，于是劳役万千人民建筑长城，抵御敌人的入侵。其中范杞良亦被调往修筑长城，其妻孟姜女为他送寒衣至长城，时杞良已死，孟姜女悲恸其夫之死，哭于长城之下，情感动天，长城亦为之崩塌，并在当中发现杞良的骸骨，后自尽殉夫。求得此签者，诸事不利，宜谨慎提防，积德行善可解。"},
{"签位":"范仲淹卖字","签文":"吉凶相半人宜识，莫任劳劳损无益；有时天运一回还，自然天道无痕迹。","解签":"范仲淹为北宋时人，擅长于诗词散文，文章有丰富的政治内容。少时贫困，但力学而苦读，两餐无继，于是上街卖字维生，至大宋祥符时考得进士，自此官到宰相，位极人臣。因此，凭你才高八斗，满腹经论，只要时运不济，亦不能有所作为，一旦天运回还，荣宠立见，了无退缩。求得此签者，初期运虽蹇，后必得亨通。"},
{"签位":"姜太公渭水钓鱼","签文":"东不如西，也要识时，是乃有命；可不知之，知时命，久谋自合宜。","解签":"姜太公即姜望，为一智勇双全之人。未受周文礼遇之时，经常坐在渭水之滨垂钓，但即钓即放，人问之为何?答有待时机的来临。故此姜太公实具有大智慧，知命亦知进退，能守而待时机。因此终能于八十高龄，受到文王之礼聘为相，辅助文王灭商纣而取得天下。求得此签者，营谋事虽成，但必费尽颇多心力始能达至。"},
{"签位":"邓艾钟会入川","签文":"可以转移，可以了结；只恨运命屯邅，故此一得一失。","解签":"邓艾为三国时人，为魏之镇西将军，与蜀将姜维相拒，后同钟会分军灭蜀，因被诬告谋反被杀。钟会亦为三国时魏国人，官至司徒，为司马昭重要谋士，公元二六三年，与邓艾分军灭蜀。蜀将姜维假降于他，两人密谋反魏，次年事败被杀。求得此签者，凡事不要急躁，自然有益无损，即使失去先机，也不可萌生退念，小心地进取，尚有可为之事。因此纵有灾晦祸患，也可无碍，是先凶后吉的征兆，由于命运之顺逆，而生出一得一失之势。"},
{"签位":"孔明求寿","签文":"月落星沉，风生雨至；只要龙虎不相争，方可如时利。","解签":"在三国时代，诸葛孔明为蜀国之军师，自白帝城刘备临死托孤后，孔明矢言承继刘备之遗志，讨代魏国。兵至五丈原之际，孔明病重，于是在军营内设七七四十九盏灯长命灯，登坛求寿。可惜被蜀将魏延闯入，踢翻星灯，求寿不成。以星代表寿命，故「星沉」即寿终之意。求得此签者，宜修身自省，方可无百碍，而一切想进行之大小事宜，均有所不宜。"},
{"签位":"日出便见风云散","签文":"日出便见风云散，光明清净照世间；一向前途通大道，万事清吉保平安。","解签":"只要太阳一出来，一切就会风消云散，只要光明一普照，世间便见清净太平。前途是光明正大，只要努力前进，正是 “条条道路通罗马”。只要你做事 问心无愧，神明自会保佑你万事清吉平安！抽到此签，表示谋望难成，但是不可灰心，只要锲而不舍，继续追求，认真努力，自然有成功的一天。求交易，利润轻微。问功名，有 志竟成。问婚姻，有情人终成眷属。问诉讼，若蒙冤终获平反，如系民事，以和为贵。"},
{"签位":"于今此景正当时","签文":"于今此景正当时，看看欲吐百花魁；若能遇得春色到，一酒清吉脱尘埃。","解签":"尽管目前还是隆冬的景象，百花却已含苞待放，娇艳欲滴，只要春光一到，立刻会有一番新气象。求得此签暗示目前福报欠佳，问事求谋，正是困难时期，只要能够多求神布施增加福份，努力向上，紧接而来的，必是一帆风顺。故一个人做事不要怕失败，一定要更加努力，必能东山再起。问功名，希望不大，好好充实自己，等待秋天再进。问婚姻，就像百花盛开定有好消息传来。问疾病，老幼妇人危险宜消灾。"},
{"签位":"劝君把定心莫虚","签文":"劝君把定心莫虚，天注衣禄自有余；和合重重常吉庆，时来终遇得明珠。","解签":"劝你作任何事都要当机立断，不可三心二意，福禄本是天注定，该是你的就会是你的，应该积极修德养性，礼敬天地布施功德来增加福报，只要慎谋能断很快就会得到你所追寻的“明珠”。求得此签暗示目前福报不足，问事求谋难成，信心不足易患得患失。若问婚姻，须有专情，缘份一到，自然有情人终成眷属。问事业，当事人要有定性，遇到挫折必定要自我检讨后再接再厉，定能成功。问愿望 不可见异思迁，如果受到一些挫折，就放弃不做，就永无成功之日。问求财出外有小利。问功名，一定要更加努力。问移居可得安康。问疾病，病况不稳，祈神消灾不畏。"},
{"签位":"风恬浪静可行舟","签文":"风恬浪静可行舟，恰是中秋月一轮；凡事不须多忧虑，福禄自有庆家门。","解签":"风平浪静，船行无碍，就像中秋明月，圆满皎洁。凡事不必多忧虑牵挂，福禄自有也不须外求，等时来运转，自然喜庆满门。这是一首很幸运的签，表示一切能顺利如意，圆满达成。求得此签暗示目前福报稍有不足，问事求谋难成，机缘未到时易忧心烦恼，如果是应考之人，是金榜题名的好兆头。这首签诗除了表示功名有望，福禄齐全外，如问诉讼，表示要走的正。如问婚姻，表示和谐美满。如问移居，一切顺利安康。问疾病，祈神消灾近日痊愈。"},
{"签位":"只恐前途命有变","签文":"只恐前途命有变，劝君作急可宜先；且守长江无大事，命逢太白守身边。","解签":"尽管前途多有变故，劝你莫心情焦虑。既然不得先机，就暂时守在长江头，命里自有太白金星等神明保佑，自然不会有什么大事情发生。这首签诗暗示做事须有先见之明，不可燥进鲁莽行事，以免造成不必要的变化。并且多拜神增福来获得神明的庇护。求得此签暗示目前福报不佳，问事求谋不宜急进，所谓欲速则不达，且须等待时机。问婚姻，对方可能有意中人，成功希望不大。问诉讼，和解为宜。问功名，有希望。求财平平。事业宜按步就班，不可好高骛远。问迁移或变动职位，不吉。总之，不妄动，求神化解自保安泰。问疾病，宜消灾。地有阴邪，男无妨女危险。"},
{"签位":"风云致雨落洋洋","签文":"风云致雨落洋洋，天灾时气必有伤；命内此事难和合，更逢一足出外乡。","解签":"风云招来豪雨，汪洋一片，命运造成了伤害。一个人命里无时莫强求，既然没有和合的希望，就不必再出外奔波了。“命里有时终须有，命里无时莫强求。”如果命中福报不足，强求也没有用的，就像那不测的风雨造成天灾，乃是一种不可抗拒的灾害，是无可奈何的。唯有平时多拜神累积福报。求得此签暗示目前福报不佳，问事求谋拖尾难成。问求财，无希望，勿去强求。问诉讼，宜和解，莫逞强。问婚姻，另找对像问迁移，不可妄动。问疾病，宜消灾。地有阴邪，老幼危险。"},
{"签位":"云开月出正分明","签文":"云开月出正分明，不须进退问前程；婚姻皆由天注定，和合清吉万事成。","解签":"阴霾扫尽，云开月出，不须再多问了，可以直奔前程。婚姻是上天注定好，只要是天作之合，一定和谐美满。求得此签暗示目前福报尚有不足，问事求谋多虑举棋不定，宜多求神明祈福可得圆满。如果是问运途，可以说是“否极泰来”，即厄运已过，现在已渐入好运了。问婚姻，表示佳偶天成，有情人终成眷属。此签问做事，可以成功。问求财，开始见利。问出外移居，则不利。问诉讼，和解可无事。问疾病，宜消灾。幼危险。"},
{"签位":"禾稻看看结成完","签文":"禾稻看看结成完，此事必定两相全；回到家中宽心坐，妻儿鼓舞乐团圆。","解签":"田里的稻穗累累，辛苦的汗水与耕耘，将有丰盛的收获。看到好的收成，心中的忧虑烦恼尽除，终于可以安心的回到家里跟妻儿们快快乐乐地载歌载舞。这首签诗表示，有一分耕耘，终有一分收获。昔日流汗，今天总算看到丰收了。但如果没有往日的流汗，那有今天的收成呢？求得此签暗示目前福报俱足，问事求谋大抵先苦后甘，先否后泰。问婚姻，表示有情人终成眷属。问事业，要脚踏实地去做，不可投机，投机必败。问功名，如在秋天，有希望，如在冬天，须待明年。问疾病，宜消灾，老危险。"},
{"签位":"龙虎相随在深山","签文":"龙虎相随在深山，君尔何须背后看；不知此去相爱愉，他日与我却无干。","解签":"你我好比龙虎斗，却一起在那深山里，没有任何顾虑，却不知这种相爱，乃是一种错误的决定，恐怕他日，会变成你我无干的局面！这首签诗暗示当事人，如果两个志趣不合的人，勉强凑合，一定无法持久。所以如果问婚姻，是难偕白头之兆。问合伙生意，最后会拆伙，而且恐怕会闹得不愉快。问谋事，因竞争太多，恐怕难逐意。问求财，问功名，都是一样，很难。移居、外出旅行、变动职位，都不吉，宜静守，不宜妄动。"},
{"签位":"花开结子一半枯","签文":"花开结子一半枯，可惜今年汝虚度；渐渐日落西山去，劝君不用向前途。","解签":"开花结果，却是一半落空，收获不多，可惜你今年的光阴算是虚度了，太阳渐渐向西山落去，所谓 “夕阳无限好，只是近黄昏”，劝你定下心来拜神来增添福报，看开一点吧，还是不用再劳心劳力奔波了。求得此签暗示目前福报平平。问事求谋事倍功半。只宜守成。问出外，空劳往返，所以不吉。问婚姻，因签有结子一半枯，今年汝虚渡之句，恐怕难成。移居、变动职位，均不吉。问疾病，元辰暗淡有五鬼阴邪作祟，老幼危险宜消灾。"},
{"签位":"灵鸡渐渐见分明","签文":"灵鸡渐渐见分明，凡事且看子丑寅；云开月出照天下，郎君即便见太平。","解签":"灵鸡一啼，天渐渐亮了，凡事就看明天了。云开月出，佛光普照天下，太平景象即将呈现眼前了。这首签诗的灵鸡(酉)可以当作农历八月解释。子丑寅为十一，十二和正月。意思是，黑夜过去了，鸡一啼，黎明就接着来了。一个人一生不会都走霉运的，当时来运转，正如“云开月出”，必定会有一番新气象。求得此签暗示目前福报尚有不足。问事求谋，宜求神明祈福可得圆满。问做事求财，可以说渐渐有希望。这首签诗是苦尽甘来之兆，所以问功名，表示你十年寒窗，有出头的日子了。问婚姻，表示有情人终成眷属。移居平安，出外可行。问疾病，病情加重，元辰暗淡有五鬼阴邪作祟、病拖尾，宜消灾。"},
{"签位":"长江风浪渐渐静","签文":"长江风浪渐渐静，于今得进可安宁；必有贵人相扶助，凶事脱出见太平。","解签":"长江的风浪渐渐平静了，现在船只可以前进，并且可以安宁无事了。只要积极前进，一定会有贵人相助，即使遇到困境，也能逢凶化吉之兆。如有困难，现在慢慢可以化解，不必忧虑，否极泰来，风浪终会过去的。一生多贵人助，所以常能逢凶化吉。移居出外旅行，均吉。如问诉讼，可逢贵人而化平安。问功名，有贵人提拔之兆。问婚姻，只要媒人出面，婚谈可成。"},
{"签位":"命中正逢罗孛关","签文":"命中正逢罗孛关，用尽心机总未休；作福问神难得过，恰是行舟上高滩。","解签":"命中正遇到“罗孛”凶星的关头，虽然你用尽心机也避免不了，就是问神祈福，还是躲不过去，正像行船遇到沙滩，进退不得。抽到此签，表示你目前正在进退维谷的时候。问出外移居，不吉。老年人抽到此签，表示一生空费心机，老来已无甚希望。若年青人抽到此签，不必难过，正是考验你的时候。只要你能克服困难，自有一光明前程。问功名，还是要充实自己，目前希望不大，问婚姻，缘份未到恐难成，不宜勉强。问疾病，须谨慎医治，少年人尚无碍，若老年人，则恐有问题。"},
{"签位":"财中渐渐见分明","签文":"财中渐渐见分明，花开花谢结子成；宽心且看月中桂，郎君即便见太平。","解签":"即将来临的财运或好运已渐渐明显，正像那花开花谢后，结满了果实一样。无须焦急不安，且宽心等待中秋节的到来，你所企盼的愿望将会圆满达成。求得此签暗示目前福报尚平平，问事求谋，宜求神明祈福可得圆满。如问事业，表示已有转机，财运也将慢慢到来即使目前财利不显，但只要耕耘，必有收获。只怕不肯用心努力，随世浮沉，就像那花开花谢，月亮盈亏，得失相伴。问功名，也是一样，如果不去充实自己，只想碰运气，是难得有成就的。问婚姻，有情人终成眷属，婚姻可成。问诉讼，只要出于至诚，必能平安无事，能破财消灾。问疾病，危险有阴邪元辰暗淡，宜消灾。"},
{"签位":"八十原来是太公","签文":"八十原来是太公，看看晚景遇文王；目下紧事休相问，劝君且守待运通。","解签":"姜太公到八十岁，仍然怀才不遇，只好在渭水河钓鱼等待时机，一直等到文王听到他的贤名，来拜访他，才时来运转，受到文王的重用。你目前的情况，跟太公的遭遇一样，请不必多问，还是劝你学学姜太公的作为，且等待那运气亨通时。抽到此签，表示目前做事，总不如意，但别灰心，这不是因你不努力，而是时机未到。目前，最重要的是充实你自己，只要真才实干，必有重用你的时候，决不会被埋没的！问功名，不必急寻，你是属于大器晚成型。问移居或职位变动，还不是时机，一动不如一静。出外旅行，无利可图。问诉讼，以和为贵，问婚姻，多属晚婚，应下定决心，婚谈可成。"},
{"签位":"不须作福不须求","签文":"不须作福不须求，用尽心机总未休；阳世不知阴世事，法官如炉不自由。","解签":"福份，不须去寻求，也不须去制造。你尽管用尽心机想去追求，结果还是失望，休想得到。因为阳世里的不人知阴间里善恶果报的事，而你的福份乃是你前世为善的因果。一个人在阳世所作所为，到了阴间都要接受审判。作恶多端的人，须要下地狱受苦刑，任不得你自由。这首签诗提示得签的人，一切运气的好坏，不是你可以祈求制造，乃是上天的安排，用以报偿你的心田好坏。所谓“积善之家必有余庆，积恶之家必有余殃”、“善有善报，恶有恶报，不是不报，时日未到”因此，如果你目前未得好报，做事营谋未能逐意，求财没有得到，不必强求，也不必怨叹，只有努力，积善因，终必感动上天，赐给你好运。问目前运途，浮沉不定。问功名，虽有进展。问婚姻，缘份未到，婚谈难成。问移居出外，均不吉，一动不如一静。问诉讼，须修心，不可意气用事，得饶人处且饶人，总以能和为贵。"},
{"签位":"旧恨重重未改为","签文":"旧恨重重未改为，家中祸患不临身；须当谨防宜作福，龙蛇交会得和合。","解签":"回忆往事，心头旧恨重重未消除，正如家中发生灾祸，虽然没有临到本身，但此恨绵绵无尽期。你须要谨慎提防有事故发生，最如多作好事，只要有善因，必能逢凶化吉，而且在辰巳交会的时刻，得到很圆满的结果。此签暗示抽签的人，即使经历了无数次的失败，无数次的辛酸，无数次的恨事，但不必去记挂它，还是东山再起，再振作努力去干，必有出人头地的一天，此签有贵人，但必须心好田好，所以签诗说 “须当谨防宜作福。”只要心地良好，必能逢凶化吉，化险为夷，并得天赋福运。问功名，只要充分准备，即使一次挫折，算不得什么，再次必取。问婚姻，缘份已到，婚谈可成。出外不吉，无利可图。移居，随意可行。"},
{"签位":"君问中间此言因","签文":"君问中间此言因，看看禄马拱前程；若得贵人多得利，和合自有两分明。","解签":"求得此签暗示累积的福报，问事求谋将有收获。你的心地良善，上天因你平日一心向上，若能再多拜神修福，热心公益。累积善因善心，自有更多的福报，做事求财，自然会有神明及贵人帮助你成功圆满顺遂。问功名，这是大吉之兆，可以积极去发辉，表现你的才能，你未来前程光明远大，自不在话下。问婚姻，只要两情相悦，婚谈必可有情人终成眷属。如果年届中年仍未婚，必定能在近期获得佳音。移居，出外，行船，凡事求和，均吉。此签惟问疾病不吉，男无妨女危险求神渐渐痊愈。"},
{"签位":"富贵由命天注定","签文":"富贵由命天注定，心高必然误君期；不然且回依旧路，云开月出自分明。","解签":"富贵由天注定。所谓 “生死有命，富贵在天。”一个人的穷通祸福，姻缘富贵贫贱，都是上天安排，命中注定的，所谓 命里有时终须有，命里无时莫强求。此签暗示你的福份不足，不要期望太高，勉强进取必定会大失所望，而且会误了佳期。既然新路走不通，何不回头旧时路，说不定还能云开月出，见到光明前途。成功者并不一定都要开创新路，求神指引或问问前人走过的旧路，一样会成功的。求得此签暗示目前福报不够。问事求谋，只宜安分守旧。不可意气勉强。问事业，创新不吉，守旧安泰。问求财，不多，财多则身弱，反为不吉。功名难得，婚姻平平。移居出外，均不吉。问疾病，危险有阴邪元辰暗淡，宜消灾。"},
{"签位":"前途功名未得意","签文":"前途功名未得意，只恐命内有交加；两家必定防损失，劝君且退莫咨嗟。","解签":"前途功名，未能得意发展，恐怕是因为命里还有交错坎坷的运气。家庭不可分两家，如果分两家，一定会有损失，必须防备，所以劝你还是退守本分，不必唉声叹气！这首签警告当事人，要注意家庭问题，不要只顾事业，而忽略了家庭。更不宜金屋藏娇，以免家庭革命！这是走桃花运的预兆，故须慎防美人计！问财运，到目前，都不能如愿，若有亦是前手来后手空，不宜过份强求，须防破财或劫财。问婚姻或家庭运，均不吉。婚谈，如无感情，不易成功。婚姻须防有变！问功名，待来年，今年恐希望不大。出外做事、移居、职位变动，均不宜妄动。"},
{"签位":"十方佛法有灵通","签文":"十方佛法有灵通，大难祸患不相同；红日当空常照耀，还有贵人到家堂。","解签":"佛光普照，神通广大，只要你信仰虔诚，即使遭遇大难祸患，也能逢凶化吉，化险为夷，何况阳光普照之下，又有神佛及贵人常临家堂保佑。这首签，有神佛“考试”之意。表示你现有困境，是神佛在考验你的定性及修为，耐性等，不一定真的会有大事发生。但只要能诚敬谨慎，自然会克服困难而转忧为喜。求得此签暗示当事人有佛缘，问事求谋会得神明相助。但须有坚强的耐性。问求财，先难后易。问功名，能修善，自有神助。问婚姻，有媒可成。问诉讼，先凶后吉。问出外或移居，平平。问疾病，病情加重，老人及妇女危险，宜求神消灾解厄。"},
{"签位":"太公家业八十成","签文":"太公家业八十成，月出光辉四海明；命内自然逢大吉，茅屋中间百事亨。","解签":"姜太公到八十岁才成功立家业，你何必急呢？一个人的机会一到，就像那云开月出，光辉马上普照天下，大放光明！命中时机若到，自然飞黄腾达，大吉大利。在时机未来前，就暂时隐守在家里等候吧，这样反可以百事顺利呢！抽到此签，表示时机未到，硬要强出头，只有自寻苦脑。像那姜太公虽是一位人才，但到八十岁遇到文王，才真正有表现的机会。你可能也是属于大器晚成型。此签问谋事，目前恐尚不如意，必有被重用的一天。问求财，财运尚不多。问婚姻，有情人终成眷属。问出外移居，尚可。"},
{"签位":"欲去长江水阔茫","签文":"欲去长江水阔茫，前途未遂运未通；如今丝纶常在手，只恐鱼水不相逢。","解签":"只见汪洋一片，使人感到前途茫茫，不知何去何从，手持钓竿痴痴的等待，只恐怕鱼儿与水无缘聚会。求得此签暗示问事求谋难成，目前你的福报不佳及方法错误，必须屏弃过去，诚意正心拜神忏悔行善事作公益来造福并改变作为与想法。才能雨水相逢信有神。用钓鱼，表示求取缘份及名利。问婚姻，不可执着墨守成规，空等待，改变追求的方法才能成功。问功名，有怀才不遇之感，还要等候时机，除非改变自己想法做法否则难有作为。问财利，目前不理想。问出外，无利可图。问移居，须待时机来改变环境。问疾病，未安了钱，宜求神消灾解厄。"},
{"签位":"月出光辉四海明","签文":"月出光辉四海明，前途禄位见太平；浮云扫退终无事，可保祸患不临身。","解签":"一个人坎坷不平的过去，如同浮云退去月出光辉，四海皆明，所谓 十年寒窗无人问，一举成名天下知。锦绣前程，人人仰望。过去的不如意，就像乌云般被一扫而空，此去太平无事，不必再忧虑祸患临身了。求得此签暗示目前福报不多，问事求谋难成，须求神作福多行公益增加福报。暗示先苦后甘有志者事竟成，天下没有不劳而获的事。这是一首苦尽甘来的签诗。有一分耕耘，必有一分收获。过去艰苦的奋斗，终于发出胜利的光辉。问功名，只要有实学，必可高中，不愁没有职位，只怕缺乏才能。出外，移动，都有利可图。问财运，小财有，要想发大财，尚须靠机会。问疾病，男无妨女危险有阴邪元辰暗淡，宜消灾。"},
{"签位":"总是前途莫心劳","签文":"总是前途莫心劳，求神问圣枉是多；但看鸡犬日过后，不须作福事如何。","解签":"前途总有命运安排，你只要尽其在我去努力奋斗，不必劳心问卜，那只是多枉费精神。你要解决的事，只要等待“酉”“戊”日过了以后，就会有消息的。不必再去祈福求神了！解决问题，惟有靠自己，光是求神问卜，是解决不了问题的。鸡为酉，犬为戌，故关键在酉戌日后，即能获得答案。此签表示一动不如一静，故问出外、移居，均不好。问功名，惟有靠自己多用功，靠运气、或神佑，那是没有希望的。如果没有充分的准备，金榜题名的希望不大。问婚姻，要看男女双方是否真爱，双方如果情投意合，可成。据说从前有人登报寻人，久无音讯，至妈祖庙求得此签，果然于戌日寻获。"},
{"签位":"选出牡丹第一枝","签文":"选出牡丹第一枝，劝君折取莫迟疑；世间若问相知处，万事逢春正及时。","解签":"大好时机，不要再犹豫不决了，诗云 有花堪折直须折，莫待无花空折枝。已经是上天评选出的第一枝牡丹花，劝你不要迟疑，快把握住机会。如果想要寻世间知音何在。不须再探究过去未来，一切以及时行乐为先，勿再浪费春光，等春去花凋落，切莫错失枉怨叹。求得此签暗示目前福报圆满，问事求谋可期，应及时把握良机。问求财，有财运，但须把握机会。出外，移居，动则有利。营谋做事，要积极主动，不可犹豫不决。问婚姻，天赐良缘，婚姻可成。问疾病，男无妨女危险求神渐渐痊愈。"},
{"签位":"君尔宽心且自由","签文":"君尔宽心且自由，门庭清吉家无忧；财宝自然终吉利，凡事无伤不用求。","解签":"奉劝你不必为了俗事而焦虑操心，应该宽心自由自在地生活。只要在家里平安无事，财利自然源源而来。凡事命里有时终须有，命里无时莫强求。任何事情，不必强求让其顺其自然最好。一切听从命运安排，不必忧虑操心。求得此签暗示目前福报圆满，问事求谋可期，吉人天相无须多虑。问财利，凭各人财运大小，不要妄求。问功名，且宽心等待，必有其成功发展的一天。问婚姻，耐心的等待。不可操之过急，而且要诚心诚意，合和圆满。问疾病，求神渐渐痊愈。"},
{"签位":"于今莫作此当时","签文":"于今莫作此当时，虎落平阳被犬欺；世间凡事何难定，千山万水也迟疑。","解签":"好汉不提当年勇，此一时，彼一时也，不要再提过去，就像老虎，一落平地时，英雄无用武之地，连小犬都敢欺负他。世事难料，有什么难以决定的呢？就是前方有千山万水的困难，也不必迟疑，勇往直前吧。求得此签暗示目前福报已尽，问事求谋拖尾难成，人力难回天。当思求神作福补禄，问财利，应该积极进取，历千山万水辛苦得来。若问功名，此签有才能而不遇，就像“虎落平阳”，英雄无用武之地。问婚姻，恐有阻碍、或受欺侮，难于成婚，宜另找适当的对像。移居、出外均不可。问疾病，运逢白虎当道防意外危险有阴邪元辰暗淡，宜解厄消灾。"},
{"签位":"枯木可惜未逢春","签文":"枯木可惜未逢春，如今反在暗中藏；宽心且守风霜退，还君依旧作乾坤。","解签":"目前虽然是寒冷的冬天，但转眼春天一到，枯木逢春，自然生气盎然。现在运势虽还未有好转现象，只有凭着毅力与耐心等待机会到来。不必心急，等到风霜退了，神明自然助你扭转乾坤。求得此签暗示，当事人有神缘，问事求谋可期，会得神明相助，此签有杨柳遇春之象，表示你目前遭遇困难，神明都有暗中关注与帮忙，成事在天，谋事在人，成事需要机缘与定数。等待机缘成熟，接着就是平坦的康庄大道了。此签有否极泰来之意。问财，渐入佳境。问功名，时机未到，尚须埋头苦读。问婚姻，成功的机率渺茫，只得暂时等待。至于这桩婚事的好坏，乃先苦后甘之象。移居、出外，暂不宜。问疾病，命危险有阴邪元辰暗淡，宜消灾。"},
{"签位":"渐渐看此月中和","签文":"渐渐看此月中和，过后须防未得高；改变颜色前途去，凡事必定见重劳。","解签":"事情的演变，在这个月中还不致有太大的变化，然后过了这个月，就要防患未然，不可好高骛远，以免大失所望。你要改变作法，更谨慎更用心再向前途迈进，否则，徒劳无功。此签在警告当事人，要注意盛极必衰的心理准备，要谨慎你的作法并祈求贵人与神明来护持帮助，以确保过去努力的成果。尤其不可因过去稍有成就而扩张过速或疏忽造成灾祸。求得此签暗示目前福报不佳，问事求谋，要有重新来过的准备。问求财，微利可取，奢望大利，恐白费精神。问功名，成功希望渺小。问婚姻，恐难成功，求神解。出外、移居，均不宜。问疾病，命危险有阴邪，元辰暗淡，宜消灾。"},
{"签位":"绿柳苍苍正当时","签文":"绿柳苍苍正当时，任君此去作乾坤；花果结实无残谢，福禄自有庆家门。","解签":"正是杨柳苍翠成荫的时候，你应该把握时机，好好把握时机去闯天下，开拓事业，努力追求，自然会开花结果，天下事没有不劳而获的。顺应天时，一分耕耘，一分收获。积善之家必有余庆，福禄自然满家门。求得此签暗示目前福报俱足，问事求谋可期，若能更多行善公益，福禄更圆满。问事业 只要埋头苦干，必能成大业，此签具有蓄财(花果结实)繁荣(绿柳苍苍)等吉象，应好好把握。问婚姻，应努力追求积极把握。问功名，有金榜题名之兆。出外，移居，均大吉。是一首有大收获的吉签。问疾病，求神自安，医遇贵人。"},
{"签位":"龙虎相交在门前","签文":"龙虎相交在门前，此事必定两相连；黄金忽然变成钱，何用作福问神仙。","解签":"龙虎争斗，终会两败俱伤。事情的发生，一定有前因后果，常常是互相关连的。所谓 “运气来时，铁也会变成黄金；运气去时，黄金也会变成铁。”凡事以和为贵，命中无时莫强求。如果勾心斗角互不相让，求神仙作福也没有用的。此签告诫当事人，目前待人处世要步步谨慎，处处用心，自求多福，以和为贵，避免意气用事与人相争，是没有好处的。尤其是诉讼打官司，更要避免。求得此签暗示目前福报将尽，问事求谋拖尾难成，应多善事作福，避免鲁莽意气用事而再生或端。问求财，门市生意有利，出外则无利可图。问功名，成绩无，须再充实自己。移居出外，均不得时，最好能三思后再决定。问婚姻、感情不合，宜忍耐牵就。家和才能万事兴。问疾病，运逢白虎当道防意外危险，病难愈拖尾，有阴邪元辰暗淡，宜解厄消灾。"},
{"签位":"欲去长江水阔茫","签文":"欲去长江水阔茫，行舟把定未遭风；户内用心再作福，看看鱼水得相逢。","解签":"远离要去他乡，必须经过茫茫无际的长江水，扬起帆来，却无风助行，还是安守家里用心经营，也许后福不错，会遇到如鱼得水的好机会。求得此签暗示求签者目前福报有限，问事求谋无望，不利缘份，官禄，需要即行善事累积福德，否则无风助行难以如愿。目前宜采一动不如一静。尤其出外旅行，阻碍多，不易达到目的，应终止此行计划。凡事宜采退守策略，谨言慎行，以获安泰。问财运，总会有，但不宜操之过急。门市生意较好，出外经营则难如意。问功名，必须再接再厉才有希望。问婚姻，不易成功，如无爱情，宜早日另找对象。问疾病，未安了钱，宜求神消灾解厄不畏。"},
{"签位":"危险高山行过尽","签文":"危险高山行过尽，莫嫌此路有重重；若见兰桂渐渐发，长蛇反转变成龙。","解签":"经过那危险的高山，此去已是平坦的康庄大道，勿嫌路遥险阻，慢慢总会到达目的地。看看那些兰桂，也是慢慢成长开花，只要有恒心，蛇也有修成龙的一天。此签暗示福份尚有不足，须有恒为成功之本，不要怕困难，尤其不可半途而废，那永远没有成功的希望。俗话说 天下无难事，只怕有心人。求得此签暗示目前福报不足，问事求谋，须经过长久的艰辛万苦，才会开始解运而迈向顺利之大道，应把握良机，积极进取。宜向南方有利。问功名，这次成绩不理想，继续努力下次可获良好表现。问求职，暂时无法获得理想职位，但认真进取，可获成功。问婚姻，最初难免受到种种阻碍，但成功与否，全靠自己的努力。问疾病，宜消灾，病情加重，老人危险宜消灾。"},
{"签位":"此事何须用心机","签文":"此事何须用心机，前途变怪自然知；看看此去得和合，渐渐脱出见太平。","解签":"无须再费心机为此事忧虑烦恼而猜疑，未来前途变化，你自然会知道。看看以后的结果是圆满和合的。现在开始，请渐渐抛开所有烦恼事情，等待时机到来，未来的变化，逐渐好转，不必再作无谓的担忧了。求到此签目前福报平平，问事求谋慢成，心绪不定易患得患失，自作聪明而丧失良机。如问婚姻，表示不用急，诚恳与耐心可获成功，是逐渐发展而得成功的幸福良缘。此签问求财，虽不十分理想，也有六七分以上的希望。问功名，有高中的吉象。诉讼官司，有获胜的希望，如受冤枉，亦有平反的机会。问疾病，命危险有鬼作祟阴邪元辰暗淡病深难愈拖尾，宜消灾解厄。"},
{"签位":"福如东海寿如山","签文":"福如东海寿如山，君尔何须叹苦难；命内自然逢大吉，祈保分明自平安。","解签":"你命中注定福禄像东海那么大，寿命像南山那么高，像这样福寿双全的命，还有什么苦难可言。既然命里己有，自然大吉大利，只要祈求神明保佑，就会获得快乐平安。这是一首很幸运的签诗，表示福寿双全，就应该满足，就勿再自寻烦恼了。求得此签除功名福禄寿俱全外，还有随遇而安的意思。问求财，大利。婚姻，圆满。问诉讼，表示无事。如问事业，外出经商，必须慎重考虑。乃此签告之，要“知足常乐”，不须去自找苦吃。问疾病，宜消灾。病情加重，老人危险宜消灾。"},
{"签位":"运逢得意身显变","签文":"运逢得意身显变，君尔身中皆有益；一向前途无难事，决意之中保清吉。","解签":"一个人遇到得意的好运气，身价也随着变化。福至心灵，你所做的事，都会是有意义的事情。前途无碍，只要你有决断，自然亨通顺利。这首签诗表示你将有好运来临。不可犹疑不决，应当机立断，从事你认为应当做的事，专心一志积极去贯彻执行，将会更加圆满成功。求到此签问事求谋可期，除暗示目前福报可收。还有福自天来之意。只要立定目标专心一志，自然成就非凡。应该再多积善德增加更多福报。问求财，只要努力工作，财运见得利。问婚姻，只要不三心二意，有情人终成眷属。问功名，此次成绩也许不理想，只要再接再厉，下次一定有希望。出外移居，平平。问疾病，未安，宜求神消灾解厄不畏。"},
{"签位":"名显有意在中央","签文":"名显有意在中央，不须祈祷心自安；看看早晚日过后，实时得意在其间。","解签":"不须太过执着目前的处境。只要坚定自己心中的目标，光明正大不偏不倚，名位自然显达圆满。不须要向神祈求，心里自然安祥。只要看看那早晚太阳的升沉，就会领悟到天地循环的道理，才能即时得意在其间。做人处世不宜太偏激执着，日有阴晴圆缺人有旦夕祸福，无须为一时的不如意太过在意。应采取乐观进取的态度，坚持目标循序渐进，常以失为得，自然能悠闲自得不会患得患失。求得此签暗示目前福报平平，问事求谋，需按部就班，不可冒进而增加无谓的困扰。问求财，宜守旧，不可贪求。心存正直。自然无忧。问谋事，虽有成功的希望，但时间上恐会拖延。谈婚姻，较迟。问诉讼，则以和解为宜。问疾病，未安，宜求神消灾解厄痊愈。"},
{"签位":"意中若问神仙路","签文":"意中若问神仙路，劝尔且退望高楼；宽心且守宽心坐，必然遇得贵人扶。","解签":"你意中如果想寻求神仙道路，我劝你还是不要妄想，且退一步看看那高楼吧！(好高鹜远，终究一事无成)。还是宽心安份守己，宽心地等待一下机会，一定会有贵人来帮助你的。抽到此签，表示运气还不很理想，不宜挺进，宜退守以等待时运之解通，不要想一步登天，做任何事，要量力而为，自然会有贵人来提拔你。此签表示一动不如一静，故出外移居，必须重新考虑。问求财，份外的要求无法达成。问功名，只是虚名，必须再充实自己，才能名实相符。问诉讼，与人争执不利，官司和解为贵。问谋事，有长辈或贵人提拔，宜多听取或尊重他人之意见。问婚姻，不必心急，有缘自然结成夫妇，不可强求。"},
{"签位":"平生富贵成禄位","签文":"平生富贵成禄位，君家门户定光辉；此中必定无损失，夫妻百岁喜相随。","解签":"俗云 “生死有命，富贵在天。”一生只要有富贵之命，必可求得，也一定能光耀门楣。家和万事成，只要姻缘和合，夫唱妇随，一定不会有损失的。此签问求财，可顺利达到目的。问功名，有金榜题名的吉兆。问婚姻，乃和好顺利幸福良缘。问谋事，则须多下番功夫。问诉讼，以和为贵。求得此签暗示福缘俱足，问事求谋可期，应感谢天地神明恩赐，也暗示姻缘富贵已有定数，人事已对，只须要再待机缘成熟，大好姻缘指日不远。功名富贵也必能光宗耀祖。问疾病，求神渐愈，老，妇人危险。"},
{"签位":"今行到此实难推","签文":"今行到此实难推，歌歌畅饮自徘徊；鸡犬相闻消息近，婚姻夙世结成双。","解签":"你来求问，神明很难推辞。其实，就快要有好消息了，有缘千里来相会，何必犹豫不决呢？求得此签暗示目前福报圆满，问事求谋可成，更加要多拜神作福为善来延续功德福报。答谢上天厚爱恩赐。此签另暗示有双的意思。暗示双喜临门或对象会有二择一之兆。不要犹豫，做任何事都该当机立断，会有好消息的。问求财，平平。问功名，有金榜题名之兆。问婚姻，有情人终成眷属。问疾病，求神自安，幼、妇人拖尾危险。"},
{"签位":"一重江水一重山","签文":"一重江水一重山，谁知此去路又难；任他改求终不过，是非终久未得安。","解签":"这件事恐怕很难解决，摆在眼前有着重重的困难与砠碍，不是轻易可以冲破的。就像过了一重江水，又有一重山，道路崎岖不平，进退不易。任你有任何办法，也不能挽救，是非终究要发生。求得此签暗示目前福报不佳，问事求谋不可，应求神排解。目前运气很差，正朝遇困难重重，正值进退两难之间。此时应该坚定立场，固守正道，忍辱自重，以等待时机的到来。此签问求财，毛病百出，终至亏损，可暂时罢手以待有利时机。问功名，遇到难题，尚须努力充实自己。问婚姻，阻碍重重，双方如无真爱，宜及早另找对象。问诉讼，有严重的麻烦，且拖延时间，罢手为妙。问疾病，命危险有阴邪元辰暗淡，宜消灾解厄。"},
{"签位":"一年作事急如飞","签文":"一年作事急如飞，君尔宽心莫迟疑；贵人还在千里外，音信月中渐渐知。","解签":"过去一年来说，你做事太过急燥，以致很多的不如意。现在应该宽心等待，不要再便宜行事。会有贵人来帮助的。不过，目前还在千里外。你所盼望的消息，大概月半才会逐渐分明。此签乃明示当事人，做事太鲁莽，或太犹豫，都是“过”与“不及”，应该避免，才不会招致失败。现在起从容不迫，勇敢果断地下决定吧。也许过去因为没有贵人帮助而无法如愿，只要远方哦贵人出现，会传来好消息来的。求得此签暗示目前己身功德福报平平，问事求谋，需要贵人或神明帮忙。问求财，目前尚欠理想，但将来有财利。问功名，尚须充实自己，才有希望。问婚姻，静候贵人安排，终会成功。问疾病，求神自安，医遇贵人，老人拖尾危险。"},
{"签位":"客到前途多得利","签文":"客到前途多得利，君尔何故两相疑；虽是中间逢进退，月出光辉得运时。","解签":"贵人已来到你的眼前了，将来的发展也会获益很多，为什么还要猜疑呢？虽然还是有进退维谷的时候，也不必灰心，云开月出，光耀普照的时机马上来到了。认为对的人事物，就不要轻言改变。求得此签暗示有神缘，问事求谋，会得神明相助，不须疑虑心急。凡事先凶后吉，先难后易之兆。问求财，目前浮沉不定，但未来利润大有可观。问功名，此科无望，后科得中。问婚姻，阻碍扫除，有情人终成眷属，不要灰心。问诉讼，虽有冤枉，终得平反。凡事虽有困难，如能克服，可获成功，而每在月中有助运的迹象。问疾病，求神平安。"},
{"签位":"花开今已结成果","签文":"花开今已结成果，富贵荣华终到老；君子小人相会合，万事清吉莫烦恼。","解签":"你的运气真好，正像盛开的花朵，现在已成果实，是收获的季节了，相信你到老都可以享受到荣华富贵。只要你待人真诚，君子小人你都可以跟他会合，万事清吉顺利，不必烦恼。过去的努力终于有成果了。一分耕耘，一分收获。过去虽很辛苦，但现在你可以尝到甜美的果实了。此签问求财，要看你过去勤劳的程度，过去越动劳，目前获利越多。如果过去不肯多费功夫，目前就没有财利可言。问功名，也是一样，看你用功的程度，而定你的成就。问婚姻，和美幸福的姻缘，婚谈可成。"},
{"签位":"功名得意与君显","签文":"功名得意与君显，前途富贵喜安然；若遇一轮明月照，十五团圆光满天，","解签":"善加用功充实自己，神明自然会赐福，使你平步青云，名显天下，荣华富贵可期。就像那十五团圆的一轮明月，普照天下，皎洁圆满大放光明。这是一首很幸运的签诗，表示当事目前的运气，正迈入旺盛的境地。但须防盛极而衰，月圆而缺。求得此签暗示有神缘，问事求谋，会得神明相助，功德圆满，最利修行之人。问功名，只要有真才实学，必有成功的希望。问婚姻，是白头偕老的佳兆。问疾病，少立愈，老难愈拖尾，宜消灾解厄。"},
{"签位":"君尔何须问圣迹","签文":"君尔何须问圣迹，自己心中皆有益；于今且看月中旬，凶事脱出化成吉。","解签":"只要你心地光明，何必求神问卜呢？对事情也没有任何的益处。你所担心的事，要等到月中才有转机，才有逢凶化吉的希望。一个人只要问心无愧的去做事，不必求神念佛，神佛也会暗中保佑你，自然会逢凶化吉，本签诗一开头，要当事人先修心，自然有益，就是这个道理。求得此签暗示虽然目前福报不足却可得到神明相助逢凶化吉，问事求谋可成。问财利，只要努力经营，必可获利。问功名，此次若未能得中，再接再厉，下次一定有希望。问婚姻，过了月半以后继续努力，有情人终成眷属。问诉讼，要拖一段时间，才能逢凶化吉。移居出外，安好可行。问疾病，未安，宜求神消灾解厄不畏。"},
{"签位":"阳世作事未和同","签文":"阳世作事未和同，云遮月色正朦胧；心中意欲前途去，只恐命内运未通。","解签":"因为你做事太有个性，不能够与人和合同流，所以迄今没有腾达的机会，就像那明月被乌云遮住而无光。你心里虽想向前迈进，只恐怕你的运气还不是亨通的时候！有才干的人，通常多自负，眼高而手低，因此多有怀才不遇的遭遇。不要过于自负。洁身自爱，固然应该，但如矫正过正，自鸣清高，往往变成好高鹜远，理想过高，以致于迟变以往的作风，否则恐怕此去的运气还是照样不通顺。此签问谋事求财，须能吃苦耐劳，否则无利难成。问功名，尚不能如愿，多充实自己。问婚姻，不是个理想之时机，问诉讼无结局。"},
{"签位":"言语虽多不可从","签文":"言语虽多不可从，风云静处未行龙；暗中终得明消息，君尔何须问重重。","解签":"虽然意见很多，不可以随便听从。因为风云不动，龙是无法升天的。必须等待风云际会，就可一飞上天，你在暗中既已发现明处的消息，就自己决定何去何从，何必一再问神呢！做事情自己应该要有主见，不要听从人家说那样就那样做，说这样就这样做，人多口杂，最后竟无所适从。不必问人，也不必问神，做事情要靠自己衡量利害得失，然后自己下决定，这样才有成就。此签问经营求财，要自己做何能取得功名，须先充实自己。问婚姻，将成美满幸福之良缘。"},
{"签位":"佛前发誓无异心","签文":"佛前发誓无异心，且看前途得好音；此物原来本是铁，也能变化得成金。","解签":"佛祖面前发誓，表示决不变心，那么此去一定会有好消息传来的。所谓 “运来变铁变金，运去金变铁。”运气来了，铁也能变成金的。所求无法立刻实现，要有恒心，继续努力，时机来临运气佳时，就能成功。求得此签暗示与佛有缘，可佛降光彩。开脱解厄。化铁成金。问求财贪图目前小利。问婚姻，须忍耐交往诚实对待，必有收获。问功名，目前不如意，加紧用功吧。问疾病，求神自安，医遇贵人，老人则拖尾危险。"},
{"签位":"东西南北不堪行","签文":"东西南北不堪行，前途此事正可当；劝君把定莫烦恼，家门自有保安康。","解签":"东西南北方向没有一处是你今年外出图利的地方，还是安份守在家里比较妥当。我劝你一动不如一静，定下心来，不要烦恼，安守家门自可保平安。求得此签暗示目前福报欠佳，问事求谋，不可轻举妄动，即得安泰。如随意妄动，将破运而招致不利与灾害，陷于劳苦之深渊。此签表示，不可急进，退守为佳。问经商求财，在家有利，出外不吉。出外旅行，须特别注意，最好停止此行。问婚姻，平安之良缘。问功名，运气未到，问诉讼，以和为贵。问疾病，女未安拖尾，宜求神消灾解厄不畏。"},
{"签位":"功名事业本由天","签文":"功名事业本由天，不须挂念意悬悬；若问中间迟与速，风云际会在眼前。","解签":"功名事业的成败，本来运气占了大半，所以只要尽其在我，做了最大的努力，就应该听天由命了。若问其中期间来速与来迟，大好风云际会的时机，就在眼前不远了。功名事业的成功，全靠个人平日的努力，所谓一分耕耘一分收获。如果平时不烧香，临时报佛脚，那就永无成功的希望。只要你下了功夫，就会有成果的，不必在心里担忧。求得此签暗示目前福报平平。问事求谋，惟有自力救济听天由命或求神明相助了。问求财，目前尚欠理想，但只要努力，不久就会有的。问功名，多用功，多充实自己，机会就快来了。问婚姻，缘份不够不易成功，宜另觅对象。问疾病，三日过求神平安，医遇贵人。"},
{"签位":"看君来问心中事","签文":"看君来问心中事，积善之家庆有余；运亨财子双双至，指日喜气溢门闾。","解签":"看来你心中所想之事，不知吉凶如何？神明告诉你，积善之家必有余庆，因为你心地好，所以会有好报。运气来时，求财得财，求子得子，财子双双来到。相信指日间，喜气将洋溢你家门。求得此签暗示，是好预兆。目下虽然未得亨通，只要多求神作福、一心向善，正是 “积善之家，必有余庆。”好运马上到来。求得此签暗示福禄自有。问事求谋，可得到神明暗中相助，应常与神明结缘增福接禄。问财利，目前虽不理想，但不久，财源即滚滚而来。问功名，目下虽未得际遇，只要多充实自己，将来必有机会。问婚姻，是美满幸福之良缘。问诉讼，能和解最好，只要你合乎情理法，不必忧虑，不会有事。问疾病，女未安拖尾，宜求神消灾解厄不畏。"},
{"签位":"孤灯寂寂夜沉沉","签文":"孤灯寂寂夜沉沉，万事清吉万事成；若逢阴中有善果，烧得好香达神明。","解签":"在夜晚寂寞的对着一盏孤灯，一缕心香虔诚祈望着万事如愿。如果你能积阴德，平日又常烧好香敬拜神明，那么神明就会闻声救苦，你就能获得助力，达成你的愿望。此签明示当事人，要想结成什么样的果，必须先怎么栽。所谓 “种瓜得瓜，种豆得豆。”如果平日不行善，平时不烧香，临时抱佛脚又有什么用呢？求得此签暗示虽然目前福报不足，问事求谋，却可得到神明相助逢凶化吉。问财利，只要辛勤作事，必能获利，如果祇想不劳而获，那会失望的。问功名，平时不烧香，难有好成绩。问谋事，有困难，必须毅力与恒心双管齐下。出外可行。官司以和为贵。婚姻则美满。问疾病，女未安拖尾，宜求神消灾解厄不畏。"},
{"签位":"须知进退总虚言","签文":"须知进退总虚言，看看发暗未必全；珠玉深藏还未变，心中但得枉徒然。","解签":"如果本身常常言行不一，发愿立誓却又做不到，再多的承诺却无法做到，当然就会成事不足、败事有余，凡事也就未必能成全圆满了。所谓 “识时务为俊杰，知进退为英雄。”就像那深藏的珠玉还未有变化时，就患得患失，那是徒然枉费心机。做任何事情，都不可能有十全十美的事，不必患得患失，必须识时务知进退才行，只要有真才实学，就像那深藏的珠玉，不会永远被埋没的。求得此签暗示目前福报不佳，问事求谋难成，凡事虎头蛇尾。应当神前忏悔前过请求解厄相助。问求财，目前仍不理想。问功名，时运未到，必须再等待。问婚姻，没有缘份的婚事是不容易谈成功，还是另求他缘为好。问诉讼，会拖延时间。问出外移居，不是时候，不动为宜。问疾病，女未安拖尾，宜求神消灾解厄。"},
{"签位":"病中若得苦心劳","签文":"病中若得苦心劳，到底完全总未遭；去后不须回头问，心中事务尽消磨。","解签":"一个人在病中，若还要苦思操劳一些还未遭遇的事，只会把自己弄得更患得患失，那是多痛苦的事啊。世事古难全，应该快乐的过日子。事情过了就算了，不必回思过去，也无须再多问，把心中的念头尽量打消吧。这首签诗，主要在安慰当事人尽量把心放宽，注意身体健康。所谓 “留得青山在，不怕没柴烧。”即使事情失败了，也不必患得患失，那样将于事无补，于己有损，何苦来哉。求得此签暗示暗示目前福报不足，问事求谋难成，不利缘份，福禄，易胡思乱想。应当转好念、行好事、发好愿、才能转安得福。问求财，表示财运未到，再操心也没用，就顺其自然吧。问功名，全无希望。问婚姻，无法成功。问疾病，先凶后吉，求神平安。"},
{"签位":"劝君把定心莫虚","签文":"劝君把定心莫虚，前途清吉得运时；到底中间无大事，又遇神仙守安居。","解签":"劝你把心定下来，莫再自我慌张。时运得平安，前途虽清吉，可说这期间并无什么事会发生，又有神明保护着，大可安居乐业。必须先把心定下来，不要慌慌张张，才能将事做好。求得此签暗示目前福报圆满，当事人有神缘，问事求谋，会得神明相助庇佑。问求财，小有成就，但不可强作大生意。问功名，成绩恐不理想，要再努力必可考中。问婚姻，有贵人扶助尚可谈成。问做事，以诚实态度，可以达成目的。问诉讼，和解为宜。问疾病，求神自安，医遇贵人，老人则命危险。"},
{"签位":"蛇身意欲变成龙","签文":"蛇身意欲变成龙，只恐命内运未通；久病且作宽心坐，言语虽多不可从。","解签":"蛇身要想变成龙，只恐命里运气还未通，那是不可能达到目的。还是宽心调养虚弱的身息，宽心地等待吧，虽然别人意见很多，但是不要随便相信听从。运气停滞未通，做事多阻碍，万事不尽如意。但不要悲观自暴自弃而堕落，要忍耐奋斗等待有利时机来临。求得此签暗示目前福报欠佳，问事求谋，劳心劳力又徒劳无功。应求神行善善作福。问求财，小钱有，大钱不能获得。问功名，成绩欠理想，难达成愿望。问婚姻，障碍多，不易成功。问诉讼，恐拖延时间，而且胜败反覆不定。出外移居，一动不如一静，均不吉。问疾病，不愈拖尾，宜求神消灾解厄。"},
{"签位":"有心作福莫迟疑","签文":"有心作福莫迟疑，求名清吉正当时；此事必能成会合，财宝自然喜相随。","解签":"既然有心做善事或认为是对的事，就不要再迟疑不决，赶紧去做，现在正是求取名利的时候。相信每件事都能做得很成功恰当，钱财名利也自然会相随而来。这首签诗表示，只要一心向善，自然上天会保佑你。求得此签暗示 目前福报圆满，当事人有神缘，问事求谋，会得神明相助庇佑。问求财，生财取之有道，财利自然来。问功名，只要努力，就可成。问求事，积极谋求，能成功。问婚姻，决心进行。即可达成。问诉讼，和解为要。问外出移居，平安可行。问疾病，求神平安。"},
{"签位":"月出光辉本清吉","签文":"月出光辉本清吉，浮云总是蔽阴色；户内用心再作福，当官分理便有益。","解签":"月亮一出来，光辉皎洁，只是浮云遮蔽，总使明月失色。你该在家里多求神拜佛用心作善事。当官要事理分明，自然会有益处。人生不如意之事十之八九。就像那皎洁的月亮，偶而也有被乌云遮住光茫的时候；但不必因光芒被遮，而感到不平，更应该行善布施勤修其德。当那乌云退去时，再度露出的光辉，将更明亮动人。求得此签暗示目前福禄平平，问事求谋慢成，应多求神行善事作公益造福。问求财，只要辛勤工作，财利可得。问功名，须再努力，充实自己，自然有成功的希望。问谋事，只要积极努力，必能有成。问婚姻，有乌云遮月的暗示，谈婚事不吉事。出外旅行，必须小心谨慎，最好打消此念。问疾病，妇女未安拖尾，宜求神消灾解厄得愈。"},
{"签位":"姜公封相 上上签","签文":"灵签求得第一枝，龙虎风云际会时；一旦凌霄扬自乐，任君来往赴瑶池。","解签":"求得这支上上签诗，可喜可贺!龙虎得风云际会，您立下的大志，将会得偿所愿，并能到达至善至乐的境界。正所谓东成西就，左右逢源，万事如意。"},
{"签位":"王道真误入桃源 上吉签","签文":"枯木逢春尽发新，花看叶茂蝶来频；桃源竞斗千红紫，一叶渔舟误入津。","解签":"求得此签诗，有一种否极泰来，枯木逢春、时来运转、快活无忧的征兆，所以一切佳景，不必刻意去强求；顺其自然，尽力而为，反而有意想不到的收获。枯木遇春天而发新芽。花香叶茂引蝴蝶频来。"},
{"签位":"鲁班开山 中平签","签文":"牛山之木皆常美，独惜斧工尽伐他；大器大材无足用，规矩不准怎为搓。","解签":"这灵签的主要意思是说，本来有很好的条件，但是处理失当，不知不觉间，优势尽失，等到急需人、财、物应用的时候，才发觉已经一无所有了。暗示要珍惜资源，慎防小人，摒弃恶习。"},
{"签位":"董永遇仙","签文":"调雏紫燕在檐前，对语呢喃近午天；或往或来低复起，有时剪破绿杨烟。","解签":"此灵签是说董永与天仙在春天看见的一幅自然景色。檐前燕子往返穿梭，寻觅食物，回巢哺育下一代的风景图。可以告慰的是，燕子为培养下一代，一定会选择较为安全的环境筑巢，而签中第一二句，是母燕在檐前与雏燕呢喃细语，即有平安之象。后两句则是提醒，雏燕的父母为了觅食，来来往往，忽高忽低，暗示运程时起时伏，时好时坏，年中或有波动。"},
{"签位":"韩夫人惜花 中吉签","签文":"东园昨夜狂风急，万紫千红亦尽倾；幸有惜花人早起，培回根本复栽生。","解签":"此灵签是提出一个警告 今年会有较大的波折，天时稍差，地利亦易有失，唯一可取的，就是人和，希望有贵人相助，度过难关，回复生机。 东园的百花，被狂风所吹袭，幸有惜花之人，不辞劳苦，去善后，去化险为夷，这个惜花人，可以是自己，也可以是别人。"},
{"签位":"王羲之归故里 上吉签","签文":"一片孤帆万里回，管弦呕哑且停杯；如云胜友谈风月，畅叙幽情极乐哉。","解签":"这支灵签是形容一位有才学又有相当经济基础的人，放弃官场的争斗，急流勇退，毅然返故乡，一方面得聚天伦及友谊之乐，优哉悠哉，一方面又可以继续发展自己的专长，扬名于后世。"},
{"签位":"仁贵归家 中吉签","签文":"秋来征雁向南归，红叶纷纷满院飞；砧捣城头声切耳，江枫如火在渔矶。","解签":"这支灵签是薛仁贵征东后，得胜回朝，领功获赏后，衣锦还乡的好景。但可惜，征人易老，在战争中消磨了青春，而回家途中，又适逢秋天。 征雁南归、红叶纷飞，最令人触目伤感的是，不少征人的妻子，正在城头用木捣洗衣服。这暗示会有美中不足，而且会有扫兴或失意事发生。"},
{"签位":"崔子弒父 下下签","签文":"鸣鸠争夺鹊巢居，宾主参差意不舒；满岭乔松萝茑附，且猜诗语是何如。","解签":"春秋时，崔子因妻被齐王占有，怒而起兵杀之。鹊有巢而为鸠所夺，山有松树而被籐萝週身牵缠，求得此签者，凡事宜隐忍勿强争夺取，诚恐为是非而拖累，难以解脱而要依附于人也，此乃凶多而少之象，宜防小人口舌。有困身，小人依附之象。"},
{"签位":"陶渊明赏菊 上吉签","签文":"瑶琴一曲奏新腔，明月清风枕蕈凉；咸集嘉宾同赏菊，或歌或舞或飞觞。","解签":"灵签中是秋景，明月清风，在庭院铺开枕席，瑶琴奏着新清的小曲，与好朋友饮酒赏菊，绝无拘束，载歌载舞，此乐何极?求得此灵签者，有天时、地利、人和之象，凡事称心如意。"},
{"签位":"苏秦不第 中平签","签文":"一轮月镜挂空中，偶被浮云障迭重；玉匣何时光气吐，谁人借我一狂风。","解签":"明月、玉匣，代表一个人的真才实学，可惜，偶然被浮云所遮掩，未能展露光芒。谁人借我一狂风呢?有一种等待机会，贵人未遇的感叹。 暗示求得此灵签者，不要轻举妄为。当隐忍待时，不可妄动，防避小人口舌，不久即有贵人相扶，消此小劫也，此乃吉中微有凶之灵签。"},
{"签位":"汉文帝赏柳 上吉签","签文":"杨柳垂堤锁绿烟，日长三起又三眠；往来紫燕纷飞舞，袅娜迎风倩我怜。","解签":"汉文帝最喜欢欣赏杨柳的美态，为了提高工作效率，他采用分段睡眠法，每日三眠三起，醒后必欣赏绿柳垂堤，紫燕在其间飞舞的美好景色。盖杨柳有时垂有时起，且有燕子往来飞舞其间，迎风摇动，景色怡人。 得此灵签有万事如意之象，求谋顺遂事事皆吉。"},
{"签位":"太白捞月 下下签","签文":"蜃楼海市幻无边，万丈擎空接上天；或被狂风忽吹散，有时仍聚结青烟。","解签":"海中蜃蛤吐气如楼，高接到天，一有风来，便吹散矣。虽散而复聚，如烟之浮，不能长久也，此乃一片虚浮景象。求得此灵签者，当行善以为根本，则可坚稳长久，事事不被人吹散，此灵签凶多吉少，要防小人口舌，宜在当天作福吉。 海市蜃楼的虚假幻象，有花篮打水一场空的预兆，凶多吉少，此为下下灵签。当行善务实为本份，勿被假象所引诱。"},
{"签位":"孟浩然寻梅 中平签","签文":"岭南初放一枝梅，片片晶莹入酒杯；却遇骑驴人早至，如意背负占春魁。","解签":"这支灵签，是孟浩然在岭南寻梅的际遇。把梅花花瓣放入酒中而饮，人生极雅乐之事。路上遇有骑驴人先来一步，在其引领，得偿所愿。 遇有贵人带引，则事事如意矣，此灵签半吉半凶，该签虽无大碍，但似有被人占以先手之象，则逢吉变凶矣，解签者要细思。"},
{"签位":"苏东坡醉酒 中吉签","签文":"为爱幽闲多种竹，买春赏雨在茅屋；醉时卧倒杏花边，怕听莺儿惊梦熟。","解签":"灵签描写东坡归隐的清雅生活 为了幽闲，在居所周围种满绿竹，把时间都交托给春天，或躲在茅屋里赏雨，或醉后眠在杏花旁边，安然入梦乡，最怕被黄莺的歌声吵醒。此乃安逸之象。"},
{"签位":"明皇游月殿 上吉签","签文":"仙槎一叶泛中流，月殿蟾宫任尔游；盈耳霓裳声暂歇，酒诗吟饮几时休。","解签":"此灵签只道繁华快活之象，唐明皇得一叶仙舟，扶摇直上九霄，遨游月宫，仙乐飘飘处处闻，传说中，「霓裳羽衣曲」就因此而得，诗酒歌舞，无止无休。 求得此灵签，虽有大吉大利之象，万事如意，但要警惕勿太沉迷酒色安乐。"},
{"签位":"皇叔遇水镜 中吉签","签文":"天边鸦背夕阳回，陇外儿童跨犊来；羌笛频吹声切耳，短长腔调乐何哉。","解签":"日落山冈时候，天边之鸦鹊归巢，郊外的牧牛童子，亦骑牛而归家，一路上吹得竹笛之声充满耳，此童子甚快乐也。 求得此灵签者，既有快乐无求之意，又有大器晚成之象，凡事尽力而为，得失无愧于心，则凡事平稳无碍，不用忧心。即所谓尽人事，顺天命，明天会更好。:"},
{"签位":"月下追贤 中吉签","签文":"秋水蒹葭白露盈，盈庭月色浸阶清；清风吹动马铃响，响接晨钟不断声。","解签":"秋水蒹葭白露盈这两句，是写秋景，蒹葭，是荻草与芦苇，凝结了霜露，月色满阶。接着是清风中的马铃声，然后是天亮的晨钟声，示意追得韩信回。此灵签有失而复得，人尽其材之意。"},
{"签位":"杜鹃泣血动客心 下下签","签文":"杜鹃啼血泪悲声，声怨霜寒梦乍惊；惊动异乡为异客，客心更触故园情。","解签":"子规，就是杜鹃。而杜鹃思念家国，声声啼泣，眼泪化成杜鹃花。异乡客人，寒夜中被杜鹃啼声惊醒，更加触发乡思。 此灵签虽为下下，但小心谨慎，可逢凶化吉。"},
{"签位":"伏羲演八卦 中吉签","签文":"干卦三连号太阳，潜龙勿用第一章；其中爻象能参透，百福骈臻大吉昌。","解签":"求取此灵签者，如果能领悟到其中爻象的道理，万事顺昌。纯阳易伤的道理，随时都发生在身边，譬如做人怕蚀底，做一偏激，谁人敢与你合作。 凡事要看透各方面，不能死牛一面颈。光靠蛮、恶、霸气者，终于会失败。"},
{"签位":"雪梅招亲 中平签","签文":"天上仙花难问种，人间尘事几多更；前程已注公私簿，罚赏分明浊与清。","解签":"天上广寒宫里的这枝仙花，别问是谁种的，落得凡间，人事已经变更了。每个人的命运，已由上天注定，善恶到头终有报应的。"},
{"签位":"武则天赏花 中吉签","签文":"天外红霞如抹锦，槛边桃杏斗新妆；盈眸烟熳谁居首，美酒频斟且酌量。","解签":"这支灵签是描述当时赏花情况，天边的红霞如织锦，门外的桃花杏花在争艳，一边品评着哪种花最美丽，一边饮着美酒，真是人生乐事。 求得此灵签，可望富贵平安。凡事有吉无凶，并必有意外财收获也。若问自身之事，更可丁财两发，诸事平稳之象也。"},
{"签位":"陈妙嫦思春 下下签","签文":"秋水伊人各一方，天南地北恨偏长；相思试问凭谁寄，不尽凄凉枉断肠。","解签":"求得此灵签，一来景况凄凉，二来因缺乏定力，患得患失，举棋不定，难免一事无成。 秋水伊人，天南地北，各处一方，此恨绵绵无尽，满腹相思，凭谁寄语，说不尽的凄凉，枉自痛断肝肠。字字伤心。宜多作善福，有贵人扶持，才能出生天。"},
{"签位":"卢生梦 中平签","签文":"邯郸一梦幻无边，数载身荣是熟眠；换却锦衣归故里，睡醒还记在心田。","解签":"别相信幻象，要脚踏实地，欲想衣锦荣归而又不是发白日梦，就要脚踏实地。 同时，亦有暗示，不要受骗，小心别人的甜言蜜语，糖衣炮弹。"},
{"签位":"白居易叹情 下下签","签文":"诗酒琴棋可解愁，座中无客乐难休；或弹或唱谁知美，冷饮虽多亦是忧。","解签":"春江花朝秋月夜，往往取酒还独倾。诗酒琴棋当然可以解愁，但是无伴，又怎能行乐呢?自弹自唱谁来欣赏?独自饮酒，既冷淡又哀愁。 此乃下下灵签，宜多修身。虽处于顺境，而未免有忧愁，急宜广结善缘，务使善与人同。则应求多而无忧愁矣，盖此灵签凶多而吉少，宜在社坛作福吉。"},
{"签位":"朱洪武登基 上吉签","签文":"群山扰扰朝中岳，有似与臣列鹊班；拱立两行齐整肃，自居此地岂无欢。","解签":"此灵签有位高得意之象，群山纷纷向中岳朝拜，好象臣子列班，整齐又严肃，居此位置，怎能不开心呢?若求得此灵签者。必得事事如意，步步高升也。"},
{"签位":"徐庶归家 中平签","签文":"花彩迟迟侵砌上，遥知月镜挂长空；忽闻鹤唳声凄切，早买归舟返里中。","解签":"徐庶离开刘备时，走马荐诸葛亮，极力推崇孔明。徐庶归家后，被徐母大骂他上了曹操的当。孝义两难存，徐庶在曹操手下做官，始终是身在曹营心在汉。 此灵签是描述徐庶被曹操放假后，思念母亲，归家心切之情。此灵签吉中有凶，但逢凶亦可以化吉，知趋避便无碍，宜防小人是非口舌。"},
{"签位":"越王复国 中平签","签文":"天晴粉蝶翻衣晒，又看庭前蚁阵排；队伍整齐趋或退，时开时合思何佳。","解签":"这支签，用蝶蚁知时，来比喻越王勾践复国的苦心和知机，凡事要顺时顺势，顺其自然，则较易成功。天晴时，粉蝶就会把被雨露沾湿的衣服(双翼)来晾晒。当天气炎热时，暴风雨来临之前，蚂蚁就会排列成行，整齐地前进或后退，队形时开时合。求得此签者，自己不妨仔细思考其中哲理，可以得到莫大的启示。"},
{"签位":"白居易听琵琶 中平签","签文":"船泊浔阳月夜天，琵琶一曲动人怜；相思两地凭谁寄，白雪摧人上鬓巅。","解签":"这又是一支与唐朝诗人白居易有关的灵签，不过，这是中平，而第廿四签是下下。区别是，廿四签失于孤单；这支则属中平，因为，总算有片刻的欢娱。 这灵签中虽有快活，但极短暂，宜修身，忍守。虽无大碍，亦无欢喜之处，凡事亦凶多而吉少也。"},
{"签位":"张翰思鲈 中吉签","签文":"鲈鱼作脍菊花黄，美酒盈樽近晚凉；泛棹正当潮上候，这般往景乐无央。","解签":"此灵签虽只属中吉，但知足者求得，一定有很愉快的日子，凡事平稳无碍，是安乐也。 鲈鱼作脍，脍就是鱼生，有黄菊、美酒相伴，在秋高气爽的黄昏，泛舟在涨潮的湖上，试想一想，这样的良辰美景赏心乐事，还有什么忧愁。"},
{"签位":"贵妃自缢 下下签","签文":"倾国倾城媚百生，六宫粉黛尽无名；马嵬山下魂飞去，至今明皇长恨情。","解签":"唐明皇专宠爱杨贵妃，六宫美女尽不锺意，及安禄山作反，出兵征之，逃至马嵬坡，三军不行，要皇将杨贵妃斩首，至肯前进，于是贵妃死在马嵬坡下，而魂飞天上也，明皇日日长恨之，此签有凶无吉，求得此签者，凡事要谨慎，更宜防小人口舌，且必先弃恶从善，能化凶为吉。"},
{"签位":"蔡中兴遇险 下下签","签文":"狂风骤雨打船篷，溪畔桃花尽落红；惊醒渔翁春梦熟，持篙撑去失西东。","解签":"这支灵签是说蔡中兴晚上乘船视察工程时，忽然遇险。狂风骤雨，吹打着船篷，河边的桃花，都被吹落了。 惊醒了船上的渔翁，慌忙中，水流湍急，不辩南北西东。此为下下灵签，恐有惊险之象。"},
{"签位":"苏武牧羊 中平签","签文":"十九年前海上辛，节旄惆败逐沙尘；餐毛嚼雪谁怜我，惟有羊儿作伴群。","解签":"苏武饮雪吃草籽，在风雪中挨了十九年，才得以还乡。获宣帝赐爵关内侯。签文道尽苏武牧羊的艰辛，十九年如一日，天天紧握汉朝的使节杖牧羊，最后连节杖旗旄也被风吹去才得还乡。 求得此灵签必要立心忠直，隐忍受苦，凡事有神助，化凶为吉。以苏武之忠，随后终得归汉为官也，就灵签而论，凡事极其辛苦，但到底可达目的。"},
{"签位":"孔明借东风 中平签","签文":"曹操虽有深谋计，智慧难瞒诸葛侯；试看东风都可借，更能流马木成牛。","解签":"签中所讲，只是其中两个代表作，一是孔明借东风，火烧赤壁；二是发明了木牛流马这种运输工具，运送粮草补给。曹操有阴谋诡计，但也难胜过诸葛亮的智慧。 求得此灵签者，事无大小，都要心存正义，切勿自欺欺人，做事光明正大，才可以远离小人。凡事不利，要防小人是非口舌，如立心光明正大，化凶为吉也。"},
{"签位":"虞舜耕田 中吉签","签文":"大舜虽耕在历山，心常孝顺两嚣顽；田中之象同家象，善恶分明即此间。","解签":"这支签，有孝感动天的含义。大舜虽然在历山这地方耕地，但心里很挂念家中的父母，最难能可贵的，是这两位老人家，都是较为盲塞固执的，而大舜事亲最孝顺。 两老在大舜工作期间，时常因争吵而要大舜赶回家中去排解。幸而所养的大象，感于大舜的善良，都很听话，帮助他耕种及处理家务。"},
{"签位":"唐僧取经 中吉签","签文":"天将降任此其人，筋骨先劳苦彼身；莫谓佳景来可易，贫穷富贵有前因。","解签":"这支灵签是先苦后甜，凡事要尽心尽力之意。上天要人做大事，首先要令他筋骨辛劳，心脑受苦，甚至还要挨饿。千万别以为好景是天上掉下来的。每一个人今天享福或挨穷受苦，都是有前因的。"},
{"签位":"薛平贵归家 中吉签","签文":"此事真如到岸船，何忧风水不相全；举头便见前村落，屋角斜阳渺已烟。","解签":"这支灵签是平贵在军中建立战功，得意回窑，与妻子宝钏重逢的好景──眼前的事，就好像船靠岸，还愁没有风景? 抬头见到前面的村屋，在夕阳里升起阵阵的炊烟。心安快乐，无忧无虑，求得此灵签者，事事平稳，有吉无凶。"},
{"签位":"东坡游赤壁 上吉签","签文":"月夜秋江下钓鳌，鱼形恰似四腮鲈；家藏旧酿堪盈斗，与友飞觞尽倒壶。","解签":"这支灵签记述苏东坡游赤壁的赏心乐事，秋月照在江水，与好朋友泛舟垂钓，居然钓到极品四腮胪，所以把家藏的旧酒拿出来，与大家分享，共度这段欢乐时光。 有一斗家藏旧酒，与好友共斟同饮，此乃快乐优游之景象也，若求得此灵签者，所谋顺遂，百事皆顺，处处顺利。"},
{"签位":"陶渊明辞官 中吉签","签文":"归去来兮仕官闭，室堪容膝亦为安；南窗寄傲谈诗酒，倚杖徘徊饱看山。","解签":"归去来兮，做官有什了不起?回到我简陋的家园，虽然家居窄小，也觉得安乐无比。倚着南窗，寄托我的傲气，与知己把酒谈诗。 执杖登高，到处行脚，饱览山林美景。求得此灵签，乐得清静，有吉无凶。"},
{"签位":"夷齐让国 中吉签","签文":"夷齐不忍食周粟，兄弟心甘采蕨餐；让国名应垂万古，可怜饿倒首阳山。","解签":"周武王代纣，伯夷叔齐叩马谏阻，周王灭商后，两人耻食周粟，逃到首阳山，采薇蕨野草充饥，最终饿死。伯夷叔齐一向都被知识分子崇拜，为高尚节气的榜样。 求得此灵签者，却属于吉中有凶，有失运的隐忧。首当立一点善心，隐忍受苦，先难而后易也，此灵签吉中有凶，宜慎之。"},
{"签位":"伯才碎琴 下下签","签文":"人世知音能有几，碎琴都为子期亡；坟前洒尽千行泪，隔别阴阳各一方。","解签":"俞伯牙擅弹琴，钟子期死，伯牙以世上无几人能知音。将琴破碎不复再弹琴，从此阴阳相隔洒泪坟前。此痛恨之象也，求此灵签者，必要谨慎，宜多行善事，乃能化凶为吉。 此灵签为下下，既有悲痛之象，百事不利，亦有失友失物之意，暗示本身的才华无人赏识。求得此签者，宜平心静气，修身力学，退守一段时间，再待势复出。"},
{"签位":"张骞获宝石 中吉签","签文":"浮槎月夜到天河，曾见天姬织锦梭；石得支机人罕识，那知此宝出云窝。","解签":"这支灵签是说张骞月夜泛舟，来到天河，见仙女在织锦，他悄悄地取去织机上的一块石头而归，回到凡间才知道原来是宝石! 求得此灵签，有福自然来，而且又有身在福中不知福之象。凡事吉祥，请勿担心。当力行方便，善与人同，自有贵人来赏识矣，难得之宝而我独得之，吉祥也。"},
{"签位":"王允献貂婵 中吉签","签文":"月明散步到花栏，无策焉能剿灭奸；幸有貂婵思定国，英雄难过美人关。","解签":"这灵签是讲王允徘徊月下花前，正为剿灭奸臣伤脑筋，幸然婢女貂婵自愿以身报国，使王允的美人计得以成功，是英雄难过美人关也。 求得此灵签，今年有几点一定要注意，凡事立心要忠诚正直，切勿与坏人同流合污，要全力以赴，并要有信心。要立心忠直，有此善心，可以感动得人，必有贵人扶助，先难后易终必成功也。此灵签有吉无凶，但要防避小人口舌。"},
{"签位":"韩文公被贬 下下签","签文":"只因直谏怒天颜，昼夜难离在马鞍；主仆奔忙神亦倦，更加雪重拥蓝关。","解签":"此灵签是记述当时在贬谪途中的凄凉景况 因为直言进谏，而惹怒皇帝，早上上书，当晚就要起程到边远的潮州。 为了赶及上任新的潮州剌史，必须日夜赶程，人不离马鞍，韩愈忙于奔命非常疲倦的时候，更遇上大雪拥塞蓝关，人马受阻于途，难再上前一步。此为下下灵签，得罪皇帝，前途未卜。"},
{"签位":"唐天宝评花 中吉签","签文":"满园春色斗新妆，意似争妍夺国香；到底是谁居丽首，牡丹艳冠百花场。","解签":"这支灵签是当时百花争艳，牡丹被评为百花之首的情景。满园春色，百花都在炫耀自己的新妆，大家都有意争夺国香的殊荣。 到底是谁名列第一呢?你看牡丹!她艳压群芳，获得全场冠军! 此灵签虽只是中吉，但有春风得意之好兆头。"},
{"签位":"王质遇仙 中平签","签文":"采樵不意到云天，闲年敲棋二老仙；柯烂也思归故里，出中七日世千年。","解签":"王质，本是一位平凡的樵夫，有一日，上山砍柴，无意中，误进仙山，看见两位老人家在下棋，棋局适逢高手，变化万千，非常有趣。 王质看得入神，忘记一切，七日七夜，很快就过去了，王质才发现自已带来的斧头竟然烂了，才醒悟要取柴回家。当他返回家时，一切都已经改变了，没有人认识他，他又不认识任何人。 细问之下，才知道他离家已经一千年了!这就是山中方七日，世上已千年的故事。"},
{"签位":"左慈戏曹操 下下签","签文":"黄柑数盒献曹公，剖看原来肉尽空；怒动奸雄挥铁斧，奔忙身入万羊中。","解签":"灵签中所举的只是左慈戏曹操的其中一个例子，他把盒子外表金黄的极品柑果献给曹操，用刀切开来一看，里面却是空空如也。 激怒了奸雄曹操要把他追杀，他连忙混在羊群中逃走。这支灵签暗喻，在好的假象中，有极坏的潜伏。"},
{"签位":"鲁肃索荆州 中平签","签文":"遥遥千里来西蜀，欲问荆州那日还；刘备不言声泪下，自思无策转吴间。","解签":"求得此签者，凡事要隐忍受苦，多行善事，方能转祸为福也，论此签凡事凶多吉少。此灵签中有借而不还，亦有哭泣之象，求得者宜细心领悟其中意思。"},
{"签位":"卓文君卖酒 中平签","签文":"绣阁听琴自起思，改妆夤夜最欢时；可怜沽酒临邛市，才子佳人两下厨。","解签":"卓文君司马相如两夫妇开设酒档，一个是才子，一个是佳人。卓文君夜里听到司马相如的琴挑，于是决意漏夜跟他私逃。两家都要当炉卖酒，此有辛苦之气象也，司马相如后大贵。 此灵签是文君新寡时，后来二人闹市邛市卖酒，夫妻齐心合协力。求得此灵签者，凡事要隐忍受苦，先难后易也，此灵签不为吉，亦不为凶，得平常二字而已。"},
{"签位":"司马相如题桥 中吉签","签文":"十年窗下苦功成，有志难舒愿不轻；试看题桥十三字，生平心誓确钟情。","解签":"此灵签记述司马相如未成名之时，在桥头题字的感人故事。十年寒窗苦读书，终于学业有成了，但心中的大志却无机会发挥。司马相如在四川成都家乡的一条桥上，题了这十三个字，他日若不乘高车驷马，不过此桥!，其志竟有如此坚决者。 凡事要自己立定志向，务须要不辞劳苦，自然先难后易。皇天向不负好心之人，若能修善者，各事有吉而无凶。此灵签为一快活如意之景象也。"},
{"签位":"伍员出关 中吉签","签文":"记得当年伍子胥，潜奔难渡幸逢渔；欲将宝剑相持赠，大义交朋却不辞。","解签":"这支灵签是记述伍员逃亡时遇贵人。伍子胥逃难时，被江水阻隔，前无去路，后有追兵，幸有渔夫相救，载他渡江，伍子胥感激之余，坚持要以宝剑相赠，但渔夫却辞之不受。"},
{"签位":"成王剪桐封第 中平签","签文":"剪桐虽是作儿泾，封北成圭语不移；何以伪为成实事，言因无戏故如斯。","解签":"成王，西周国王，年幼丧父，国事暂由王叔周公管理。成王有一天，与弟弟唐叔玩游戏，成王把桐叶剪成圭形，说 “我封你为诸候。”周公知道这件事，便恭喜唐、叔。成王却说，开玩笑而已。周公教训他 “君无戏言。”后来，周公东征胜利，巩固了西周的政治势力，并还政于成王，成王大封诸候，果然守信，把唐这地方封给唐叔。 此签之含意甚深，凡事要诚恳，慎言，守信，兄弟要和好。"},
{"签位":"盘古开天辟地 中平签","签文":"上清下浊成天地，清浊相凝便作人；尔欲多求明白事，且将三等细分明。","解签":"这支灵签是说 气清而上浮者为天，气浊而下凝者为地，中间清浊二气相混者，就是人。假如你求得这签，只要仔细思考一下，将上中下的气与上中下等人联想，就不难悟出真理了。"},
{"签位":"冯暧客孟尝 中吉签","签文":"珠履三千客孟尝，谁人识得有鹰扬；其中弹铗归来者，便是英雄志莫当。","解签":"此灵签大意言众人所不能识者，就其中有一个英雄。求得此签者。凡事一定有好处，即英雄也，但必要修善，有神护助，始能识得出其好处耳。 这支灵签是说 孟尝君食客三千，谁人独具慧眼，识得其中这样的人才呢?这位曾经弹铗而歌者，便是冯暧这位英雄了。冯暖为英雄人物。其志气无人可当也。"},
{"签位":"庄周梦蝶 中平签","签文":"庄子酣眠成蝶梦，翩翩飞入百花丛；天香采得归来后，犹在高床暖枕中。","解签":"古人姓庄名周，梦自己化为蝴蝶，飞入花丛采花。梦醒之后，乃在高床暖枕中也，此乃一片假局。求得此签者，凡事多虚少实，究无可取，但亦无大妨碍，因此灵签有逍遥自在之意也。 这支灵签说的是庄周梦蝶的故事 话说庄子在梦中化成一只蝴蝶，在百花丛里飞来飞去，采得香花归来时，却发现自己仍然睡在高床暖枕里。求得此签者，逍遥快乐，与世无争，与人无求。暗示未是谋大事的时候。"},
{"签位":"吴隐之投沉香 中平签","签文":"浦号沉香遗旧恨，渡江犹忆古人心；可怜当日辞官去，浊有馨留不易寻。","解签":"忽然风浪大作，吴隐之连忙查问家人手下有无收受利者，众人都说没有，但有人提醒他，吴夫人手上的沉香扇，乃一父老所赠。 吴隐之马上焚香向天祷告，然后把沉香扇投入江心，果然风平浪静，江上出现一小岛，即今日之沉香浦，渡江者每追念当年隐之之清廉。 求得此灵签者，凡事平稳，须然吉中微有凶，但到底必好，不用忧疑。"},
{"签位":"吕祖桃木剑 中吉签","签文":"安知此剑不成龙，见水都应出袖中；他日飞腾千万里，上空妖娇有云从。","解签":"本灵签寓意吉祥，暗示一切都向好的方面发展。见于签语的首两字安知，怎么知道这把桃木剑不会成龙呢? 将来修成正果，一见仙水，它就会化成一条龙，从吕祖的衣袖中飞腾而出，飞升千万里，空中还有彩云相伴随! 求得此灵签，应努力振作修为，必成大器。有吉无凶，如能多行善事以培补之，则凡事愈顺遂，必发达矣。"},
{"签位":"独占花魁 中吉签","签文":"小楼春雨声初歇，徘徊街头屐不停；忽听卖花人入巷，一枝买得慢慢行。","解签":"这支灵签是说，春天来了，带来新的生机，要及时把握，独占花魁，魁者，首也，暗示凡事要饮头啖汤，但行事要胆大心细，眼捷手快之外，还要循序渐进，俗语说，捉到鹿，要识得慢慢脱角。 在小楼上，听得绵绵的春雨终于停下来了，但街头的脚步声，却又响个不停，忽然听见巷口传来卖花人的声音，马上买了第一枝花，然后在湿滑的街上，安步走回家。 求得此灵签凡事要淡定，不可急速，能谨慎自无差错矣。依此慢慢行三字论之，则平安大吉，凡事亦平稳无碍。"},
{"签位":"蹇叔哭师 下下签","签文":"秦师大败在淆山，三帅皆擒尽放还；蹇叔谏言因不听，倒戈舍甲返秦间。","解签":"春秋时，秦穆公要出兵侵犯郑国与晋国，老臣蹇叔极力劝谏，但秦穆公一意孤行，结果大败于淆山，三个元帅俱被生擒。此签凶险很多，第一是妄想，第二是不听忠言，一意孤行，第三是失败，第四是蒙羞，求得此签者，凶多而吉少，要多行善事，方能转祸为福也，宜当天作福吉。"},
{"签位":"东施效颦 下下签","签文":"浣溪纱女美无双，媚至吴王国破亡；最恼东施效颦笑，山鸡岂可胜鸾凰。","解签":"这支灵签是说，西施这位浣纱女，美艳无双，一笑倾城，再笑便令吴王倾国了。最不自量的是丑女东施，整天模仿西施皱眉头的样子，以为可以博取别人的怜爱，其实山鸡就是野鸡了，岂可以冒充凤凰呢? 求得此灵签者，凡事要守份安命，顺时听天，不可心高而强求妄想。明知自己不如人，而强学于人，反为不美，必凶多吉少。"},
{"签位":"李白醉和番书 中平签","签文":"和番醉笔似云烟，日在长安酒店眠；倘遇唐皇颁令召，重呼不上木兰船。","解签":"番邦帕特使来长安，诸多威胁求索，最危险的是，朝中竟无一人可与特使沟通。当时，有人向皇帝推荐李白，惜李白正大醉，皇帝颁召令请他入宫，亲自喂他服食解酒汤。 李白醒后，要杨国忠磨墨，高力士背靴，醉眼昏花下，笔似云烟，写了和番书，吓得番邦不敢再来犯。 求得此灵签者，宜看各事等闲，不可贪心。勿与人争长短，况且色即是空，空即是色，不为物欲所累。退一步想，自然快乐，以签论之，凡事亦平稳无碍。"},
{"签位":"十二金牌召岳飞 下下签","签文":"十二金牌速召回，奸雄设计几时灰；可怜一旦功劳散，老少扶车不断哀。","解签":"此灵签为下下签，暗示在功败垂成的一刻，遭奸人所害。十二度金牌召回岳飞时，百姓扶老携幼送行，悲哀万分。 求得此灵签要趋吉避凶，首先要修善积福，其次是处处防犯小人，再者更要广结善缘。常常听取别人忠告。 事事要提妨小人侵害，且要多行善事，广结善缘，乃能消此劫气，逢凶化吉，转祸为福也，宜当天作福吉。"},
{"签位":"孔子守道 中平签","签文":"美玉于斯韫匮藏，休求善价费商量；沽之亦可随相待，此物何须自看常。","解签":"这支灵签是说 一个人的才学，就像一块美玉，应该好好珍惜，收藏在柜中，并不是等待有好的价钱，然后出卖。而是要看机缘，假如遇上有眼光，真正欣赏自己的识货之人，那又是另一回事。怀才不遇的人，又何必常常顾影自怜呢?"},
{"签位":"颜回乐道安贫 中吉签","签文":"陋巷箪瓢不足愁，旁人见此甚为忧；不知乐道忘贫乏，亚圣芳名万古留。","解签":"这支灵签是孔子称赞颜回的话 颜回真是一个贤人，他乐道安贫，生活在陋巷里，只得一碗饭、一杯水，旁人看见他的环境，都替他担忧，但他却无忧无愁。世人应知道，一个人如能专心于学问修道，是可以忘记贫穷的。 凡事务须要忍于贫苦，一切财利，不可贪恋，一于真心修善，则实至名归，名垂不朽矣。就算贫乏终身，亦无碍也，此灵签有吉无凶。"},
{"签位":"孟之反殿师 中吉签","签文":"奔殿须知上古人，入门策马不夸能；败师谁肯甘从后，托谓鸣马畏苦辛。","解签":"因为按照常理，败军谁肯甘愿跑最尾呢?但是，孟之反还有更伟大的情操，他在别人的称颂声中，却很谦虚的说。我不是勇敢，只是我的坐骑太累了，怎么样鞭打它也不肯走呢!孔子曾大赞孟之反的英勇仁义。 求得此灵签者，凡事要忍辱待人，不可与人争论，谨以修德宽心接物，如此可逢凶化吉矣。"},
{"签位":"后主失国 下下签","签文":"隋灭陈时戟伐纷，都因妖媚闭明君；东奔西走无藏息，井里胭脂隐玉人。","解签":"此为下下灵签，凶险多多，要及早防范，不要沉迷酒色，胡天胡地，否则，灾祸速至，后悔莫及。 求得此灵签凡事要谨慎，勿受小人昏闭，多行善事，乃能消此劫气，转祸为福也，此灵签要防女子小人口舌，宜天后庙作福吉。"},
{"签位":"羲之会群贤 上吉签","签文":"兰亭雅会众群贤，曲水流觞舍管弦；天朗气清风惠畅，茂林修竹乐怡然。","解签":"王羲之，书法家，他的字帖，为历代朝野收藏的至宝，很多皇帝甚至用王羲之的字作为陪葬品。后人尊他为“书圣”。《兰亭序》更是王羲之最著名最成功的书法，卷上有多位皇帝加盖玺印。兰亭序记述王羲之，在三月三日与一众好友在会稽山之兰亭，欢聚的情景。在短短的二十八字签语中，已写出一幅有音有色的图画。求得此灵签，百事吉祥，快活顺景。"},
{"签位":"李元霸称雄 中平签","签文":"人虽勇力不能当，莫恃英雄独冠场；可挟泰山超北海，身心犹贵重存亡。","解签":"此灵签有提醒凡事不可锋芒毕露，搏得太尽，容易残。灵签语云李元霸这人，虽然能力不可挡，但是不要自恃年少气盛，到处耀武扬威，即使有力拔泰山、翻江倒海的力量，也应该顾及自己的生命。做人不能一味靠恶靠蛮力。"},
{"签位":"姜太公得志 中吉签","签文":"久抱凌云志未舒，荷竿渭水钓游鱼；文王千里求贤士，灭纣兴周任意如。","解签":"求得此灵签者凡事存一片善心。守慎安命，顺时听天，终必有贵人指引提拔，事事如意吉祥，荣华发达也。 此灵签虽为中吉，但寓意吉祥，求得者，只要能顺应天时，立心良善，必然万事如意。"},
{"签位":"韩文公祭鳄鱼 中吉签","签文":"忠义存心官十载，年丰民乐惠难忘；鳄鱼毒害都能息，祷告长江北海王。","解签":"求得此灵签者，凡事心诚志坚，定可逢凶化吉──韩文公在潮州为官十年，心存忠义，令当地人民安居乐业，诚心祷告之后，连恶毒的鳄鱼也平息。 求得此灵签者，务要自己存一点善心，宜多行方便则善气所感，可逢凶化吉。劫运可消除矣，就此灵签论，平稳无碍，有吉而无凶，但要防避小人是非口舌。"},
{"签位":"塞翁失马 中平签","签文":"可比当年一塞翁，虽然失马半途中；不知祸福真何事，到底方明事始终。","解签":"这支灵签暗喻事情仍有反复，坏事可以转化成为好事，而好事亦会转化成坏事，但是我们只能像当年的塞翁一样，暂且接受现实，不管是祸是福，都要处之泰然，善恶到头，是会有结果的。 人生祸福难以判定，惟行善者，祸可以转为福。若求得此灵签者。不可以现下有福而欢喜，亦不可因现下有祸而忧愁，总要立定主意，一于行善，方便于人。此灵签吉凶难定，随人自作，凡事宜子细方可避免。"},
{"签位":"庄周活鲋 中平签","签文":"涸辙之中鲋困之，穷通自可卜当时；若能引得西江水，他日成龙也未知。","解签":"这灵签是庄周笔下的一个故事 有一条鲋鱼，被困在车轮压成的一个小水坑中，当时的穷途困境，不用多说，相信大家都会明白。但是，假使间，西江水引入，涸辙之鱼能逃过此难，他日重回大海，成龙也是有可能的。 求得此灵签，是凶多吉少之象，而困境非常艰险，又不能自拔自救，必须要等待时运的大变，或得到大贵人施以援手，方能获得解脱。"},
{"签位":"高文定守困 中平签","签文":"兔儿久待意何如，堪叹愚人独守株；算是无能令我笑，不须守旧自拘拘。","解签":"古人有看守一树而待兔来者，待之甚久，不见兔来。此人仍守树而不去，其愚拙无才能，真令人笑矣。不可拘泥守旧，若一味固守，虽属无大碍，究亦无益也，又何若而为此哉。 灵签说 花这么长时间去等待兔子，又何苦来由呢?这个守株待兔的愚人，真是可怜。他的低能，实在令人好笑，做人为什么这样守旧而自我拘禁呢? 求得此灵签者，虽无大碍，但短期内亦难望有什么大作为。有受困而难得贵人之象，要立即修善以感动人心。后必有贵人来提拔，转祸为福，宜早不宜迟，如鱼失水，不能待久也。此灵签乃凶多吉少，现下尚未定者，全在人事而为之。"},
{"签位":"孙霖中状元 上上签","签文":"夹道花香衬马蹄，蓝袍改换锦衣归；满街红粉皆争羡，翘首芳名雁塔题。","解签":"中进士点状元谓之雁塔题名，穿着蓝袍去而换转锦衣归，一路花香衬马蹄，满街都是红粉女。争看状元来，此乃群众欢呼快活之事。求得此灵签，万事皆吉祥，得偿素愿，吐气扬眉，名成利就，有一个非常美好的开始。 这是一支春风得意、衣锦荣归的上上灵签。签语道尽孙霖中状元的喜气洋洋。新科状元骑着骏马，大道两旁的香花，好像在夹道欢迎。"},
{"签位":"朱买臣分妻 下下签","签文":"回忆当年运蹇时，夫妻反目两分离；名题雁塔归来后，复水马头时否悲。","解签":"回忆当年我运滞的时候，夫妻反目，闹离婚。如今我名题雁塔载誉归来，你却又要求重修旧好，你看看，我泼在地上的那盆水，有没有办法收拾，真可惜! 求得此灵签者，凡事要隐忍受苦，将来必有发达之日，若不能立定坚志。遇有不如意之事，即欲求改，到时必恨错难翻矣，就此签论，有凶无吉，须知机也。"},
{"签位":"伦文叙戏妻 下下签","签文":"婚姻岂可厌家贫，文叙夫妻两拆分；一旦首登龙虎榜，戏妻楼坠自身亡。","解签":"这又是一支贫贱夫妻百事哀的下下签。伦文叙是一介寒生，妻子嫌他穷，改嫁了。当伦文叙中状元后，妻子悔恨交集，被伦文叙奚落了几句，就跳楼身亡了。 试看看灵签给我们的启示，婚姻是终生大事，岂可因一时贫困而变心呢?伦文叙夫妻，就是这样拆散了，一旦丈夫金榜题名，那时就后悔莫及了。 此灵签险象环生，一是要挨穷，二是夫妻拆散，三是看不开时，还会有更大的不幸。凡事总要安份守己，不可多心妄想，捱得若楚，然后苦尽甘来。因祸而得福也，世界花花不外循环两字。否极则必见泰来，若不修善而妄动横行，祸机一发，悔之莫及矣。"},
{"签位":"孔子修身不厌贫 中平签","签文":"人能乐道自修身，疏水曲肱岂厌贫；不义而富且贵者，我心都作是浮云。","解签":"这是至圣孔子修身乐道安贫的写照。人贵于能向往真理正义，不断求学问，修养自己的品格，即使暂且的环境不好，粗茶淡饭，甚至要枕着自己的手臂而眠，我们也不要自暴自弃。 对于那些谋取不义之财而成为富贵的人，在我的心里，就只会当作是浮云而已。求得此灵签者，虽然可能大运未到，但只要坚守原则，站稳岗位，始终是有成正果之日的。 求得此灵签者，必要隐忍，受得艰辛，不可有厌气。且要乐心行善事，修身积德，要把定自己，不贪不谋，要能安贫乐道。始终无怨心，将来必有一番佳景，可预卜之，不用忧疑也。"},
{"签位":"公冶长入狱 中平签","签文":"鸟语能通公冶长，南山有个虎拖羊；其身虽在于缧绁，到底非关自己殃。","解签":"求得此灵签者，凡事要谨慎，不可轻听人言。不可理人闲事，自己仅能以收善为心，虽有意外之虑，受人冤屈，不可与人争论长短。终必有救星，可逢凶化吉，此乃先难后易之灵签，要防小人。 此灵签虽然有惊无险，但如果轻信人言，则容易惹祸上身，等到有人相救，已经吃了眼前亏了。"},
{"签位":"曾点论志 上吉签","签文":"瑟希铿尔尚留声，春暮时刚春服成；冠五六人童六七，舞雩归咏畅幽情。","解签":"这支灵签是曾点向别人说出他最大的愿望，希望和谐的琴声，到处飘扬，在暮春三月，穿上刚刚缝好的单衣，带着五六位年青人、六七位儿童，虔诚地去做完了求雨的祭祀，归家途中，心安理得，放怀唱咏。 求得此灵签，只要心诚心善，事事如意，天从人愿。凡事必须安守本，善与人同，则随时随地无不优游快活矣。"},
{"签位":"张良悟道 中平签","签文":"富贵有如春梦熟，世人何苦力争求；任他秉笏当朝立，到死惟留土一杯。","解签":"此灵签系张良在拜相封候之后，领悟到人生如梦，富贵名利像过眼烟云。富贵好像春梦一场，世人又何苦费力去追求呢?即使争得到，手托朝笏，站在天子殿下，他日死时，还不是留下一堆黄土? 求得此灵签者，惟安份守己，切勿起贪心而妄求。更要存心积善，名垂不杇，万载留存，更为实际。切不可以虚之心来对人，此灵签无欢喜处，亦无害处，平常而已。"},
{"签位":"乐广释疑 中吉签","签文":"飞觞对舞几时赊，弓影横杯误作蛇；猜透诗中玄妙诀，泰来否极事无差。","解签":"一边饮酒一边欣赏歌舞，是多么难得的乐事，无端端却把杯中的弓影误作是蛇，真冤枉!明白此中的道理，就是趋吉避凶。 求得此灵签必要力行善事，即使对人有愧，对鬼神亦无惧，则心有主宰矣。遇艰苦之事，亦易应对，不至误为蛇落杯等弊，此乃衰极而转归，荣发之灵签也，凡事俱平稳无碍。"},
{"签位":"子路拱雉 中吉签","签文":"山梁雌雉得其时，上下飞鸣自乐之；色举须知翔后集，作声三嗅过山欹。","解签":"因孔子被尊为至圣，这只雌雉在孔子面前歌舞，亦被称为朝圣。按照灵签意，是有一番好景的，但凡事都要知机，间中可能会出现危机时，要知道避忌。 求得灵签触物思人，当要识时务晓机关，遇有不合意者，势色不同，立即转机退避。探真地步，稳阵无险，方可停留。恐人害己，而入其牢笼而不知，故要提防小人及是非。"},
{"签位":"孔子击磬 中平签","签文":"圣人击磬在于卫，谁料过门有荷篑；嗟叹有心挽道穷，可怜日月今将逝。","解签":"求得此灵签者，凡事以善良和顺为贵，不要以为善事太小而不去做，也不要以为恶事太小而去做。做人，要把握今天珍惜今天。 凡事当以救人为己任，或出钱，或出力，有利益于人者便要做。幽则有神鉴赏，明则有人称羡，何乐不为。若年纪老更要及早行善以救人，则必有贵人扶助。 此灵签似有忧愁气象，问事者亦平常，无碍平稳。但是非小人口舌，恐难避兔矣，宜慎防能避之者吉。"},
{"签位":"赤松子招隐 中平签","签文":"凡尘身历几时闲，世事浑如迭迭山；既富尚忧无贵子，不知花放又花残。","解签":"世事如轮转，功名利禄的追求，永无止境，何不随遇而安，把得失荣辱都置诸度外，凡事但求心之所安，要做生命的主人，不做生命的奴隶。一个人，能看化，能知足，就乐在其中了。 世道循环，无长久富贵，一切功名钱财。妻儿子女，第一要知足，第二要看化，随遇而安，不为世事所累，此身才有日清闲耳。"},
{"签位":"韩信弃楚归汉 中吉签","签文":"满腹奇才志未冲，铁鸡难举意无容；张良指示身投汉，项羽乌江命自穷。","解签":"求得此灵签，今年会有转机，宜好自把握，切勿自暴自弃。作事不可心急，暂时安份守己。行善修福，终必有贵人提拔，风云际会，荣华发达，吐气扬眉也，人生斯世，时运未到，藏器待时可也。"},
{"签位":"刘向得志 上吉签","签文":"太乙燃藜照读书，十年窗下苦功舒；扬眉吐气袍穿锦，驷马高车拥道随。","解签":"太乙神仙燃藜作灯照明刘向，是有大贵人相助，天时尽得之吉祥寓意，是一支很好的灵签。求得者假如能把握良机，未来数年必定有一番成就。 灵签意是太乙神仙燃藜为灯，照我读书，十年寒窗下的辛苦用功，终于是舒一口的时候了。看我身穿锦袍，扬眉吐气，坐着四匹马拉的高车，前呼后拥，多快乐。"},
{"签位":"侃母迎宾 中平签","签文":"截发迎宾否也贫，贫中贤妇更何人；古今只有陶侃母，所以名留万代闻。","解签":"这支签是讲述陶侃年少时家贫，无钱迎迓宾客，陶母非常贤淑，毅然剪下自己的长发，拿去变卖。这样的贤妇，古今只得陶母一个，是值得万世景仰的。 求得此签，他日或者有好环境，但目前就要设法守一段日子了。凡事要隐忍待时，虽困穷到极，若存正直之心，终必有好处在日后也。若现时困难，切不可妄动横行也。"},
{"签位":"陆士龙会客 中平签","签文":"会谈华座逞英雄，究竟谁人秉大公；一云日下荀鸣鹤，一说云间陆士龙。","解签":"此灵签有口舌是非之象，凡事切忌口水多过茶。签意是 在会谈中，各逞英雄，究竟哪一位的观点最正确呢?难以定论。 有人说 荀鸣鹤有道理，也有人说陆士龙辩赢了。虽然无伤大雅，但与人争执，费时失事伤感情。 求得此灵签不可乱听人言，及与人争执，则逢凶可以化吉。平安无事，此灵签不凶不吉，平平稳稳，但要防是非口舌，言语都要谨慎为是。"},
{"签位":"花木兰从军 中吉签","签文":"替父从军胆气雄，须眉巾帼几人同；以身报国忠而孝，笑煞当时众臣公。","解签":"求得此灵签，可从中省悟两个道理 一是尽孝心，二是尽忠心。替父从军，胆色过人，女人能有男人勇，世上有几人?以身报国，既忠且孝，当时很多大男人都自叹不如呢! 凡事尽忠孝之心，定能逢凶化吉，无论有什么艰难困阻，都可以安然度过的。此灵签暗示，努力坚决下去，终会出人头地的。当即勇往向前，不辞劳苦。人所难造者，自己尽心竭力造之，有此气概，事事皆吉。"},
{"签位":"吴季子挂剑 下下签","签文":"他乡远历佩鱼肠，谁料徐君意欲将；既返愿为相赠答，且悬树下表情长。","解签":"此灵签为下下，求得者，要小心趋避，凡事要谨慎，不可任意妄为。如果以此签问自身者，今年内暂勿往探病吊丧。 求得此灵签者，凡事要谨慎而行，切不可随意。如属问自身签，探丧问病都不宜去，以免沾染病痛也，宜向社坛作福吉。"},
{"签位":"红拂女私奔 中平签","签文":"细整残妆夜欲奔，座中李靖更何人；那知虬髯情钟处，拔剑三回未敢陈。","解签":"红拂女、李靖、虬髯客，三人之间的微妙关系，藉此签提醒我们，凡事要忍让，不可鲁莽行事。 求得此灵签者，凡事隐忍让人，方能逢凶化吉。就灵签而论，不为吉亦不为凶，不过无大碍，平淡而已。"},
{"签位":"月里嫦娥 上上签","签文":"蟾宫月殿柱飘香，玉箧团圆万里光；六水三山归镜里，无瑕一片挂穷苍。","解签":"此签是说嫦娥在月宫无忧无虑的神仙生活。在蟾宫月殿中，桂花常飘香。一轮圆月像玉箧，照得万里银光。 人间的六水三山，都在月色下展现无遗，白譬无暇的一片圣洁，高高悬挂在青天。求得此上上签，高贵神圣，万事皆圆满，前途光明。"},
{"签位":"孔子闻韶乐 中吉签","签文":"至圣周游列国行，在齐得听奏韶乐；三月不知嘉肉味，善哉大道可功成。","解签":"灵签的含意，简明易懂，但其中道理，就要求得此灵签的人，慢慢去领悟了。大致上有吉无凶，但是吉祥的程度有多大，与个人的努力有密切关系，如果，明知前面有个大金桔，也懒得去摘，那就如入宝山空手回了。 凡事能专心去做，则必成功。作事要有恒心，有坚志，不可分心骛外，则自然有吉无凶矣，凡事顺利。"},
{"签位":"孔子闻卫乐 下下签","签文":"郑卫之音不忍听，淫风败俗国将倾；令人深入迷津路，所奏全非古乐声。","解签":"签云 郑、卫的音乐，真难听!既诲淫，又伤风败俗，迟早会令国家倾亡的。因为，它所奏的，全非正经音乐，听多了，会消磨壮志，误入迷途的。得此签，有所警惕，是可以趋吉避凶的。 求得此灵签者，凡事当谨慎，择善而行，一切声色财利不合义者。切不可贪，必至败家丧身矣，要防小人说是非，慎勿轻信人言。"},
{"签位":"髯公远走扶桑 中平签","签文":"一窟难容两虎儿，乘风别岭各栖之；名山自守为巢穴，可免伤残后悔迟。","解签":"正所谓，一山难藏二虎，倒不如知机另觅山头栖身，各有各的环境，这样可以避免两虎相斗必有一伤的命运了。凡事要总要知机，预先退避，不可勉强去做。 求得此灵签两人谋事必不成，即成亦难得长久和衷共济。又要审度时势方可举行，如虎之待有风，乃可分居别处，如此彼此可免伤残矣。此灵签凶中似有吉，若能隐忍让人，则可以转祸为福，不可不知。"},
{"签位":"女娲炼石补天 中平签","签文":"功勤一篑可成山，由少而多莫惮烦；作事畏辛今汝画，补天炼石亦无难。","解签":"此灵签有劝人将勤补拙之意 别看轻这一捧一捧的泥土，堆积在一起，就可以成为一座山了。 凡事都是由少而多，不要怕麻烦，做事怕辛苦，会令您一事无成。您看看女娲炼石补天的例子，又有什么难字可言呢?得此灵签宜在平稳中勤奋工作，创造未来。 求得此灵签凡事要不辞劳苦，勤恳用功，终必有成。到时一劳永逸，苦尽甘来也，乃平稳之灵签，不用忧疑。"},
{"签位":"文姬思汉 中平签","签文":"羌笛频吹韵更悲，异乡作客触归期；南来孤雁如怜我，烦寄家书转达知。","解签":"如果在春夏时分求得，则及早趋吉避凶。羌笛在塞外频吹，曲调更令人伤感。它使异乡的游子，醒悟起归家的日子，遥遥无期。这是一个悲凉的意境，在秋冬两季求得此灵签者，要特别小心。 南来的孤雁，假若同情我，请常常替我传递家书给故乡的亲人。于此环境，首先要自我珍重，保存实力，等待运转的一日。求得此灵签凡事宜慬慎，秋季更要注意，宜向天后娘娘作福吉。"},
{"签位":"康顺钓鱼 中平签","签文":"凭栏晚眺倚南楼，满目风光景色幽；一叶小舟频下铒，渔翁钓得有鱼无。","解签":"这支灵签中虽然并无凶险，但亦只空有良辰美景，钓鱼不得其法，有无收获，还是个未知数。 求得此灵签要看看自己的年龄，年老者，姑且逍遥度日，但求心之所安，年青者，那就要好好把握时机了。"},
{"签位":"管鲍分金 中平签","签文":"入山种玉嫌田狭，掘地寻金厌客多；富贵贫穷天注定，世人何苦力奔波。","解签":"此灵签以管鲍分金，来劝喻世人不要因利忘义。灵签云 自私的人，入山采玉，又嫌自己的田地狭窄，掘地寻金，又厌寻金客多会分薄自己。 我们应该学管子与鲍子，明白富贵贫穷一早就天注定，世人何苦为财而奔波呢?得此灵签要守义修善果，不要做金钱的奴隶。 凡事宜力到力为，修善果植福基，自然可以获福，不必强求。所谓不须着意求佳景，自有奇逢应早春。"},
{"签位":"韩文公遇害 中平签","签文":"雪拥桥头马不前，风狂渔父莫开船；水流花谢人谁惜，早立坚心志勿偏。","解签":"此签有叹息时运不佳之意，落花流水谁人同情，唯有靠自己立志坚定而已。后来韩愈在潮州政绩伟然，被谥为文公。 求得此灵签凡事务须谨慎，更宜防小人口舌是非。此灵签虽无大碍，亦无可喜，能谨慎可得平稳而已。"},
{"签位":"唐明皇赏花 中吉签","签文":"百花竞放贺阳春，万物从今尽转新；末数莫言穷运至，不知否极泰来临。","解签":"虽为中吉，但有宝物沉归底之意，又有否极泰来、面临另一个循环之象，求得者，苦尽甘来，运势转弱为强，处处显现生机。得此灵签必有一番新景象。 天运循环，无往不复，如百花争放，以贺新春，万象维新。人亦从此改过从善，涤虑洗心，旧染污浊，焕然一新。虽目前否塞之极，自有亨通荣发之时也。求得此灵签者，渐进佳境，苦尽甘来，转祸为福也。"},
{"签位":"彩凤呈祥瑞 上上","签文":"彩凤呈祥瑞，麒麟降帝都，祸除迎福至，喜气自然生。","解签":"今运如彩凤呈祥，祸事尽除，喜逢吉庆更遇新好运，贵人，旺财；荣誉提升百福至，得此签可得神佛赐福百事遂心，更宜多布施行善，持福惜福，福德俱增，自然喜事连连。"},
{"签位":"从革宜更变 上平","签文":"从革宜更变，时来合动迁，龙门鱼跃出，凡骨作神仙。","解签":"是你必须要\"革新\"与\"变动\"目前的人、事、时、地、物后，才能转好运的暗示。 目前时机成熟，作事应常改变新的思维与想法，并听听别人的意见。不断尝试新的作法。 累积新的经验。来日必能脱胎换骨，鲤跃龙门的一天。"},
{"签位":"动作因风便 中平","签文":"动作因风便，求谋可托人，若逢戊己土，事事得遂心。","解签":"最利房仲，土地开发，殡葬业。本土演艺界……等团队或组织，主得财又可得善报与福报。 时运红莲正发，可得神佛之庇佑，一展长才，又得贵人可依托相扶持，凡事积极进取，可卜大收获。(逢戊己，年月日时)求谋作事更佳。"},
{"签位":"船放江湖内 小平","签文":"船放江湖内，滩边获宝多，更宜将大用，灾散福来居。","解签":"劝你无须感叹大材小用或怀才不遇。只因为你太在意周遭的人事物，才会有此感叹，应该以寻宝的精神，无畏惧的在目前的环境中，多学习多历练，累积更多的经验，放眼于未来将负有大任的心境。自然豁然开朗，灾厄自散所求如意，好事成大吉，合家康宁免灾殃。"},
{"签位":"此签按南方 下下","签文":"此签按南方，灾厄不可当，官司多不利，目下有灾殃。","解签":"朱雀扰人，心生犹豫，是非口舌无端缠，提防官讼是非灾，破财祸事连连 小人挑弄是非，百口莫辩。此签最不利官场，职场，演艺界。主不名誉或桃色…等纷扰事件。 是非曲直无定论，破财劳神伤身。凡事谨言慎行。所求皆不遂。 若遇此兆宜忍宜守，息事宁人或当头棒喝，莫与随舞争辩，可免进退失据，祸不单行。"},
{"签位":"且安君子分 中平","签文":"且安君子分，勿用小人言，凡事皆当谨，作福保安然。","解签":"运逢腾蛇张口，主有小人，恶人或官非纠缠伤人伤己。 此签暗示周遭会有小人或危害你之人。作事须谨守中道份际，莫信谗言。 切不可隐忍或怕事附和，放任是非不明，危害别人，终将报应汝身。"},
{"签位":"国治人安泰 上上","签文":"国治人安泰，家财渐渐兴，有财求望吉，有福亦平安。","解签":"运逢大鹏展翅，众恶消退，时运亨通，宜积极进取。财利渐进。 大鹏展翅，国泰民安，财富充满。但只宜循正道，否则报应如雷。 曾有违心者，宜多作济贫，布施斋僧及放生，可增阴德积福，欲保百年增富贵，孝义常存永康乐。"},
{"签位":"目下如冬树 中吉","签文":"目下如冬树，枯木未开花，看看春色动，渐渐发萌芽。","解签":"枯木逢春，目前时运不佳，多烦忧，只宜安守莫忘为。 不过看来你的运气已快转运，春天一片荣景，你应该趁现在多祈神作福，累积更大更多的福报，让好运加速到来。"},
{"签位":"时融逢和气 中平","签文":"时融逢和气，衰残物再兴，更逢微细雨，春色又还生。","解签":"可得神佛及贵人之助，逢凶化吉，应多求神行善事，遇难反成转机，只需再忍一时，祥福可期，凡事宜自我检讨回思旧往，自得心胸开豁，福气自来运气自舒。"},
{"签位":"灾散福门开 大吉","签文":"灾散福门开，无边喜气来，目下相逢处，须当得横财。","解签":"应多勤修求神作福，以求灾散好事好运进门来。 时运渐通。 应即刻多经营计划，若得天时，将来富贵可期，锦上添花，宝物不求常来。"},
{"签位":"进取逢通达 上平","签文":"进取逢通达，寒儒衣锦归，何人占取卦，凡事任意为。","解签":"如禾苗久旱降甘霖，客旅他乡见故归，秀才儒生登金榜，龙门奋跃上青云。凡事宜积极进取。尤利出外远行多奇遇，可卜衣锦荣归之兆。 ，贵人财宝进门来，吉祥如意。"},
{"签位":"井底观明月 下凶","签文":"井底观明月，见影却无形，钱财多散失，谨守得安宁。","解签":"不可心高自误前程，以免目光狭隘而自限。 劳劳终日求财未必有分毫，早出夜入空费力，更须提防小人诱骗失财。 只能静守切莫忘想妄为。宜求神作福解厄消灾。"},
{"签位":"心思多不定 下中","签文":"心思多不定，求谋未得成，忍耐方为福，守分免灾星。","解签":"有观君为善的意思，诸善奉行诸恶莫作，万顷心田常自省，父母堂前须孝敬，作事顺天理多福气。 时运逢灾星，谙晦暧昧是非难明，遇事应多审酌，不可行偏，营私妄为。 只宜耐守正道不可有贪婪侥幸等非份之想。否则必遭天谴，祸事连连。"},
{"签位":"枯木逢霜雪 下凶","签文":"枯木逢霜雪，扁舟遇大风，惊心无可免，百事不行通。","解签":"运逢玄武当令，凡事只能逆来顺受，运如枯木遇霜雪，雪上加霜。 主破财横祸侵，应提防口舌官非，内防宵小，盗贼，水火之灾，户内之人逆事……等意外及纷争之事；外防欺压拐骗之事，小人得势，祸事临头，内外不安。 宜求神消灾解厄。切勿求人以免祸不单行。"},
{"签位":"日出临东海 平吉","签文":"日出临东海，光辉天下明，动用和合吉，百事自然成。","解签":"运如枯木逢春再发开，如同古镜又重明，厄运消散。 此时更宜积极作事进取，凡事诸般皆大吉，招财进宝顺风行。"},
{"签位":"众恶皆消灭 中吉","签文":"众恶皆消灭，端然福气生，如人行暗夜，今已得天明。","解签":"时逢吉凶交替，时运欠通，如暗夜摸索行路，目前先求安，待时机明朗后再图振作，或急寻名有\"日\"或\"月\"字边之贵人，遇之运有如日月照路，重见光明，百事所求，皆可称意，出入经营，事事顺心。"},
{"签位":"服药将身保 中平","签文":"服药将身保，缠绵词讼连，百凡宜守旧，作福自然安。","解签":"青龙落难，大势已去。切莫再逞强好斗，狡辩欺瞒，只会内外俱毁，遍体麟伤。 更会换来无止尽的缠讼不休，目前只宜服药保命，并低头自省。忏悔前过，暂时委曲求全，逆来顺受。 静心休养守旧，修福行善积德，日后再图振作。"},
{"签位":"签中多恍惚 下下","签文":"签中多恍惚，钱财暗里磨，恩深成怨去，人事不须知。","解签":"运逢五鬼，若无求神制煞定有灾殃，谨防家中六畜，女人，小孩疾病及意外损伤。 五鬼当令，行事犹如游魂般，恍恍惚惚过一天是一天，钱财耗散。 谨防偷，盗，抢。遇小人恩将仇报。 内外不安，六亲无情，反目成仇，忿忿终日，终仍不得解脱。"},
{"签位":"根实枝叶茂 上平","签文":"根实枝叶茂，林多格式高，经荣多得利，兰蕙似蓬蒿。","解签":"因为你平时的灌溉而根实叶茂，即将有超乎想像的惊喜成果。 表示现在所作的一切，有如应天时播下的种子。只要再耐心的去经营灌溉与维持。 不需多久就可得到令你意外的惊喜结果。也鼓励你要多改变多尝试创新的方法，累积自我的经验，获得更多的惊喜连连。"},
{"签位":"求名居禄位 上吉","签文":"求名居禄位，笼鸟得逃生，出入多财宝，更宜远方行。","解签":"笼鸟脱困之兆。暗示留在原地如笼鸟受困，才华受限，唯有遨游天际四处翱翔。才能增广见闻一展长才。 一切求谋皆遂意，远行多吉庆，人口兴旺六畜增，四时五方皆吉祥。"},
{"签位":"明月清天上 吉","签文":"明月清天上，今霄照绮筵，家家沾恩泽，万里净云烟。","解签":"最利女人或可得女贵人相助。 运如明月当空，万里无云，运势通达，作事清吉求财得利，官场，职场尤其吉利，演艺界更是万里扬名之兆。"},
{"签位":"福禄得安康 吉","签文":"福禄得安康，荣华保吉昌，所得皆遂意，千里共兰香。","解签":"千里扬名之兆，最利外出经营，土地仲介，演艺事业之人，官场如意。 家门安康喜气生，出外经营多得利，灾去福来添光彩，作事求谋到处成。"},
{"签位":"羸马登程去 下","签文":"羸马登程去，饥人走远途，前人多阻厄，退后祸方无。","解签":"朱雀临门，是非口舌无端起，提防官讼是非灾，破财祸事连连，行事宜低调谨慎，小人挑弄是非，百口莫辩。 此签最不利官场，职场，演艺界；主不名誉或桃色事件。是非曲直无定论，破财劳神伤身不可免。 凡事谨言慎行，只宜息事宁人或当头棒喝，莫与争辩，可免进退失据。祸不单行。"},
{"签位":"三姓俱相伴 吉","签文":"三姓俱相伴，祥光得共生，更宜分造化，百福自然亨。","解签":"最利团队，组织，三人行或业绩单位；主业绩达成，若能同心，求谋荣显更相亲。共得横财，共得荣誉，出入享通多吉庆，合家大小皆欢欣；切忌私心误人误己。"},
{"签位":"此签占太和 吉","签文":"此签占太和，求谋喜事多，远人归古里，身乐得欢歌。","解签":"运如太平盛世。经营得意，贵人相助多发财，合家大小皆和顺。 最利团队，职场及组织等业绩发展单位，主业绩达成，团队扩大，战力提升，若得昔日伙伴归队，如虎添翼，战无不胜，攻无不破。 此签也主外出经营可获发达，衣锦荣归之暗示。"},
{"签位":"霖雨滋稼穑 大吉","签文":"霖雨滋稼穑，何愁不倍收，自然心得乐，安居总无忧。","解签":"是神佛暗示你不须多做无谓的烦恼与忧愁。事情的发展与结果都是吉祥如意的。 眼前虽有不顺，只需再稍待时日，就能峰回路转，柳暗花明又一村。 凡事请以平常心，顺其自然，无须急躁，更不要鲁莽行事，安车当步，运势清吉慢成，无须多烦忧。"},
{"签位":"迢递途中旅 下","签文":"迢递途中旅，云横日随山，羁心无可托，前后总皆难。","解签":"运逢白虎交重，犯之最不祥，谨防盗，贼等灾殃，连遭官刑，丧事，小人恶伤 尤须提防白虎伤人，血光，车关，意外，疾病，缠身性命关。白虎临身主有无妄之灾。 心浮气躁，口舌，争斗，被官欺，牢狱之灾。破财，求人反成伤，进退不得。"},
{"签位":"畔中珠自见 吉","签文":"畔中珠自见，石内玉争光，进财求望吉，有福不成殃。","解签":"蚌开明珠现，石中隐良玉，虽然现时不得志，只要有真才实学，无须忧愁，得时必然开发享亨通，时运将百事周全，可享倍利，欢喜永无忧。 更须勤修福德为善感上苍，天力加添，福源茂盛，加官晋爵，行商得倍利，百祸不成殃。"},
{"签位":"天兵诛贼寇 吉","签文":"天兵诛贼寇，旌旗得胜回，功勋为将帅，门第有光辉。","解签":"最利团队，职场及组织等发展单位，有如天兵相助业绩达成，尤其最利主管人员；主团队战力扩大并提升，一切功勋归主管。 名利双收，只要心诚正直，无私的论功行赏，门第定光辉，声名远播至四方。进财大吉昌。"},
{"签位":"履薄登水池 平","签文":"履薄登水池，危桥得渡时，重重忧险过，春色自芳菲。","解签":"有如牛郎织女渡银河，相对咫尺，却隔天涯，虽终能相聚，却旷日废时。 暗示你的前途，虽然看得见目标，但没有想像中的容易达成目标，切不可以表象观之，而轻忽过程曲折惊险，危机重重。 应该谨慎算计利害得失后，步步为营，才能历险免忧。"},
{"签位":"尘埋青钢钱 下","签文":"尘埋青钢钱，美玉陷淤泥，何时重出世，再得光辉显。","解签":"运逢龙鳌隐堀，龙鳌虽曾威猛无敌，却已伤痕累累，只能隐身深堀以求休养自保。 青钢埋尘，美玉淤陷皆暗示时运已去或时机未至，即使你曾风光一时或拥有一身的才华与抱负，现时却没有舞台可以发挥。 目前只能委身自保，莫图名利，莫问命运，伺良机再图光复。"},
{"签位":"宋太祖黄袍加身 上上","签文":"天开地辟结良缘，日吉时良万事全；若得此签非小可，人行中正帝王宣。","解签":"未雨绸缪。会成功的人，除了本身的努力进取之外，对将来的一切，也早已预先考虑且准备周详。须知每个人的头上都有一片天，成败操之在己。平日稳紮稳打、厚实基础，更不间断地充实自我，为将来预作准备。凡事深谋远虑、从长计画，对於身边亲朋好友的建议，不妨虚心接受。等到时机成熟之时，亦是准备充足之时，自可从容不迫，满载而归。"},
{"签位":"姜太公渭水垂钓 中","签文":"鲸鱼未化守江湖，未许升腾离碧波；异日峥嵘身变态，从教一跃禹门过。","解签":"随遇而安。人的一生高低起伏，难免有不顺遂的时候，若不如意的情况接踵而来，更易叫人灰心丧志。须知事在人为，切勿被一时的失意所打垮。此时烦躁冒失有害无益，切忌沉不住气、冲动妄为。凡事保持心平气和，忍一时风平浪静。纵使遭人讥嘲误解，只要知所当为，又何须耿耿於怀。不要放弃任何希望，凡事乐观，相信自己并坚持到底，必有苦尽甘来、如愿以偿之日。"},
{"签位":"燕将独守聊城","签文":"冲风冒雨去还归，役役劳身似燕儿；衔得泥来成叠后，到头叠坏复成泥。","解签":"勿举棋不定。有些人个性刚直、做事一板一眼，临事却不知变通，往往因而错失良机。须知凡事各有利弊，有舍才有得。事有轻重缓急，与其一昧墨守成规，不如跳脱思维、因地制宜，视情况环境调整自己的塬则与做事方法。或集思广益、共同研拟商议，找出解决之道。切忌犹豫不决又固执己见，流于空想而怯做，终将空心劳力，徒然庸人自扰罢了。"},
{"签位":"长乐老历相五代 中中","签文":"菱花镜破复重圆，女再求夫男再婚；自此门闾重改换，更添福禄与儿孙。","解签":"不改初衷。须知”人生以服务为目的”，无论各行各业，应秉持着服务人群的精神、坚守做事原则，不存一己之私。切忌被外在的因素影响而轻易弃守原本的理念。凡事一片赤诚、以利他为先，即使人事环境不断地交替更迭，也不会因外在的因素而有所动摇。纵使偶有闲言闲语，但自问无愧於心，面对蜚短流长，又何妨一笑置之。流言不攻自破，真理不辩自明。只要抱守初衷，坚持信念，自可处之泰然、乐在其中。"},
{"签位":"燕昭王为郭隗筑黄金台 中平","签文":"一锄掘地要求泉，努力求之得最先；无意俄然遇知己，相逢携手上青天。","解签":"推诚相与。有些人为了打响自己的招牌，不惜砸下重金投资，或认为”外来的和尚会念经”，宁可大量对外延揽人才。却不知许多人才或资源也许近在眼前，却被忽视而浑然不觉。须知要巩固长久的名声不坠，还是必须一步一脚印、从自身做起。无论士农工商，如能以身作则、不耻下问，对自己身边的人谦恭有礼、善待有佳，给予优渥良好的福利，让其无後顾之忧，自然会吸引更优秀更杰出的人才慕名而来。凡事只要稳紮稳打、用心经营，相信无须劳心费力，自然有口皆碑，声名远播。"},
{"签位":"蔺相如完璧归赵 中平","签文":"投身岩下饲於菟，须是还他大丈夫；舍己也应难再得，通行天下此人无。","解签":"智勇兼备。人有时会碰到他人故意刁难，甚至以强欺弱、仗势欺人，让事情更加棘手。在此情境之下，常因忍不下一口气，愤而误事。须知有勇无谋於事无补，与其冲动气愤、闹得两败俱伤，还不如保持冷静，用智慧与理智思考应对之道。故事中蔺相如之所以能完璧归赵，即是因为拥有当机立断的机智，与直言不讳的勇气。凡事除了深思熟虑，也应兼具勇敢果断的胆识，适时言所当言、据理力争，无须畏惧强权，以免错失良机。"},
{"签位":"廉将军思用赵人","签文":"奔波役役重重险，带水拖泥又渡山；更虑他方求别用，千山万水未能还。","解签":"三思而行。一般人常对现状有所不满，或羡慕别人的际遇或地位环境，认为样样都比自己好，因此汲汲向外寻求，期望藉此获得另一片发展。人应珍惜现有的环境与资源，知福、惜福。谨记在做任何决定之前，务必慎重思量、仔细评估本身与环境的优弱势，找出最适合自己的定位与方向。切忌一时冲动负气出走，结果恐不如预期，既无法适应发挥所长，又藕断丝连、怀念原先熟悉的事物，将陷入进退两难、後悔莫及之境。"},
{"签位":"范文公断虀画粥 上上","签文":"岁寒松柏古栽培，雨雪风霜总不摧；异日必当成大用，功名作个栋梁材。","解签":"自强不息。有些人常常虎头蛇尾，短时间的努力不见成效，就打算放弃。然而会成功的人，背後的打拚必定多於常人，辛苦也不足为外人道。范仲淹画粥的故事，最令人感佩的即是他过人的耐力、专注的自制力以及经年累月，从不间断刻苦读书的精神。就如岁寒松柏，在历经雨雪风霜的侵袭後，仍然挺立不摇，坚强地存活下来。因此凡事若定下目标，就应全力以赴。切勿轻言放弃导致功败垂成。只要继续努力、持之以恒，必能先苦後甘，得到丰硕完美的成果。"},
{"签位":"赵韩王半部论语定天下 上上","签文":"劳君问我心中事，此意偏宜说向公；一片灵台明似镜，恰如明月正当空。","解签":"凡事融会贯通。大部分的人都觉得，能够学到的东西越多越好。因此寻求多才多艺，但对单一的技能却尚未领悟其精髓。所谓”术业有专攻”，与其学得杂，不如学得精；一门功夫要练到炉火纯青，绝非短期内可促成。故事中赵韩王之所以能用半部论语定天下，即是因将所学施展到极致之故。因此不论做什麽事、求什麽学问，务必先紮稳根基、穷究其理；掌握诀窍之後，再经由不断地揣摩与练习，才能将所学发挥到淋漓尽致，并能举一反三，转变为本身特有且难以撼动的绝技。"},
{"签位":"秦昭王连城求赵璧","签文":"椟藏无价宝和珍，只管他乡外处寻；好似将灯来觅火，不如安静莫劳心。","解签":"凡事不要强求。人很难感到知足，总是想要更多、想追求的更好，於是千般用计、终日汲汲追求，只为了据为己有，好满足自身的慾望。须知”慾望”乃是无穷止尽的深渊，让人深陷其中而浑然不觉。谨记”知足常乐”，应珍惜现在身边所拥有的事物，淡泊物质名利的渴求。在做任何事之前，先审慎评量自己是否需要。须知”命里有时终须有”，不属於自己的一切，就算强求也是枉然，只是白费心机而已。"},
{"签位":"刘先生入赘东吴 上上","签文":"欲求好事喜非常，争奈姻亲只暂忙；毕竟到头成好事，贵人接引贵人乡。","解签":"凡事处之泰然。人有时会碰到”不得不”的情况，或许是不可抗拒的、或许是强加於己的，却也只能硬着头皮去做，但心中却惴惴不安。所谓”既来之，则安之”。在事情未成定论之时，无须预设太多立场、杞人忧天。持稳身心、处之泰然，把面临的状况当成一种磨练、一种经验，从这个经验中所得到的，不管是有形或无形的收获，绝对是正面的、出乎意料的。另外在抉择不定时，不妨听取身边亲朋好友的意见，有助事情迎刃而解。"},
{"签位":"包胥九顿泣秦庭 上上","签文":"时临否极泰当来，抖擞从君出暗埃；若遇卯寅佳信至，管教立志事和谐。","解签":"百折不挠。有时人在遇到阻碍刁难或被拒绝等不如意的情况发生时，便会心生退惧之意，甚至就此放弃。须知成功并非遥不可及，在努力的过程中，必然会面临各式各样的挑战，考验当事者的决心。故事中申包胥为了求得秦国的援兵，连续七昼夜不眠不休，诚意终於感动秦主愿意出兵增援，让楚国不致灭亡。由此可知，凡事除了必须下定决心之外，还要有坚强的意志力与不屈不挠的毅力。不论过程有多艰难困苦，绝勿轻言放弃，朝着目标持续努力，相信成功之日，已经近在眼前了。"},
{"签位":"信陵君存赵辞封 上上","签文":"自小生身富贵家，眼前万事总奢华；要君赐受金鱼袋，四海传名足可夸。","解签":"施恩不求报。当有人向我们求助时，凡所当为，义不容辞。如果抱着希望对方回报的预期心理，就失去了原本为善的美意。须知”有心的功德不是真功德”。助人的根本意义，在於无心且单纯地去做，解决了问题之後，心里的快乐，绝非外在的有形物质可比拟。切勿期待对方有所表示、或因此窃喜念念不忘。相反地，如果自己受到帮助，即使是小小的恩惠，也要谨记在心、不可或忘，有机会立即加以报答。谨记施比受更有福，为善不足挂齿。"},
{"签位":"管仲三熏三沐见齐桓 大吉","签文":"宛如仙鹤出樊笼，脱却羁縻处处通；南北东西无障碍，任君直上九霄中。","解签":"豁达大度。有时我们会面临到必须和某人相处共事，偏偏此人曾与你结怨、旧恨未消。在此情境之下，如何化解心中的不快与尴尬，才是最难解的课题，考验当事者的智慧。换个角度思考 很多争执误会都是在不得已或无心的情况下发生。所谓”退一步海阔天空”，应该先抛开心中旧有的成见，同时勿预设太多立场，尽释前嫌。凡事以大局为重、就事论事，不计较个人恩怨。放宽心胸、放大格局，只要心中坦然，必可无所覊绊、从心无虑。"},
{"签位":"商君不听赵良言","签文":"触人口气最难吞，忽有灾危祸到门；卵破巢空无宿处，深为稳便把心存。","解签":"勿一意孤行。有些人的个性直接、作风霸气，做事或说话不留情面，常让人因此尴尬愤怒、下不了台。明知有人不满，也毫不在乎。须知举止过於强悍不留余地最易与人结怨，让人怀恨在心。日积月累，得罪的人越多，对自己越是不利。凡事都应谨言慎行、保持柔软低调的身段、兼顾法理情。对於身边亲朋好友的劝谏，务必虚心接受、认真思考不是处并加以改进。切忌当成耳边风我行我素，免得届时陷入无人愿意出手相助、有理说不清之境，後悔也为时已晚。"},
{"签位":"明神宗要活海瑞 中上","签文":"攒眉思虑暂时开，咫尺云开见日来；宛似污泥中片玉，良工一举出尘埃。","解签":"饮水思源。从小到大，我们身边多少会有关心自己的人。诸如父母、师长、朋友...等，或许心直口快直言不讳，但应知忠言逆耳，其用意无非是希望我们行得正、坐得稳，不致产生偏差的行为。应时刻抱持感恩的心，珍惜图报、用心体会。切勿轻视忽略，或视为理所当然、不放在心上。免得忽然有一天，关心的人不见了，离开了，才猛然领悟对方的语重心长而愧叹思念，到时岂不徒然，空留遗憾。"},
{"签位":"李斯遗药杀韩非 中","签文":"莫听闲言与是非，晨昏只好念阿弥；若将妄语为真实，画饼如何疗得饥。","解签":"勿心存歹念。有些人会因为别人的才华或才能高过自己而眼红猜忌、又害怕就此被取代，因此处心积虑，或百般阻挠、或肆放谣言。须知人与人相处，最可贵之处在於互信互助、共同扶持，最忌暗箭伤人、尔虞我诈。凡事应持心正直，起心动念皆向善。从自身做起，不道人长短、不搬弄是非。与人合作共事方面，保持和谐良性切磋，见贤思齐、截长补短。多替他人着想，勿存一己之私。"},
{"签位":"鬼谷子演课 上上","签文":"金乌西坠兔东临，日夜循环恒古今；僧道得之无不利，工商农士各开心。","解签":"勿过於主观。有些人本身通晓事理，加上对人事物观察入微，因此能够掌握先机，猜测事情的发展也往往不出所料。须知本身有一定的自信是必要且可喜的条件，但却不能太过或绝对地主观。过於主观在无形中会渐渐导致个人的自满自傲且无法接受其他不同的意见或批评。当知事情没有绝对，每个人的想法也随时都会改变。因此切忌光凭个人的角度来果断做决定或判断喜恶。仍应保持谦恭谨慎的态度，凡事客观、包容。"},
{"签位":"杨雄仕新为莽大夫 中","签文":"急水滩头放艇时，狂风作浪欲何为；待他浪静风停後，稳载船归过不危。","解签":"勿随波逐流。有些人为了取悦或取信对方，不惜昧着良心，一味巴结。这种矫饰的作为，容易引起他人的反感与不齿，纵使爬上高处，地位也难以稳固。凡事应坚守道德、无愧於心，靠自己努力打拚。虽然无法一步登天，但辛苦耕耘定有所成，且凭自己的实力所表现的成果，必可获得众人的肯定支持，声望不坠且难以撼动。另外，慎选合作对象也很重要。因此不论对方的人品、自我情绪管理、或待人接物方面，都是必须考虑在内的因素。"},
{"签位":"苏武援官典属国 上上","签文":"当春久雨喜初晴，玉兔金乌渐渐明；旧事已成新事遂，看看一跳入蓬瀛。","解签":"坚持到底。本身一定有过人的毅力，与百折不挠的精神。当我们在羡慕别人有一番成就的时候，千万也别忘了其背後所付出的心血与努力。凡事只要下定决心，就应坚持到底，藉由不断的摸索与尝试，从错误与失败中汲取教训、累积经验，日久必能得心应手、游刃有余。因此勿畏难怕苦，须知现在所做的一切，都有可能关系到将来。"},
{"签位":"邵康节定阴阳 上吉","签文":"阴阳道合总由天，女嫁男婚岂偶然；但看龙蛇堪运动，熊罴叶梦喜团圆。","解签":"保持旺盛的好奇心。须知很多事情虽然看似错综复杂，但详加深入了解之後，便会发现其实并没有想像中那麽困难。凡事穷究源头，用心体会、细心观察、深入探讨研究，必能看出其中的奥妙，进而消化吸收之後，转为自己的一套做人处世之道，再推己及人。唯有自己亲身去尝试、体悟出来的道理，才是真正属於自己的智慧。"},
{"签位":"王孝先为民祈祷 上吉","签文":"四郊田亩皆枯竭，久旱俄然三日霖；花果草芽俱润泽，始知一雨值千金。","解签":"常存慈悲心。很多事表面上看来事不关己，其实却串串相连、牵一发而动全身。小从我们周遭的人、事、物，乃扩大至国家、整个地球，都与我们息息相关，是每个人共有的责任。凡事由本身做起，秉着”人饥己饥、人溺己溺”的精神，继而落实在日常生活当中。时刻设身处地为他人着想，处处表达关怀之意。天下没有不可能的事，切勿轻视小看自己个人的力量。只要有心，无事不可成!"},
{"签位":"孙策以玺借袁兵 上平","签文":"欲攀仙桂蟾宫去，岂虑天门不放开；谋望一般音信好，高人自送岭头来。","解签":"施比受有福。在人与人的交往中，应主动而真诚的关心他人、了解他人的需要，在自己的能力范围之内，尽力帮忙协助、不求回报。所谓”助人为快乐之本”，成就别人，也就是成就自己。对於本身所拥有的事物，不须看得太重，应能懂得取舍，不要吝於付出。无须害怕失去，应知有舍才有得。精神上的快乐充盈，绝对大於物质上的享受。"},
{"签位":"文种不听范少伯","签文":"不成邻里不成家，水泡痴人似落花；芳问君恩难得力，到头毕竟事如麻。","解签":"须知忠言必逆耳。看事情的角度不能光凭表面，必须多用点心，观察入微、从里到外，仔细分析评估求证。不要先入为主就认定一件事必定是如此。须知事事无绝对，很多事都有意外。对於他人的善意提醒与规劝，尤其在亲朋好友方面，应思考必定有其道理，要能谦虚接受、谨记在心。切勿亳不在乎地当成耳边风，免得吃亏在眼前，後悔莫及。"},
{"签位":"伍子胥过昭关 上中","签文":"过了忧危第几重，从今再历永无凶；宽心自有宽心计，得遇高人护圣功。","解签":"勿自乱阵脚。遇事焦急於事无补，只会让自己更加慌乱、不知所以。应能保持镇静，仔细地思考应对之道。不管做任何决定，都必须以「理智」、「冷静」为前提考量。在自己本身方面，坚守”施恩不求报、予人不追悔”的道理。然而面对他人的协助，则要铭记在心不可或忘。不论是替你解决了实际上的困难、或帮你解开心中疑惑的人，都应该要充满感激，有机会便加以报答。"},
{"签位":"桓温得殷浩书 平","签文":"上下传来事总虚，天边接得一封书；书中许我功名事，直待终时亦是无。","解签":"凡事洞察真相。人与人相处，很容易因为对方的无心之过而造成彼此间的嫌隙。须知在事情尚未明朗之前，不应道听涂说、人云亦云，或就此否定他人。眼见不一定为凭，耳朵听到的是非也不见得是真。应保持内心的清明理智，实事求是。切忌只看表面就果断做下决定，否则很容易引起不必要的纠纷。若与人有误会，何妨自己先退一步，解释清楚、尽释前嫌。所谓”十年修得同船渡”，应当把握人与人之间相处的缘份，互相珍惜。"},
{"签位":"李邺侯白衣宰相 中中","签文":"一谋一用一番机，虑後疑前不敢为；时至自然逢贵助，银墙铁壁好安居。","解签":"凡事自食其力。有时人会想依附有权有势的对象，并希望”靠山”越稳越好，认为如此便可高枕无忧。但任何事绝无侥幸。故事中，李邺侯之所以坚辞所有的官职与厚禄，即是因为他心中雪亮，知道”伴君如伴虎”、树大易招风、更不愿被名与利束缚。因此不要妄想一步登天，须知”靠山山倒、靠人人倒”的道理。凡事脚踏实地，靠自己的实力来打拚。在与人合作方面，也应知见好就收，切莫贪图过多的利益，免得沉溺其中、无法收拾。"},
{"签位":"孟尝君鸡鸣度关 上上","签文":"东方月上正婵娟，顷刻云遮月半边；莫道圆时还又缺，须教缺处复重圆。","解签":"凡事以礼相待。这个社会上有各式各样的人，生活在我们周遭，有些熟悉、有些陌生。但是，即使是几乎天天见面的同学或同事，也不代表我们就能够完全了解彼此的全部。也许你自以为熟悉的对方，也仅仅只是工作上的那一小部分。也许他们各有所长，只是没有表露出来。在待人处世上，应能不分贵贱、职位高低，以礼相待。勿起分别心，凡事一视同仁。现在你身边的任何一个人，日後都有可能成为你的贵人。"},
{"签位":"百里奚食牛入相 大吉","签文":"宝剑光芒出匣时，匣中应不被尘欺；贵人亲手提携起，尽可防身更勿疑。","解签":"专精技能。百里奚在成为”宰相”一职之前，之所以能够维生，是因为他除了学识渊博之外，还有另一项技能 饲养牲畜。因此除了本身的工作之外，不妨寻求、培养自己的第二专长。先从自己有兴趣的方面着手，不仅让生活加添乐趣，也由於是自己的喜好，更能乐在其中。或听取亲朋好友的意见，参与其它的活动。不论本身是否在行，但只要努力尝试、尽力去做，相信日久也会熟能生巧，变成自己的第二项、甚至更多项技能，不但更有保障，生活也有了更多重心。"},
{"签位":"楚怀主入秦武关","签文":"劝君切莫向他求，似鹤飞来暗箭投；若去采薪蛇伏草，恐遭毒手也堪忧。","解签":"应有自主的判断能力。人在犹豫不决的时候，容易降低自信，所以会转而徵询他人的意见，而且希望能回答的建言越多越好。须知在遇到状况不明之时，越要保持沉着冷静。思前想後，理智地分析情势。若恐有遗漏不全之处，向他人请教虽然也是个办法，但多数人的意见，有时并不代表一定是对的。而且询问的人越多，又恐得到的答案越分歧，反而导致无所适从。对自己要有信心，不要轻易随波逐流。"},
{"签位":"达摩面壁","签文":"清闲无事静处坐，饥时吃饭困时卧；放下身心不用忙，必定不遭殃与祸。","解签":"不要随便乱想。须知人可以有理想，但却不能有妄想。理想是实际的，已经拟好了一个方向、并想办法努力去实现。妄想则是随便的、不切实际的空想。未来的事还很难说，那何必去想”如果”?过去的事也已经过去，又何必再执着?凭空想像的事物不可能实现，如果执着於不切实际的幻想，只会让自己越陷越深、无法自拔。天下没有不劳而获的事，凡事脚踏实地，一分耕耘，才有一分收获。"},
{"签位":"常何荐马周","签文":"渺渺前途事可疑，石中藏玉有谁知；一朝良匠分明剖，始觉其中碧玉奇。","解签":"凡事勿太依赖。属於自己本身份内的事，就不应麻烦别人，或乾脆丢给别人去做。应能训练自己独当一面，尽量靠自己来解决问题。如果总是希望别人来帮忙，对於本身非但无所成长，得到的收获也不是属於自己的。唯有透过亲身对事物的体验与尝试，才能有办法真正去了解其中所蕴藏的奥妙之处。选择勇敢去面对，将会发现事情其实没有想像中那麽困难。"},
{"签位":"鲍叔进管仲 中中","签文":"石藏美玉在中心，得指何须向外寻；直待高人来剖析，恰如灵雨涤烦襟。","解签":"凡事不计前嫌。人与人相处，偶尔争吵与不快在所难免。但事过境迁之後，就无须仍耿耿於怀、记挂在心。应能不计前嫌，抛开自己心中的成见，就事论事、公私分明。对於他人的缺失，尽量包容体谅。凡事宽容以对，心胸将更为开阔。"},
{"签位":"文中子上太平策 上上","签文":"出入行藏礼义恭，言必忠良听必聪；心下了然俱洞彻，光明如日正当空。","解签":"勿太过主观。有时人对於本身善意的想法与主张，往往非常坚持，认为只有如此才是对的。须知出发点是好意诚然可嘉，但”择善”也不能太过固执。每个人对事情的看法与解读都不一样，只要目的都是善意，可以有很多种方法，不一定非得这麽做。在坚持自己理念的同时，也应虚心接受、包容学习不同的做法与意见。过於偏执只会造成自我的局限与他人的反感。所谓”信者恒信”，凡事随缘，不必强求自寻烦恼。"},
{"签位":"刘关张古城相会 上上","签文":"衣冠重整旧宿风，道是无功却有功；扫却当途荆棘碍，三人共议事相同。","解签":"不要轻易变心弃节。有些人的耳根子软，很容易因为他人的言语而受到影响，或因眼前的美好事物而受到动摇。若遇情况不明时，要能把持内心，冷静而理智的思考，才不致於随波逐流、左右摇摆无所适从。常常回想当初的患难之情，莫忘旧情。多增进亲朋好友彼此间的互动、关怀，才能凝聚坚强的向心力。认清什麽才是自己想要的，时刻提醒自己念念不忘。"},
{"签位":"刘先主进葭萠关 上上","签文":"目前病讼不须忧，实地资财尽可求；恰好系猿今脱锁，得归仙洞去来游。","解签":"小心行事。人在得到帮助、好运连连或机会来临之时，往往喜不自胜、乐不可支。须知纵然目前看似稳操胜算，有势在必行之意，但切勿过於开怀狂喜，仍应时刻自我警惕”物满则溢、乐极生悲”的道理。冷静下来，仔细审慎地思考接下来该怎麽做。在此同时，别忘了兼顾到别人，更不要忽略了他人的感受。应尽量保持平常心，切勿急躁，放慢脚步、顺势而为。"},
{"签位":"管公明避隐辽东 平平","签文":"欲问身安运泰时，风中灯烛不相宜；争如收拾深堂坐，庶免光摇静处期。","解签":"勿太独善其身。有些人不喜欢涉入是非，也不贪图它物，更不愿与人高攀，因此本身信誉极佳。须知本身洁身自爱又能自律是一件好事，但遇到需要帮忙或协助的情况时，也不能完全置之不理。凡事”不沾锅”的处世态度，虽然可以远离许多是非纠葛和省掉许多麻烦，但却会让人觉得过於自命清高、只顾自己不管别人，似乎有点太偏於自私。行事勿独来独往，应多与人结交相处，能帮得上忙的就尽力而为，如果有人需要忠肯的建议，也不要吝开金口。在顾好自己的同时，请别忘了兼善天下。"},
{"签位":"淮阴侯背楚归汉 中平","签文":"镜月当空出匣时，刹那云雾暗迷离；宽心守待浮云散，更改相宜可望为。","解签":"小不忍则乱大谋。”忍耐”的含意很广，范围包罗万象，不单只是表面上的形容。”忍耐”是积极的、勇敢的、坚强的、乐观的、真心的。举历史故事的例子来说 『刘琨闻鸡起舞』，是积极的忍耐。『宰相萧何追韩信』，是勇敢的忍耐。『程婴忍辱匿孤』，是坚强的忍耐。『诸葛亮隐居卧龙冈』，是乐观的忍耐。『郭子仪免胄见回纥』，是真心的忍耐。"},
{"签位":"曹操遣襧衡投黄祖","签文":"天边消息应难问，切莫私心强望求；若把石头磨作镜，精神枉费一时休。","解签":"勿存心不良。有些人一旦受到不留情的指责或羞辱，就会觉得难以忍受、恼羞成怒。为了达到报复的目的，甚至想利用不相干的人。须知在愤怒当头时，很容易失去理智，产生不好的念头，做出失当的行为。当思”说者无心”，宽容原谅。有些话听过就算了，实在不必因此而耿耿於怀、把自己气得半死，更不应怀恨在心、挟怨报复。另外，自己本身的事，切勿牵连到不相干的人身上。所谓”己所不欲，勿施於人”。"},
{"签位":"马援女为皇后 平中","签文":"红轮西坠兔东升，阴长阳消是两形；若是女人占此卦，增添福禄称心情。","解签":"不论男女，都应知礼法、尽孝道。孔子说 ”非礼勿视、非礼勿言、非礼勿听、非礼勿动。”人必须约束自己的行为举止，凡事都不应越矩。现今电视节目、电影、网路、书籍等，会污染身心产生妄想邪念的，不应看。不道人之短，不说己之长，不过问别人的隐私。别人在说八卦、私事，不关自己的事，避得远远的，不听。不做违反道德良心的事。凡事真诚、尊重、为他人着想，即是知礼。尽孝道是做人的根本，莫忘父母生养之恩，凡事勿让父母操心，时刻挂念、问候关心，而不只是在金钱上的供养。守礼尽孝是道德的根本，不会因为时代变迁而有所改变。"},
{"签位":"董卓郿坞藏金","签文":"无限好事君须记，恰如认贼作为子；莫贪眼下有些甜，可虑他时还受苦。","解签":"凡事要懂得节制。对於目前所拥有的，应知好好珍惜、谨慎运用。牢牢把持身心，勿让慾望无止尽的扩大。当知满足现状，切忌还想要更多更多。行事勿过於骄纵奢华，勿沈迷於酒色财气之中。否则纵有金山银山，转眼也会成空。不要妄想把全部的东西都想要占为己有。不属於自己的物事，不必强求。"},
{"签位":"温公入相除新法 上","签文":"君垂恩泽润无边，覆祷祈禳没党偏；一切有情皆受用，均沾乐利得周全。","解签":"凡事不要太固执。须知出於善意的做法没有什麽不好，但要能审时度势，视情况来推动。勿立刻急於改变现状，而忽略了旧有的行为模式。对於旧有的模式，应仔细评估衡量，去芜存菁、再加上自己的新理念，或可让事情更臻完满。自己的想法固然没错，仍然可以听听别人的意见，对於旁人恳切的建言，要能虚心接受，慎重思考。切忌带着个人的偏见、只为了反对而反对。"},
{"签位":"泗水亭长作天子 大吉","签文":"天地交泰万物新，自形自色自怡神；森罗万象皆精彩，事事和谐得称人。","解签":"不要太吹毛求疵。有些人除了对自己很严格、对别人也很挑剔，凡事都要求十全十美，尤其重视细节。须知对於自己本身，过度要求完美，反而会放不开、形成一种无形的精神压力。而在待人处世上，更应有容人的雅量。所谓”人非圣贤，孰能无过?”。每个人都有个性上的小小缺失，但只要不影响大局，又何必在意?不要刻意挑三捡四，硬把自己的想法与要求加诸在别人身上，否则容易导致旁人无法忍受。成大事者只放眼大处，不拘泥细节。"},
{"签位":"周郎赤壁败曹兵 中中","签文":"棋逢敌手要藏机，黑白盘中未决时；到底欲知谁胜负，须教先着相机宜。","解签":"谋定而後动。在面对事情时，不论大小，要能从里到外、仔细地分析判断。保持清明的理智与思路，冷静而缜密地假设任何可能发生的状况，模拟并想出因应之道。眼观四面、耳听八方，着眼大处时，也要兼顾细节。另外，在情况不佳而本身又处於较不利的弱势时，如果想硬碰硬，无异以卵击石，绝对没有好处。不妨请教志同道合的人，共同商议。藉着众人集思广益所想出的办法，也较能万无一失。大家有志一同、互相砥砺，相信定能扭转颓势、迎向成功之路。"},
{"签位":"张良受书圯上老人 上上","签文":"温柔自是胜强刚，积善于门大吉昌；若是有人占此卦，宛如止渴遇琼浆。","解签":"凡事要禁得起考验。在人生中有一道一道的关卡，会遭遇到很多种情况，都是为了让我们能增长智慧、磨练心性。其中，当然也要学习忍耐。所谓”玉不琢、不成器”，越是可造之才，碰到的挫折与屈辱也会越多。乐观地换个角度想，很多事都只是一种过程，而你比别人多了更多的机会去体验，未尝不是好事。现在你极痛恨的人，说不定日後却是你最感激的人呢。有句话说 ”不合理的要求是磨练”。凡事若能忍一时，将来必定受用无穷。"},
{"签位":"赵韩王为村学究 上平","签文":"劝君耐守旧生涯，把定身心莫听邪；直待有人轻着力，满园枯木再开花。","解签":"人贵自立。很多成功且耳熟能详的人，在尚未成名之前，都只是个平凡而普通的小百姓。他们甚至没有料想到自己会成功。所以不必因为默默无名、或人微言轻而感到沮丧或自卑。毋须羡慕别人，应当知福惜福，坦然乐观地看待现状。每个人的价值观与人生观都不同，不要被别人的言语影响而导致心中摇摆不定。只要固守本分、一心向善，事情不论大小，只要是对的，就尽力去配合，努力把它做好。凡事尽心自律、无愧於心，必有机缘到时、一显身手之日。"},
{"签位":"高远夫五十得名 上上","签文":"锦上添花色更鲜，运来禄马喜双全；时人莫讶功名晚，一举登科四海传。","解签":"凡事力图振作。人最怕光说不练、或立定志向後，又轻易退缩、不能坚持到底。须知任何事只要有决心，就无须担忧起步太晚、或觉得不可能、更不要想”放弃”的念头。时时刻刻自我砥砺，朝着目标努力、再努力。所谓”天下无难事，只怕有心人”。切勿半途而废，只要抱着希望、努力不懈地持之以恒，如此成功之日，想必也不远了。"},
{"签位":"班超万里封侯 大吉","签文":"鵾鸟秋光化作鹏，翱翔得意尽飞腾；直冲万里云霄外，任是诸禽总不能。","解签":"智勇兼俱。有些人够勇敢，但不够细心。有些人够细心，却又不够勇敢。那麽要如何”有勇有谋”呢?其实平日若能深入细心地观察周遭，就能发现人事物之中细微巧妙的变化，也可以早一步掌握先机、提前准备行动。凡事仔细用心思考，判断事情的轻重缓急。一旦下了决定之後，就不要再犹豫不决，试着勇敢放手一搏。如果因迟疑再三而畏畏缩缩、导致错失良机，岂不叫人徒呼可惜。"},
{"签位":"太子丹尊事荆轲","签文":"营图万事若冰澌，何必悭贪苦所为；只好静心闲处坐，待他兴变复奚疑。","解签":"莫心怀不轨。有些人表面上对别人很好，但其实心里满是害人的念头，只是隐藏的很好，看不出来而已。须知此举也许可以骗得过旁人，但终究骗不了自己。表里不一的人是很痛苦的，有时说了谎，却又怕被揭穿，於是再说一个谎。如此恶性循环，提心吊胆。但是内心交战，知道是”明知不可为而为之”。这种良知的谴责，岂不是自我折磨、苦不堪言?所谓”害人之心不可有”。凡事要能行得正、坐得稳，勿存妄想邪念，免得害人又害己。"},
{"签位":"三宝太监下西洋 大吉","签文":"五湖四海尽行船，高挂风帆把舵坚；幸得顺风随所至，满船宝贝称心田。","解签":"互助互动。即使本身事情再多、再忙，也不能忽略了与周遭旁人跟亲朋好友间的联系交流。透过本身发自於内心的真挚恳切，旁人必能感受到善意与温暖。这种内心的真实感受，胜过外在的一切有形物质。凡事由本身做起，藉由诚恳的表达与关心，自己与他人之间，在无形中也递增了互信互助的情谊，因此而更加团结、更加和谐。"},
{"签位":"诸葛公隆中高卧 上平","签文":"夏日初临日正长，人皆愁恼热非常；天公也解诸人意，故遣薰风特送凉。","解签":"知己知彼。如果能够有自知之明，在面对问题的时候，不会选择逃避，也不会冒然有所行动。仔细分析自己的优势与弱势，就能找出适合自己的志向、又能发挥所长之处。知道该怎麽努力才能成功；面对挫折与失败，也会勇於承认接受、彻底的自我检讨改进。先知己後才能知彼，再谨慎地审时度势，必能如鱼得水，前景可期。"},
{"签位":"李太白醉中捉月","签文":"水中捉月费工夫，费尽功夫却又无；莫信闲言并浪论，枉抛心力也难图。","解签":"眼见不一定为凭。须知社会上很多种现象都是真真假假、假假真真。有时眼里看到的、耳里听见的，都可能只是表面，甚或是一种假象。是、非、真、假，唯有靠智慧来判断。在做任何事之前，一定要经过仔细的思考与再三的求证。莫被一时的假象所迷惑，也不要立刻就信以为真、冒失行动，结果恐导致白忙一场，只是徒劳心力而已。"},
{"签位":"王景略扪虱谈兵 上上","签文":"失意翻成得意时，龙吟虎啸两相宜；青云有路终须到，许我功名必可期。","解签":"凡事适度地拿捏分寸。有时人往往太在意别人对自己的看法，所以刻意保持身段，却因此放不开，说话做事也相对地被局限。有时人却因为太过随性，反而变成我行我素，又会让人觉得放肆且不知礼法。其实该严肃时就要严肃，不要仍然嘻皮笑脸、东张西望，会让人觉得举止轻浮、三心二意。该放松时就要放松，不要一昧墨守成规、过於拘谨，又会让人觉得难以相处、不知变通。应视情况场合，调整本身的行为举止。说该说的话，做该做的事。"},
{"签位":"吕仙枕黄梁未熟","签文":"梦中得宝醒来无，应说巫山只是虚；苦问婚姻并病讼，别寻生路得相宜。","解签":"勿痴心妄想。人常感叹自己时运不济，又冀求功名富贵，希望一切应有尽有，好满足自身的慾望。因此常常幻想，日日做着发财梦、升迁梦，渴望有朝一日真能实现。疏不知人生如梦、得失无常，富贵荣华也只是一时的虚幻，转眼便成过眼云烟。奉劝当事人，与其空无的痴心幻想，还不如脚踏实地、诚恳务实的做好自己的本份。好运不会凭空而来，凡事有付出才有收获，知足即是福。"},
{"签位":"郭暧尚公主 大吉","签文":"相传罔替子孙贤，衣禄丰盈富在天；金马玉堂人快乐，饥时吃饭困时眠。","解签":"遇事不宜意气用事。有时人与人之间难免意见不合而发生争执口角。须知冲动於事无补，无论对方是否有错在先，但如果因此而忍不下一口气、非要争个理出来，却可能导致撕破脸不相往来、见面又尴尬的局面，甚至拖累到不相干的人替你收拾残局。这都是因为欠缺理智且没有顾虑到後果所造成的影响。俗云 ”冤家宜解不宜结”。与其吵得面红耳赤闹得不可开交，还不如冷静下来，想个好方法，既不会伤害到对方，又可以避免让事情重蹈覆辙。心平气和解决问题，而非制造问题。"},
{"签位":"范少伯泛舟五湖 中平","签文":"涧小石粗流水响，力劳撑驾恐损伤；路须指出前江去，风静潮平尽不妨。","解签":"凡事见好就收。任何事情在成功之前，都会经过努力的打拚、付出大量的心血，才能得到丰硕的成果。但在任务完成、功成名就之後，如何”见好就收”，才是最困难的考验。须知万事万物都没有一定的准则，既无法预料，也无从掌控。事情来了，就去面对，尽力去做，做完了，就要放下。凡事不要留存太多的眷恋，太多的眷恋只会让人更加执着，形成沉重的包袱丢不下。不要画地自限，适时地跳出束缚，才能随心所欲。凡事随缘，无须强求。"},
{"签位":"甯戚饭牛叩角 上中","签文":"闻是闻非风过耳，好衣好禄日当空；君须记取他年事，汝意还同我意同。","解签":"积极表现。有些人很懂得如何随机应变，有时连身边看似不起眼的物事，都可以适时拿来运用，成功地为自己加分不少。须知很多机会往往稍纵即逝，要能够把握契机。即使看似希望渺茫，但仍值得一试，说不定就此一举成功。在自己本身方面，凡事勿预设太多立场，不要太悲观，所谓”因地制宜”，配合环境、人事，适度地调整做人处世的态度。应勇於尝试，不要太固执而一成不变。"},
{"签位":"罗隐归咎越王 中中","签文":"忠言善言君须记，莫向他方求别艺；劝君安守旧生涯，除却有余都不是。","解签":"勿恃才傲物。有些人因为本身才气纵横而自视甚高，因此目空一切，对於身边的人事物，也常看不上眼，甚至语多讥讽、一派自以为是，非不得已，决不向他人求教。须知过於刚硬的个性会带给别人不悦的感受而容易导致处处碰壁，如果能够正视并收敛此种狂放自傲的个性，凡事虚心下问，加上本身的才华与能力，相信成就一定不只於此。对於身边亲朋好友的劝告，务必听进心里去，想一想别人为什麽这麽说。"},
{"签位":"李德裕贬崖州 中平","签文":"直上高楼去避身，四边绕处是荆棘；谁知造物安排定，得意番成失意人。","解签":"喜恶勿过於分明。我们有时会对某些人觉得反感，不管对方说什麽做什麽，就是看不顺眼，非常排斥。甚至双方互不相让，情势也越陷越僵。其实同样的人、事、物，在你看来或许不好，但若换在其他人眼中，却变成是好的。须知”好”与”坏”很难论定，甚至没有一定的准则。但人都是用自己心里的一套标准来评断，而每个人又有不同的想法，所以看出来的事情就有了好、坏、对、错的分别。如果能少点主观、多点客观，好恶心就不会那麽重，也比较不会太固执。另外，凡事不要替人强出头，做好自己的本份，修身养性。"},
{"签位":"先主连营","签文":"抱薪救火火增烟，烧却三千及大千；若问营谋并出入，不如收拾莫忧燃。","解签":"尽量平心静气。须知过度的情绪反应，会让人失去对事物应有的基本分析能力。也因为无法保持冷静，在此时做出的判断往往失策而且导致不可收拾的局面。如遇有大喜大悲大怒之事，不要急着做出反应，先试着把自己冷静下来，让情绪归於平稳。心平气和之後才能专心思考，谨慎反覆过滤求证之後，才能做出正确理智的判断。凡事勿冲动躁进，小心行事，免得乐极生悲，後悔莫及。"},
{"签位":"厮养卒走燕取归赵王 大吉","签文":"日上吟诗月下歌，逢场作戏笑呵呵；相逢会处难藏隐，喝采齐声嗹哩罗。","解签":"要有自信。很多人常不甘安於现状，觉得自己地位太低、人微言轻，因此无不想力争上游，爬得越高越好。但俗云 ”三百六十行，行行出状元”。职位高低代表的只不过是一时的虚名，不一定非要苦苦追求。这个社会需要各式各样的人，人人各司其职，才能保持平衡。应以自己的工作为荣，知福、惜福，安居乐业。切勿好高骛远，岂不知慾望少一点，快乐就更多一点?另外，切勿轻视小看地位卑微的人，也许其中卧虎藏龙个个身怀绝技，只不过自己有眼不识泰山罢了!"},
{"签位":"吕蒙正破窑守困 中中","签文":"晨昏全赖佛扶持，虽是逢危不见危；若得贵人来接引，此时福禄自相随。","解签":"勿灰心丧志。莫听他人闲言是非，有时面对别人的调侃相欺，不妨忍一时，无须放在心上。此刻莫要急躁，专注在修养品德之上，保持良好的处世态度，继续努力、并不间断地充实自我本身的学识。俗谚云 ”不经一番寒彻骨，焉得梅花扑鼻香?”相信自己、存善持之以恒，必有大成之日。另外，对於亲朋好友的关怀协助，应要谨记在心，有机会便加以报答。"},
{"签位":"黄孝子万里寻亲","签文":"昔日行船失了针，今朝依旧海中寻；若还寻得原针在，也费工夫也费心。","解签":"勿轻言退缩。须知在下任何决定之前，一定要经过审慎而思密的考量。尤其当一切都是未知数时，原本就备加困难，本身是否合适、能否发挥，都是必须再三向自我求证的考虑因素。下定决心去做之後，就不要因为过程中必然遭遇的阻碍或不顺遂而心灰意冷，甚至想乾脆走回头路。凡事不要轻言放弃，免得最後落得两头皆空，不仅劳心费力，更蹉跎了岁月，实在得不偿失。"},
{"签位":"石崇被害","签文":"譬若金鳞放碧漪，暗遭罗网四边围；思量无计翻身出，命到泉关苦独悲。","解签":"勿心直口快。本身的自我情绪管理很重要，切忌在发怒或不顺意时就口出恶言。须知人在心情不稳定时脱口而出的话杀伤力都很重，在当下极容易触怒或伤害到他人，让人怀恨在心而不自知。这种言语上的过失，恐怕事过境迁也难以弥补。另外平常行事勿过於招摇，在物慾上应知有所节制，避免处处与人逞强比较。凡事谨慎谦虚待人，方可远灾避祸。"},
{"签位":"越王句践栖会稽山","签文":"眼前欢喜未为欢，危不危兮安不安；割肉成疮因甚事，不如守旧得安全。","解签":"不要太固执。人很主观，有时心里已经有主意的事，虽然可能还是会找大家商议，但纵使多半的人持反对或劝阻之意，却依然我行我素、执意照自己的意思去做，结果往往不如预期，甚至导致一败涂地。须知很多时候我们对事情的看法不见得都能面面俱到，多少会有遗漏或误判之处。因此对於旁人的善意提醒或规劝，应有雅量去接受，虚心检讨并加以改正。所谓”人非圣贤，熟能无过?”就算已经犯下了过失，但只要勇於认错，相信大家仍然会接纳、帮助你，让事情不致於到无法收拾的地步。"},
{"签位":"楚霸王阴陵失道","签文":"路险马行人去远，失群羊困虎相当；危滩船过风翻浪，春暮花残天降霜。","解签":"勿心慌着急。人在遇到难题的时候，常会因不知如何是好，所以往往转而向旁人求助，希望藉由对方的建议，能让事情有所帮助。其实自己本身的问题，应该是自己最了解。不妨冷静下来，仔细思考，将事情层层抽丝剥茧、一一厘清之後，也许就能找出症结所在。若实在是想不出办法、非要向他人求助时，也不要随便拉个人就猛吐苦水，应慎选欲请教的对象。有些人可能听完还没消化，就主观的高谈阔论，不但对事情没有帮助，恐还因此被他人的你一言、我一语误导了方向，更加混乱。应请教客观中肯、又能从中指出关键处的对象，才有助於厘清问题，帮忙你解决困难。"},
{"签位":"管仲相齐 上上","签文":"一条金秤等君情，无减无增无重轻；为是平生心正直，文章不识义皆明。","解签":"适度地投其所好。一个人本身如果存心正直、知礼守法，已属难能可贵。但除了本身的品德之外，如何兼顾人情，也是必须注意的因素。在与人相处时，如果能够多花一点时间，用心倾听对方的感受，不但能让对方觉得有”被重视”的感觉，更可因此知道对方的喜恶，帮得上忙的地方就尽力协助，而对方的禁忌，也可以避免误触。这种处世哲学，跟佛经上所说的”悉令满足诸需求”有异曲同工之妙。人都是互相的，当你替对方解决了问题、让对方心无烦忧之後，对方也会反过来想帮助你。这时再提出自己的看法与做为，相信一定能获得多数人的支持与认同，让事情更圆满。所谓”带人要带心”，也是这个道理。"},
{"签位":"李吉甫三代为相 上上","签文":"门庭清吉梦祯祥，积善于门大吉昌；讼理婚成蚕又熟，病逢良药得安康。","解签":"保持良好的典范。一个人的思想行为，很容易在不自觉中受到别人的影响。因此为人父母师长者，在教导晚辈子女时，应以身作则，举手投足间，都会是对方模仿学习的对象，意义重大、影响深远。在自我本身方面，维持良好的品性道德，勿以恶小而为之，勿以善小而不为。学习他人的长处，若见别人的缺失，也要警惕自己勿犯相同之过。本身有益的经验，不妨试着传承下去，让青山常在、绿水长流。"},
{"签位":"程婴匿孤存赵 中上","签文":"冬来岭上一枝梅，叶落枯枝总不摧；探得阳春消息近，依然还我作花魁。","解签":"不要太悲观。人在时不我予时心态本就消极，如果还为他人所误解，更如哑巴吃黄莲，苦不堪言。在此看看程婴匿孤存赵的故事，他不但忍辱负重十数年，甚至默默承受不义之丑名，只为了不让忠臣绝後。如此精神情操，今世几人有之?反观自己，不过一时的不顺遂，何苦因此自怨自艾，只要存心正直，凡事无愧於天地，相信必有时来运转、还你清白之日。"},
{"签位":"诸葛与关公说亲","签文":"朝朝役役恰如蜂，飞来飞去西复东；春暮花残无觅处，此身不恋旧丛中。","解签":"勿一厢情愿。在与人沟通时，切忌心直口快、口不择言。与其直接，不如在说话之前，思量再三，婉转有礼的表达其意。如果一开口就让对方觉得不舒服，事情岂不是已经失败了一半，要再补救，可能备加困难。须知本身热心是善，但在听取他人言论之时，不应全部信以为真，宜用智慧来判断真假、才能明辨是非。不要自作聪明，认为”事情就是如此”，否则恐遭他人利用，奔波劳碌，还得罪了不相干的人，结果却是白忙一场。凡事勿先入为主，免得乐极生悲。"},
{"签位":"貂蝉从王司徒计 上上","签文":"谁知爱宠遇强徒，女子当年嫁二夫；自是一弓施两箭，骑龙跨虎上安居。","解签":"团结力量大。人往往为了理想努力去实现，但同时也要兼顾现实面、而不得不蜡烛两头烧，既无人能了解，还可能被误解。在此情境之下，心里会觉得非常疲惫。须知有远大的理想与目标并愿意去实行是很了不起的一件事。既然想去做了，抱定的这股坚持与冲劲，当然要持续下去。但所谓”三个臭皮匠，胜过一个诸葛亮”。有时与其自己单打独斗，还不如集思广益、汇聚众人的力量，来共同完成一件事。这个人如果做不到的地方，那个人也能立即过来补足。大家有志一同、齐心协力，相信必能让事情推动得更加顺利。"},
{"签位":"刘智远打磨房 中吉","签文":"弄蜂须要求他蜜，犹恐遭他尾上针；虽是眼前有异路，暗里深藏荆棘林。","解签":"凡事忍耐则吉。我们常常有”人在屋檐下”之叹，总觉得抱负无法伸张、或不得不为某些情况折腰。但所谓”山不转路转，路不转人转”，其实很多时候只要换个角度、逆向思考，心境就能改变。在现实环境受限、不允许大幅度改变时，不妨忍一时，勿在此刻做下任何草率冲动的决定。保持乐观轻松的心情，而不是轻易地被环境或人事所影响。坚守岗位、做好份内之事，相信必有时来运转之日。"},
{"签位":"萧何月下追韩信 上上","签文":"春雷震起蛰中虫，脱却尘凡出旧墉；忽遇风云交际处，自然变化得成龙。","解签":"要沈得住气。韩愈《马说》内言道 ”世有伯乐，然後有千里马。千里马常有，而伯乐不常有。”千里马可遇而不可求，如何”遇”?在上位者，应有过人之见，细心深入地观察周遭的人，多花点时间倾听基层的声音。不以外表、学历等外在考量来评断限制一个人，用人唯才。也许千里马就在身边，却被自己忽略了呢。在基层者，也不要因为没遇到”伯乐”而丧志，仍应保持良好的工作能力与态度。只要自己不先放弃自己，相信一定能遇到赏识重用的人，让你大展所长。"},
{"签位":"韩非入秦被害","签文":"慵飞野鹤自投笼，欲举鹏霄落陷中；南北东西浑障碍，此身憔悴恨无穷。","解签":"思虑要周详。人有自信、有才干是一件好事，但过度的锋芒与自信，只会让自己更成为别人眼中的标靶，欲除之而後快。若欲转换新环境，也不要急着表现或夸耀自己的能力，须知”同行相忌”，尤其是与他人有直接利害关系时，如果本身能力明显胜过对方，更易招人眼红，甚至被人在暗地里落井下石，蒙受不白之冤。宁可小心内敛，处处谦让；保持柔软的身段，凡事低调谨慎。更要慎选合作对象，免得水火不容，陷入进退两难之境。"},
{"签位":"伍子胥中流得兰桨 中","签文":"宛如抱虎过山前，战战兢兢胆碎寒；幸得山前逢妙手，方能保得一身安。","解签":"凡事都应先做好计画。所谓”养兵千日、用在一时”。只有平日做足了准备，才不会惊慌失措、临时抱佛脚。遇有紧急状况时，要保持冷静，千万不要轻举妄动、自乱阵脚。如果本身参与了一件涉及机密的重要任务，则应守口如瓶，谨防一时大意而泄漏口风。另外，本身行为端正，心存善念以诚待人，如此相信纵使遇到再大的困难，也一定会有人愿意伸出援手，帮助你共同度过难关。"},
{"签位":"孙叔敖隐处海滨 上上","签文":"鱼龙混杂意和同，耐守寒潭未济中；不觉一朝头角耸，禹门一跳到天宫。","解签":"多多将心比心。社会上大部分的人，都是以自我为中心，很少能真正地顾及到旁人的感受。然而每个人不论贫富、地位高低，内心都想寻求一种快乐而不是痛苦的感觉。如果我们能有这种仁慈的、将心比心的观念，那麽当我们在看待别人的时候，自然而然会产生一个”同理心”，了解”己所不欲、勿施於人”的道理，再进而推己及人。凡事只问耕耘、不问收获，自己能够做得到的，一定自己先去做。"},
{"签位":"范睢相秦","签文":"梦中说梦获多财，身外浮名总莫猜；水远山遥难信定，贵人一指笑颜开。","解签":"勿心怀不轨。言语是一门艺术，也是一项工具，可以用来杀人，也可以用来救人。有人可能天生伶牙俐齿，能够把话说得很圆，在当下就能让对方深信不疑。本身能言善道是一件好事，但在说话的同时，”心里想的”也很重要。如果心存善念，那麽说出口的话，相信也会是好话。反之，如果只是表面上说的好听，但心里却充满怨恨，只想着如何报复别人，那”言语”就变成了一种恐怖的工具，可以杀人於无形之中。须知不怀好意，终将害人害己。"},
{"签位":"秦宓屈张温 上中","签文":"冷水来浇白雪洋，不寒不热自温凉；要行天下无他事，惟有中藏一艺强。","解签":"凡事谨言慎行。有时我们自以为什麽都知道，尤其是对现状驾轻就熟的时候，很容易不自觉的自满或松懈下来，言行举止也在不知不觉中变得傲慢无礼。但所谓”一山还有一山高”，须知天下之大，比我们见多识广的人一定多如牛毛、密如过江之鲫。因此切忌自以为是、咄咄逼人，在自身状况良好的时候，也别忘了提醒自己 ”强中仍有强中手”。勿过於松懈，仍应时刻充实自我，发现有不足的地方，就要想办法弥补。凡事谦冲忍让，莫逞一时口舌之争。"},
{"签位":"魏颗得老人结草 上中","签文":"虚空结愿结人缘，保得人安愿未还；得兔忘蹄真绝迹，敢将初誓谩轻瞄。","解签":"信守承诺。老子说 ”夫轻诺必寡信。”意思是说，一个凡事都轻言承诺的人，必然难以守信。因此，不要轻忽任何曾经许下的诺言，对象包括他人与自己。能够帮助别人是一件美德，但在答应别人之前，一定要先考虑 对方的要求，是否适当?合理?。而在自我本身方面，也需仔细考量，如果没有能力做到的事，就不要轻易地向别人许下承诺。但是一旦答应了别人的事，不论大小，都应当全力以赴、尽量做到。"},
{"签位":"郭令公免胄见吐蕃 上上","签文":"直上高山去学仙，岂知一旦帝王宣；青天白日常明照，志在声名四海传。","解签":"凡事无私奉献。现在的社会，人与人的相处越来越冷漠。随着诈骗案件的层出不穷，大部份的人都只想求自保的心态下，很多情况，都不愿意再伸出援手。但是还有另一种人，只想着如果对事情能有所帮助、就会尽量去做，不计较利益得失，当然更不会想到自己。这类的人以投入义工居多，堪称是人间的活菩萨。须知个人的力量虽然单薄，但只要愿意去做、把被动的想法化为主动而积极的行动，凡事身先士卒、不问一己之私、不在乎能不能得到回报，相信一定会为自己的内心带来难以言喻的真正快乐。"},
{"签位":"风送藤王阁 中中","签文":"庭前叶落暮秋时，行客奔程势若飞；谢得天公轻着力，顺风相送宝船归。","解签":"凡事勿太悲观。人在面对艰难或遥不可及的任务时，第一个冒出的念头往往是”不可能”。其实”不可能”是一个消极且较没有自信的想法，当我们先入为主的就认定某件事”不可能”时，通常也等於间接否定了自己。然而世事本就难以预料，所以又怎麽能肯定，有些事情是绝对不会发生的呢?与其一开始就觉得”不可能”、”做不到”，还不如保持积极乐观的态度，试着踏出第一步，先不要预设太多立场。接下来，也许会有意想不到的成果与收获呢!"},
{"签位":"吕纯阳重生梓树 中中","签文":"炎炎烈火焰烧天，焰里还生一朵莲；到底永成根不坏，依然枝叶色新鲜。","解签":"不要太过执着。当我们在做一件事或向别人表达某些观点时，会发现有人能理解、有人却不能。此时也许会懊恼 为什麽同样一件事、说的是同样的话，反应结果却是两极?其实每个人都有每个人本身的个性、想法与特质，包括自己也是。硬要把自己的想法加诸在别人身上是行不通的，常常只会造成反效果。何不试着多花一点时间，去了解别人的观点与性质差异。知道对方的喜恶之後，才能进一步沟通，也可以避免误触对方的禁忌。做起事来，一定更加事半功倍。"},
{"签位":"马周入都投旅店 中上","签文":"譬若初三四五蟾，半无半有未完全；须教十五良宵夜，到处清光到处圆。","解签":"量入为出。每个人多多少少会有个人的喜好跟兴趣，例如有人喜欢爬山、有人喜欢唱歌、或买东西、喝喝小酒...等。有嗜好跟消遣是一件很好的事，也不失为抒发压力的一种方法。但是如果太超过而沉迷其中，也很危险。运动过度会导致体力无法负荷、开销过大会导致入不敷出、喝酒过量则会伤肝。因此，凡事都应适中，平常就要能有自我约束、自我节制的能力。应时刻检视本身的行为举止，如有不当之处或不好的恶习，要能深切自省、及时改过，才不会一错再错、因小失大。"},
{"签位":"李广灞陵夜猎","签文":"因名丧德不和同，切忌忙中变作凶；醉後不知何处去，青松影里睡朦胧。","解签":"凡事谨言慎行。人在忙碌或无意识的状态下，很容易说错话做错事。也许本身并无恶意，但所谓”覆水难收”，很可能因此而伤害到对方。所以应时刻谨慎小心，注意自己的言行举止。如果是规劝对方，也不宜因为太过求好心切而口出恶言。否则原本的一番好意却随着情绪影响而变质，岂不甚是遗憾。相反地，对於他人的讥讽批评，也不要因此怀恨在心、甚至想找机会报复羞辱回去。须知”己所不欲，勿施於人”，凡事包容宽厚，可让事情更两全其美。"},
{"签位":"苏秦抵掌华屋 上上","签文":"重开山後藏前事，万宝园中可再团；醉咏新诗添逸兴，贵人引接上云衢。","解签":"凡事努力不懈。其实不管做什麽事、求什麽学问，最重要的就是要有恒心跟毅力。但在日复一日的过程中，人容易变得怠惰且厌倦，也最恐因而导致事情前功尽弃、努力付诸流水。此刻心态的调整很重要，必须沉得住气，时刻自我期许。把握任何可以练习揣摩的机会，深刻了解所学，也可同时加强信心。对於他人的批评与指责，不妨虚心接受，当成激励自己的指教。多方尝试与努力改进缺失之後，定可融会贯通并且活用，将专才彻底发挥到淋漓尽致。"},
{"签位":"西王母献益地图 大吉","签文":"春来花发映阳台，万里舟行进宝来；跃过禹门三级浪，恰如平地一声雷。","解签":"任重道远。孔子的高徒颜回说过 ”舜何人也?予何人也?有为者亦若是。”如果有心想要做好事，就要坚守决心，时时充实自我不断学习，并贯彻到底。很多事是一种机缘，环环相扣。此时也许看不出来，却极有可能是日後成大就的必经过程之一。切勿小看自己，每个人在这个社会上都是栋梁之才。相信道德为一切的根本，不管经过多久，也不会退转初衷。"},
{"签位":"魏武帝羊肠失路 中平","签文":"人行半岭日衔山，峻险巉岩未可攀；仰望上天垂护佑，此身犹在太虚间。","解签":"凡事勿轻言放弃。有时人在遭逢困境的时候，想法不自觉会变得很负面，浑身提不起劲，甚至对任何事都感到绝望。与其消极丧志，不如换个心情、换个角度想。所谓天无绝人之路，在遇到挫折困境的时候，不要太快就否定了自己，也不要因为一时的悲观而想不开。人生有时重要的不是结果，而是过程。这个过程也许辛苦，但同时却也是学习成长的好机会。俗云”山不转路转，路不转人转”，保持好心情，事情一定会有转机的!"},
{"签位":"张子房误中副车","签文":"木雕一虎在山林，远望威容意不禁；纵说不妨终可畏，此身如入大江心。","解签":"凡事勿操之过急。有时当我们听到一件事，尤其是跟自己有利害关系时，因为事情还不明朗，常因此变得提心吊胆，好的希望它赶快发生，坏的希望它不要成真。好的也急，坏的也急。然而急就章的结果，往往都是适得其反，甚至造成无法弥补的过失。须知很多事都只是空穴来风，在未确定之前，宁可按兵不动、先保持观望。如果是别人的事，也不要因此而热心过头，最後反而变成自己”一厢情愿”、自找麻烦，既帮不到别人，又弄得一鼻子灰。凡事保持客观，避免先入为主。"},
{"签位":"姜太公渭水遇文王 上上","签文":"出入营谋大吉昌，无瑕玉在石中藏；如今幸得高人指，获宝从心喜不常。","解签":"事在人为。我们在人生中，可能有些事情，想去做，但是却迟迟没有去实行。随着时间一天一天的流逝，对於心中”想要去做”的这个念头，可能会变得越来越犹豫、或者拖一天算一天。与其放任空想得过且过，何不化消极为积极，多方打听、四处留意，只要有机会，就主动把握并努力去尝试。不要怕来不及或担心拖太久，相信只要有心，随时都会有新的契机。"},
{"签位":"刘先主如鱼得水 上上","签文":"忽朝一信下天墀，宝贝船装满载归；若问前程成底事，始终应得贵人提。","解签":"凡事以诚相待。在人与人合作的社会，凡事无法光靠个人的单打独斗，也必须仰赖他人的长才。当我们对某人的才华非常激赏、求贤若渴时，会想要用尽一切办法来获得。但有时越是才华洋溢、充满智慧的人，越难以被世俗的虚荣所打动。此时与其用尽千方百计，还不如以”诚意”做起。”诚”出自於自身的内心，没办法用任何外物修饰。它的影响力缓慢但却可以深植人心。凡事以诚待人，相信对方一定也会被感动。荣华富贵虽然可以诱惑一个人对物质的需求慾望，但”诚意”却可以融化外在的一切，牢牢地抓住每个人的心。"},
{"签位":"宗悫长风破浪 上上","签文":"好把愁眉须展开，大才大用荐将来；一条大路平如掌，凡有施为总称怀。","解签":"凡事勿拖泥带水。在人生中，我们三不五时会面临许多新的机会或重大的决定，尤其是情况有急迫性、时效性时，人往往会对之後不可预知的结果而产生犹豫、或变得不知如何是好。此时切记沉着冷静，慎重考量目前的环境与情势，分析出有利自己的优缺点，然後做出正确的决定。如果拖泥带水、迟疑不决，可能导致错失良机。平时就要做好准备，免得突发状况时手忙脚乱。"},
{"签位":"李固言柳汁染衣 上上","签文":"经商得利称心怀，福禄荣华倍获财；若问进身谋望事，秀才一举状元回。","解签":"凡事相信。人们最大的痛苦，莫过於对人性产生了怀疑。因为凡事疑神疑鬼，自我的内心开始筑起了高墙，担心被骗、被利用而受伤。但是，处处防着别人，凡事都过度小心、过度猜测的结果，不但於事无补，反而只会让自己越来越神经质；而你回应给别人的不信任感，别人同样也会回报在你身上。与其因为怀疑而产生更大的痛苦，还不如凡事包容、凡事相信。事情没有那麽复杂，是人的心使它复杂。保持一颗赤子之心，相信人性本善，以真诚待人，包容厚道，人生何处不逍遥。"},
{"签位":"卫懿公赐鹤乘轩 中中","签文":"鸾凤翎毛雨压垂，此时应被雀轻欺；忽朝一日云霄霁，依旧还教振羽衣。","解签":"保持冷静。很多现象只是短暂的、表面的，切莫因此灰心丧志。尤其在小人当道之时，千万不可乱了方寸，更不要随波逐流。对於旁人的明嘲暗讽，何妨忍一时。坚守内心良知认为是对的事，做好份内之事。表面上也许是强颜欢笑，但内心依然保持自我的清明，相信自己做的任何事，都是本应如此，没有对不起自己，也没有对不起任何人。"},
{"签位":"王君公避世墙东 中中","签文":"小人君子别贤愚，事有差讹合是非；琴遇知音当鼓操，争如定静得便宜。","解签":"凡事耐性。每个人都有自己的一套看法与想法，有时难免与人意见相左。然而公说公有理、婆说婆有理，有时与其争论激辩，不如保持缄默。即使别人有误解、不了解，又何必放在心上，只要心中清亮，知道自己在做什麽就好，实在无须在意别人怎麽看、怎麽说。"},
{"签位":"刘太尉闻鸡起舞 上上","签文":"事业功勤暮与朝，荣华物态不胜饶；报君记取金鸡斗，福禄声名价自超。","解签":"凡事要有毅力。要下决心不难，但要实际付诸行动、并且持之以恒却不容易。所谓”养兵千日，用在一时”。平日不间断地充实自己、做好对事物的准备，并时刻提醒自己不要松懈，每天一点一滴所慢慢累积出来的实力，相信届时定能一鸣惊人，成功指日可待。"},
{"签位":"汾阳王七夕天孙 上上","签文":"巍巍宝塔不寻常，八面玲珑尽放光；劝汝志心勤顶礼，天龙拥护降千祥。","解签":"凡事有始有终。人人都希望能有功成名就、大富大贵之日，但别忘了”三分天注定，七分靠打拼”的道理。既然有理想、有梦想，就要靠自己，努力的让它付诸实现。所谓”天助自助者”，与其祈祷上苍，不如将愿望化为实际的行动。凡事只要肯做、肯冲、肯拼，抱持着勇往直前、积极进取的态度、持之以恒，必有成功之日。"},
{"签位":"邓通铜铸钱","签文":"园林月色摇疎影，恍若铺成满地琼；几度儿童来收拾，岂知收拾总无成。","解签":"凡事不要过贪。对於身边的物事，取之平衡、够用就好，不应得寸进尺，任由慾望无止尽的扩大。无论是贪多、贪快、贪急都不好，不但对事情本身毫无帮助，甚至反而会导致反效果。凡事应能谨慎节制，时刻检视、约束自己的慾望；知足才能常乐。"},
{"签位":"陶渊明三径关门","签文":"经商出入事迟疑，恐惹闲愁与是非；如鸟飞投罗网陷，相看能有几人知。","解签":"凡事不要推托。每个人都有应尽的义务与责任，在”任务”尚未达成之前，万万不可推托卸责、或自认为理所当然，把藉口合理化。尤其是为人父母者，更应负起责任，绝无任由对方辛苦、自己逍遥快活之理。遇事不要选择逃避，凡事都应勇於面对、接受。须知每个人的内心都向往能自由自在无忧无虑，因此更应将心比心，绝对不要把自己的快乐建筑在别人的痛苦上。"},
{"签位":"塞翁失马 中平","签文":"等闲骑马着鞭来，半有忧危半有财；似火方烧头上屋，天教一雨荡殃灾。","解签":"凡事保持乐观。须知事事无绝对，好的不见得就好，坏的也不见得是坏。有些事情往往出乎我们意料之外，是好是坏，不到时候，都还很难说。因此，何必杞人忧天，去设想还没有发生的事。不如保持平常心、凡事乐观以对。所谓”既来之，则安之”。须知有得必有失，有失必有得。"},
{"签位":"楚襄王阳台梦醒","签文":"欲就东兮欲就西，逢人说事转痴迷；登山不见神仙面，莫若归休更勿提。","解签":"凡事脚踏实地。有些事是可遇而不可求，切勿妄想执着。对於昙花一现的物事，如果就此眷恋不忘，无异於守株待兔，只不过是浪费时间、枉费心力罢了。与其执着在不确定的事情上面，还不如跳脱迷思，自力更生。凡事务实、一步一脚印，须知一分耕耘，才有一分收获。有梦想就必须靠自己努力打拚来实现，不然就只是流於空想罢了。"},
{"签位":"功名利禄","签文":"天门一挂榜，预定夺标人，马嘶芳草地，秋高听鹿鸣。","解签":"大吉，事业、财运、健康、婚姻均顺遂。"},
{"签位":"辅国兴邦","签文":"地有神，甚威灵，兴邦辅国，尊主庇民。","解签":"神护签，言行循规蹈矩，事业上必有贵人相助，婚姻得意，健康亦佳。"},
{"签位":"古迎亲图","签文":"长安花不可及，春风中马蹄疾，急早加鞭，骤然生色。","解签":"惕厉不可好高骛远，目前情况不理想。"},
{"签位":"秋菊幽芳","签文":"春花娇媚，不禁雨打风飘，秋菊幽芳，反耐霜雪傲。","解签":"勉惕类，诸事无法顺利，踏实或有可望。"},
{"签位":"春雨颂歌","签文":"春雷震，夏风巽，卧龙起，猛虎惊，风云会合，救济苍生。","解签":"否极泰来，外旱逢甘雨，不过婚姻恐有波澜，出外旅游亦不宜。"},
{"签位":"上下求索","签文":"非玄非妙，非浅非深，一个妙道，着意搜寻。","解签":"心性勿求切，着意搜寻，必能如愿。"},
{"签位":"先知须悟","签文":"君须悟，勿误疑，有平路，任驱驰，随时变易，件件咸宜。","解签":"应机警应变，始能左右逢源。"},
{"签位":"时到功成","签文":"虎恋高山别有机，众人目下尚狐疑，雁来嘹呖黄花发，此际声名达帝畿。","解签":"目前无人能识，日后必受众人赞颂。怀才不遇者得此签，日后必发达。"},
{"签位":"路在脚下","签文":"贵客相逢更可期，庭前枯木凤来仪，好将短事求长事，休听旁人说是非。","解签":"命中得遇贵人相助，未婚男子可得佳侣，商人则应有主见，始能获利。"},
{"签位":"好事多磨","签文":"嘹呖征鸿独出群，高飞羽翼更纠纷，云程北进好音遂闻，朝云暮雨交加有凭。","解签":"才气出众，无奈受制，去向宜北，可获佳遇。"},
{"签位":"寻寻觅觅","签文":"无踪又无迹，远近均难觅，平地起风波，似笑还成泣。","解签":"小心提防，以静为动，方能转忧为喜。"},
{"签位":"小心谨慎","签文":"神黯黯，意悠悠，收却线，莫下钩。","解签":"诸事暂且打住，免有失误，后悔莫及。"},
{"签位":"春风得意","签文":"得意宜逢妇，前程去有缘，利名终有望，三五月团圆。","解签":"吉，留意三、五有关月日，或有殊遇、喜事。"},
{"签位":"蹉跎岁月","签文":"鼎沸起风波，孤舟要渡河，巧中却藏拙，人事转蹉跎。","解签":"不吉，须防树大招风，问婚姻或家人相处者，并争纷颇烈。"},
{"签位":"等待消息","签文":"意在闲中信未来，故人千里自徘徊，天边雁足传消息，一点梅花春色回。","解签":"一切期待，均有可得，但须再等待一段时间。"},
{"签位":"寻找知音","签文":"心和同，事知同，门外好施功，交加事有终。","解签":"得此签者，不合者必复合。"},
{"签位":"忖事千里","签文":"欲行还止，徘徊不已，藏玉怀珠，忖心千里。","解签":"处于蓄势欲发又迟疑难决者，宜下定决心，完成大业。"},
{"签位":"烦恼忧心","签文":"心戚戚，口啾啾，一番思虑一番忧，说了休时又不休。","解签":"不利，结局恐难有望。"},
{"签位":"难易变幻","签文":"不远不近，似易似难，等闲一事，云中笑看。","解签":"平平，成败利钝淡然处之。"},
{"签位":"困境之中","签文":"桃李谢春风，西飞又复东，家中无意绪，船在浪涛中。","解签":"栽种不得其时，去向漂流不定，远行旅程不顺，家庭亦有风波。"},
{"签位":"山穷水尽","签文":"一水远一水，一山旋一山，水穷山尽处，名利不为难。","解签":"须费尽九牛二虎之力始克有成。"},
{"签位":"事在半途","签文":"事相扶，在半途，翻覆终可免，风波一点无。","解签":"目前不顺，惟亦不致有风险。"},
{"签位":"差之毫厘","签文":"喜喜喜，春风生桃李，不用强忧煎，明月人千里。","解签":"喜讯已到，故人安然无恙，健康痊愈在即，婚姻可期。"},
{"签位":"静守渡安","签文":"意孜孜，心戚戚，要平安，防出入。","解签":"谨言慎行，始得平安。"},
{"签位":"遇见实难","签文":"见不见，也防人背面，遇不遇，到底无凭据。","解签":"应防来自西方之暗箭，所问之事尚无征候。"},
{"签位":"喜见春生","签文":"一番桃李一番春，谁识当初气象新，林下水边寻活计，见山了了称心意。","解签":"或可任新职，经营事业以农林渔牧为宜，患病者宜换医生并到山水处静养。"},
{"签位":"真人不魔","签文":"莫怪我见错，心性自成疴，偏僻不通心，真人却不魔。","解签":"不可固执己见，心性偏执者，宜修养心性。"},
{"签位":"英雄少年","签文":"禄马交驰，男儿得志时，行程早办，荣归乐期颐。","解签":"吉祥，若卜仕途宦海之事，尤称合适。"},
{"签位":"了却心愿","签文":"了却心头事，三生夙有缘，香开十里桂，移步入天边。","解签":"大吉大利，尤对男女姻缘，桂香之时，约为秋季为宜。"},
{"签位":"重在实践","签文":"缘黄阁白了头，毕竟成何济，不如趁此精神，犹好买些真气。","解签":"攀权附贵者宜回头，顶天立地重新做人，否则不得善终。"},
{"签位":"早起旅行","签文":"离别间，虽不易，同伴行，犹不滞，早早起程，免他失意。","解签":"此时此刻须当当机立断，不能思前顾后，畏首畏尾。以致造成大损失，大错误。"},
{"签位":"夕阳西照","签文":"乐之极忧将至，巽兑分明吉与凶，未能光大终幽暗，日落西山返照中。","解签":"人任意胡来，狂妄不知其危险性，一意孤行而不知止息。这就是祸的根源。"},
{"签位":"历过波涛","签文":"历过波涛三五重，谁知浪静又无风，须教明达青云路，用舍行藏不费功。","解签":"签诗教人明白人生可进可退，应适时进退方是聪明达练之人。"},
{"签位":"缺月重圆","签文":"缺月又重圆，枯枝色更鲜，一条夷坦路，翘首望青天。","解签":"吉昌。将有一个重新开始的转折点，或经过艰难困苦终究变通。"},
{"签位":"行路艰难","签文":"行路难行路难，今日方知行路难，前程广大何足虑，琼力今朝度此滩。","解签":"一向平顺，今突生险，惟必可过关。"},
{"签位":"春景明媚","签文":"春景明，春色新，春意傍水生，春天无限好，好去宴琼林。","解签":"事业发达，健康良好，性情豁达，交游广阔。"},
{"签位":"道高德重","签文":"万马归元，千猿朝洞，虎伏龙降，道高德重。","解签":"凡事须以诚信为本，方能在事业中学有所成，人群中树立威望。"},
{"签位":"快马加鞭","签文":"黄鹂报上林，春色鲜明，提鞭快着，马上速行程。","解签":"做任何事，目前时机最佳。"},
{"签位":"救死扶伤","签文":"大肆放灵丹，救人行万千，到头登彼岸，渡过入仙班。","解签":"行善济人，必得善果，医生得此签，必为名医，教师得此签，必为名师。"},
{"签位":"月到天心","签文":"一带水，碧澄澄，舟住江上，月到天心；稳步其中，玄妙不闲，非人误己，几丧生身。","解签":"塞翁失马，焉知非福，诸事均欠顺遂，惟尚未铸下大错，还能全身而退。"},
{"签位":"良辰美景","签文":"桃李舒姘，春光鲜丽，良辰美景君须记，随心所往事事相宜，无用多疑干渎神祗。","解签":"吉祥，命中注定事事顺利，多疑而缺乏自信，将辜负上天恩宠。"},
{"签位":"中有玄机","签文":"隐中显，显中微，个中有玄机，参得透了，直上仙梯。","解签":"所问之事呈胶着状态，仅凭蛛丝马迹研判，是否突破就看能否参透玄机。"},
{"签位":"千头万绪","签文":"无上去，在前头，回头一悟，绳缰好收，千条万线路常在，自好搜求。","解签":"所问之事可能走错方向，即改弦易辙，另觅可行之路。"},
{"签位":"万寿如松","签文":"四顾无门路，桃源路可通，修炼成正果，万岁寿如松。","解签":"平平，一生行运不通，惟尚有一线之路，只要多磨练、苦修，日后自成。"},
{"签位":"不慌不忙","签文":"不用忙，不用慌，自有驻足乡，鸣鼓响钟地，三宝见门墙。","解签":"做事沉着稳定，自有容身之地，多热心公益，门庭自逢佳运。"},
{"签位":"虚浮一世","签文":"奔波一世，总是虚浮，无常一到万事休，急早回头。","解签":"一生争名夺利，最后化为乌有，回头是岸。"},
{"签位":"返本归宗","签文":"真真真，人不识，真真真，神有灵，归宗返本，方是元精。","解签":"诸事假象蒙蔽，误入歧途，认清真象，转入正途。"},
{"签位":"不耻下问","签文":"走尽天涯，风霜历遍，不如问人三天，渐渐有回首见。","解签":"盲目躁进必白费功夫，应求教贤达。"},
{"签位":"大病初愈","签文":"沈沈疴染，不见天心，雷门一震，体健身轻。","解签":"久病者突逢良医，立即恢复健康，经营事业不佳者，可望获良才，兴隆有望。"},
{"签位":"官禄有定","签文":"财马两匆忙，官禄有定方，猪羊牛犬，自去主张。","解签":"顺其自然。"},
{"签位":"空里成功","签文":"空空空，空里得成功，蟠桃千载熟，不怕五更风。","解签":"大器晚成。若问财运，得此签不祥；若问诉讼，则缠讼多日可获胜诉。"},
{"签位":"目穷千里","签文":"愁脸放，笑颜开，秋月挂高台，人从千里来。","解签":"吉祥，心境渐渐开朗，环境已转佳境，寻人定然相遇，其他亦有转机。"},
{"签位":"脚踏实地","签文":"须着力，莫远游，长竿钓向蟾蜍窟，直欲云中得巨鳌。","解签":"警惕之签，凡事须全力以赴，不可贪玩疏忽。时运来临，愿望自然可成。"},
{"签位":"空劳心力","签文":"无踪无迹，远近难觅，旱海行舟，空劳费力。","解签":"由于方法、路线、策略不对而失败。莫再追求已完全没有希望的东西了。"},
{"签位":"凭借东风","签文":"细雨蒙蒙湿，江边路不通，道途音信远，凭仗借东风。","解签":"时运欠佳，一切难望有成，惟有依靠仅有之一线生机。"},
{"签位":"姻结豪门","签文":"平地起云烟，时下未能安，高处觅姻缘。","解签":"所问之事现时现地均难有成，如问姻缘，须向显赫人家去求，如问事业，波折重重。"},
{"签位":"守诚花开","签文":"正直宜守，妄动生灾，利通名达，叶落花开。","解签":"应坚守本位，正直无欺。"},
{"签位":"君子小人","签文":"君子升，小人阻，征战生离苦，前有吉人逢，信在马牛人在楚，事要营求妥。","解签":"所问之事波折连连，有人玉成，有人破坏，无地利之便，须稳妥安排为宜。"},
{"签位":"敛眉望灯","签文":"纷纷复纷纷，欷独掩门，眉望灯火，伴我坐黄昏。","解签":"须守时耐运，待机而行，不可强求。妇人求得此签，恐有夫妻失和情事。"},
{"签位":"恋意中人","签文":"红颜美，休挂怀，人在车中，舟行水里。","解签":"凡事不可存奢望。"},
{"签位":"途中遇险","签文":"桥已断，路不通，登舟理楫，又遇狂风。","解签":"大不吉，已失天时地利，凡事宜慎，不可轻举妄动。"},
{"签位":"事中空话","签文":"深潭月，照镜影，一场空，安报信。","解签":"不可急于求成，求之过深。目前还不是时候。"},
{"签位":"龙兔相逢","签文":"湖海意悠悠，烟波下钓钩，若逢龙与兔，名利一齐周。","解签":"示人胸襟以阔，达观为怀，自可名利双收。注意龙兔年或属龙兔之人"},
{"签位":"重振旗鼓","签文":"物不牢，人断桥，重整理，慢心高。","解签":"所问之事应重新来过，如以笃实之态度为之，或有可成。"},
{"签位":"出行不利","签文":"入而易，出而难，恹恹到再三，交加意不堪。","解签":"整外治内，以防险难于前。"},
{"签位":"大器晚成","签文":"事迟志速，而且反覆，直待岁寒，花残果熟。","解签":"若时机未熟，但凭己力，尚难成就。妇女得此签，显示心意不足，青春蹉跎。"},
{"签位":"吉人天相","签文":"乘马前进，所求吉贞，随时谐美，缺月重明。","解签":"一鼓作气，勇往直前，即使往昔曾犯缺失，如今亦可重获振作之机。"},
{"签位":"坚定信念","签文":"舟离古渡月离云，人出潼关好问津，且向前行去求住，何须疑虑两三心。","解签":"此签主外，出远行有利，得此签者，所问之事难题已解，难关已破，从此坦途。"},
{"签位":"黄粱美梦","签文":"不足不足，难伸心曲，野塘雨过月如钩，梦断邯郸眉黛愁。","解签":"知足常乐，随遇而安，否则有梦境难圆之慨。妇女得此签，宜勉力抛虚荣之心。"},
{"签位":"美堪终始","签文":"美有堪，堪有美，始有终，终有始。","解签":"为人追求真善美方为正途，凡事必以始终一贯精神为之。"},
{"签位":"野渡舟横","签文":"湖海悠悠，孤舟浪头，来人未渡，残照山楼。","解签":"所问诸事尚在虚无飘渺间，当前处境未开，心绪至为郁闷，情境苍茫。"},
{"签位":"提防暗计","签文":"深户要牢扃，提防暗里人，莫言无外事，纵好定遭 。","解签":"无事须当有事，有事更加防范，得此签者须注意门户以防窃，谨言慎行免招祸。"},
{"签位":"江海悠悠","签文":"江海悠悠，烟波下钩，六鳌连获，歌笑中流。","解签":"此签大吉，凡谋事、创业必有望，且连获成功，尤其逢“六”数，更具喜色也。"},
{"签位":"心无一定","签文":"欲济未济，欲求强求，心无一定，一车两头。","解签":"三心二意，有违常理，动弹不得，得此签者，所问诸事均呈胶着状态。"},
{"签位":"得失皆虑","签文":"一得一虑，退後欲先，路通大道，心自安然。","解签":"得意之时勿忘形，失败之后勿失志，不行歪路，心境自然安适。"},
{"签位":"难易互变","签文":"难难难，忽然平地起波澜，易易易，谈笑寻常终有望。","解签":"机遇欠佳时，人在家中坐，祸从天上来，行运转佳时，一切左右逢源，得心应手。"},
{"签位":"倚仗春风","签文":"心有馀，力不足，倚仗春风，一歌一曲。","解签":"所问之事，自己心馀力绌，无法独力完成，但会有外力来助，结果仍称圆满。"},
{"签位":"事终必欢","签文":"身不稳，心不安，动静两三番，终朝事必欢。","解签":"问健康，应多运动，问事业，则现危机，折腾几次，最终朝好的方向发展。"},
{"签位":"难断信息","签文":"事了物未了，人圆物未圆，要知端的信，日影上琅玕 。","解签":"人、事问题，均了断并圆满解决，有关物则否。得此签，恐有财务纠纷并涉讼。"},
{"签位":"春木向阳","签文":"木向阳春发，三阴又伏根，樵夫不知道，砍去作柴薪。","解签":"不可暴殄天物，对事物体认不够，任意扔弃滥用，岂不可惜。"},
{"签位":"阴晴月缺","签文":"一月缺，一镜缺，不团圆，无可说。","解签":"此签不吉，月既缺镜又损，所问诸事自属不圆满，恐亦无转机。"},
{"签位":"征讨叛逆","签文":"车马到临，旌旗隐隐月分明，招安讨叛，永大前程。","解签":"此签如问战略戎事大吉，问事业则大发，问考试则高中。"},
{"签位":"自然功成","签文":"我何宿，我何宿，海东河北成名录，一段神光，直冲天渎。","解签":"选择努力方向，如能吸取前贤经验，必能事半功倍，如得神助。"},
{"签位":"谨言防口","签文":"金鳞入手，得还防走，若论周旋，谨言缄口。","解签":"金鳞影射钱财，警惕吾人谨言少语，如遇友人金钱周转，须防上当受骗。"},
{"签位":"天地合欢","签文":"倾一杯，展愁眉，天地合，好思为。","解签":"愁闷事在杯酒中尽释，夫妻间之不合应尽快化解。"},
{"签位":"谈鬼喻人","签文":"野鬼张弧射主人，暗中一箭鬼魂惊，忽然红日沈江海，难破空中事不明。","解签":"得此签者如为主管，恐有欺害下属之事，结果遭到致命之报复。"},
{"签位":"福星高照","签文":"福星照，吉宿临，青天有日见天真，龙飞下载到明庭。","解签":"此签吉利，全属福佑德庇之赞。"},
{"签位":"空载明月","签文":"独钓寒潭，中途兴阑，水寒鱼不饵，空载月明还。","解签":"不祥，所处环境欠佳，所求未如理想，反生阻碍。"},
{"签位":"劳心借力","签文":"不归一，劳心力，贵人旁，宜借力。","解签":"所问诸事意见纷陈，头绪杂乱，如不借助有力者，恐要白费心力。"},
{"签位":"千里疾风","签文":"云尽月当中，光辉到处通，路途逢水顺，千里快如风。","解签":"转机交运之兆，时下机运甚佳，所问大吉大利。"},
{"签位":"剿贼建功","签文":"剑戟列山林，盗贼必来侵，败走擒搜定，封侯荫子孙。","解签":"激烈竞争中，需料敌如神，妥为布置以待敌来，赢得胜利后尚需妥善收拾战果。"},
{"签位":"千难万险","签文":"岸阔水深舟易落，路遥山险步难行，蛇行自有通津日，月上天空分外明。","解签":"所问诸事宜向宽处打算，向远途作想，最后必能成功。"},
{"签位":"变化鱼龙","签文":"拟欲迁而未可迁，提防喜处惹勾连，前途若得阴人引，变化鱼龙出大渊。","解签":"勿为喜事冲昏头，谨防欢乐引出麻烦。"},
{"签位":"获得金鳞","签文":"一人去，一人入，清风明月两相猜，获得金鳞下钓台。","解签":"内部团结，吉祥如意，天时地利，可有收成。"},
{"签位":"道不坚牢","签文":"喜未稳，悲已遭，大雨狂风吹古木，人人尽道不坚牢。","解签":"物极必反。若能体察下情，励精图治，上下团结一心，或能转危为安。"},
{"签位":"知音迟至","签文":"可以寄百里之命，可以托六尺之孤，锺期既遇毋迟误。笑呼呼，他乡聚首，各自乐康和。","解签":"得此签者，可望遇知音，交至友，得生死相许之配偶。"},
{"签位":"上林春色","签文":"报道上林，春色鲜明，提鞭快着，马上行程。","解签":"亨通顺利，时运好转。"},
{"签位":"静夜巡行","签文":"鼠入土穴，最可安身，日中不见，静夜巡行。","解签":"人各有其不同安身立命之所及最适当行动时机，选择其他恐大不利。"},
{"签位":"腰缠万贯","签文":"打起平生志，西南好去游，腰缠十万贯，骑鹤上扬州。","解签":"得此签者，已功成名就，或者，目前从事者志趣不合，如今财力已丰，可以从已趣。"},
{"签位":"得中防失","签文":"喜喜喜，终防否，获得骊龙颔下珠，忽然失却，还在水里。","解签":"谨防有乐极生悲之事发生。"},
{"签位":"国泰民安","签文":"国有贤士，廷无佞臣，干戈不用，常享太平。","解签":"太平盛世，家庭和乐。"},
{"签位":"炼丹妙语","签文":"泰来否已极，诸事莫忧心，但须培养元福，做些好事，行些方便，一点丹灵独得真。","解签":"事情朝有利的方向发展。先忧后喜。"},
{"签位":"忧国忧民","签文":"民乐业，官吏清，雍熙之世复见于今，告诸人千秋鸿业，仗此望明君。","解签":"得签者为首脑时，应立求属下各安其位，各部门主管廉洁公正。"},
{"签位":"安如泰山","签文":"安如泰山，稳如磐石，放胆前行，中通外直。","解签":"上升之道，当稳步前去，所行中正适宜，凡事亨通有望。"},
{"签位":"月中有桂","签文":"月中有丹桂，人终攀不着，云梯足下生，此际好落脚。","解签":"远大目标不易实现，如有匡助之力或引荐之人，也就获得成功机会。"},
{"签位":"知己难寻","签文":"天间一孤雁，嘹唳叹离群，试问知君者，而今有几人。","解签":"失意者之孤寂与无奈，得此签者，宜调整处世态度，以此为诫。"},
{"签位":"幻想落空","签文":"红叶无颜色，凋零一夜风，邻鸡醒午梦，心事总成空。","解签":"好运消瞬即逝，理想忽受阻碍，办事难有成就。"},
{"签位":"乱麻难理","签文":"事如麻，理多错，日掩云中，空成耽搁。","解签":"所问之事情况混乱，时运不佳，事多蹉跎，一无所成。"},
{"签位":"弃旧图新","签文":"勿上旧辙，甘驾新车，东西南北，稳步康衢。","解签":"慎防勿蹈前车之覆辙，宁可改弦更张，另作他图。"},
{"签位":"夜梦鼠惊","签文":"夜梦被鼠惊，醒来不见人，终宵废寝，直到天明。","解签":"不祥之兆，近时或有惊险之事，可能应验于鼠年、鼠日或属鼠之人，小心。"},
{"签位":"世情冷暖","签文":"秋霜肃，夏日炎，新花鲜了旧花淹，世情看冷暖，逢者不须言。","解签":"凡事靠自己，依赖别人不可靠。"},
{"签位":"英雄有志","签文":"未展英雄志，驰驱不惮劳，敢将休咎卜，西北夺前标。","解签":"不避劳苦，慎选致力方向。"},
{"签位":"雷震病除","签文":"疴染沈沈，终日昏昏，雷门一震，体健身轻。","解签":"如问疾病，暂难痊愈，尚需时日，以得名医。"},
{"签位":"笑谈难易","签文":"易非易，难非难，忽地起波澜，欢笑两三番。","解签":"所问之事，呈胶着状，惟会突起变化，所有问题迎刃而解。"},
{"签位":"夜路提防","签文":"路不通，门闭塞，谨慎提防，云藏月黑。","解签":"谨慎小心，免惹祸端。"},
{"签位":"半道处事","签文":"蜗角蝇头利，而今已变通，草头人笑汝，宜始不宜终。","解签":"办事要有始有终，方能达到变通的目的。切不可因小失大。"},
{"签位":"奇门遁甲","签文":"珠玉走盘中，田园定阜丰，休言谋未遂，此去便亨通。","解签":"努力必有代价，但须耐心等待。"},
{"签位":"万事顺意","签文":"月已明，花再发，事悠悠，无不合。","解签":"得此签者，所问诸事均处于最佳状态，事事称心如意。"},
{"签位":"贵客来临","签文":"朦胧秋月映朱门，林外鸟声远寺僧，自有贵人来接引，何须巧语似流莺。","解签":"命中有贵人相助，安份守己以待机运。"},
{"签位":"事安心宽","签文":"事未宽，心不安，疑虑久，始安然。","解签":"所问诸事处在急于解决却未能解决之状况，不过最后终能渡过难关。"},
{"签位":"风物时新","签文":"虚名虚位久沈沈，禄马当求未见真，一片彩云秋後至，去年风物一时新。","解签":"终年碌碌营钻，每得虚有其表之名位，但等秋后或中年以后将时来运转。"},
{"签位":"守诚而已","签文":"止止止，有终有始，似月如花，守成而已。","解签":"成败得失，莫不缘于因果循环之定数，不必强求。"},
{"签位":"美满圆月","签文":"明月全圆，颜色欣然，风云相送，和合万年。","解签":"大吉大利，所问诸事均得圆满达成，更能得锦上添花之美。"},
{"签位":"结合同心","签文":"宝镜新，照两人，心中结，合同心。","解签":"得此签者，即将成婚，或已成婚，双方情投意合生活美满，如问合伙，亦可大发。"},
{"签位":"上下不和","签文":"居下不亲上，人心易散离，事机终失一，凡百尽成灰。","解签":"居上者倨傲、偏狭，居下者离心，最后关键时刻，招致失败。"},
{"签位":"贵人引渡","签文":"兀兀尘埃久待时，幽窗寂静有谁知，若逢青紫人相引，财利功名自可期。","解签":"得此签者，时运欠畅，有志未伸，须明提携之人，前途始有望。"},
{"签位":"行路防贼","签文":"虎伏在路途，行人莫乱呼，路旁须仔细，灾祸自然无。","解签":"遇事小心仔细，否则有招致横祸之可能。"},
{"签位":"惹灾祸乱","签文":"和不和，同不同，翻云覆雨几成空，进退须防终少功。","解签":"不吉，如问事业，纠纷不断，如问亲情友情婚姻，则神离而貌亦不合，进退小心。"},
{"签位":"边关笛鸣","签文":"东边事，西边成，风物月华明，高楼弄笛声。","解签":"得此签者，所谋之事于闲散自在中，不期然而有所成。"},
{"签位":"平步青天","签文":"事团圆，物周旋，一来一往，平步青天。","解签":"此签大吉，所问诸事都很圆满，得此签者财运奇佳，本利相滚，财货盈仓。"},
{"签位":"预防谣言","签文":"浅水起风波，平地生荆棘，言语虑参商，犹恐无端的。","解签":"衰运当头，即便慎言亦惹是非，故应少言，甚至不言。"},
{"签位":"待友推荐","签文":"秋月云开後，薰风雨过时，若逢楚国旧知己，等闲一荐不须疑。","解签":"如处平顺之境遇，如有他乡旧知求己引荐则可为之，否则如所求过奢者，宜多虑。"},
{"签位":"实惠可得","签文":"心已定，事何忧，金鳞已上钩，功名一网收。","解签":"吉祥，所问诸事，心意已决，即可达成，同时功成名就。"},
{"签位":"信隔重山","签文":"意迷己不迷，事宽心不宽，要知端的信，犹隔两重山。","解签":"时机未到，不可以有作为，变革也是妄行。保持清醒的头脑，等待机变。"},
{"签位":"祸中有福","签文":"笑中生不足，内外见愁哭，云散月光辉，转祸当成福。","解签":"凡事仅看表面自有不足，阻碍或能排除，祸事亦能成福庇。"},
{"签位":"鹊噪门前","签文":"檐前鹊噪正翩翩，忧虑全消喜自然，一人进了一人退，下梢还有好姻缘。","解签":"事情已安排妥当，全无冲突，若问姻缘，即可结合。"},
{"签位":"惆怅望天","签文":"荆棘生平地，风波起四方，倚栏惆怅望，无语对斜阳。","解签":"或有烦心之事来临，内心忧闷无人谅解。"},
{"签位":"谋定事成","签文":"谋已定，事何忧，照月上重楼，云中客点头。","解签":"大局安排已定，不必多作考虑。"},
{"签位":"天时地利","签文":"奇奇奇，地利与天时，灯花传信後，动静总相宜。","解签":"在成功大有收获之时，要有所收敛，否则会陷入进退两难的局面。"},
{"签位":"不遇不逢","签文":"遇不遇，逢不逢，月沈海底，人在梦中。","解签":"人算不如天算，总有突如其来的情况出现。"},
{"签位":"居安思危","签文":"暗中防霹雳，猜虑浑无实，转眼黑云收，拥出扶桑日。","解签":"所担忧之事均属子虚乌有，很快就能真相大白。"},
{"签位":"征战得胜","签文":"利在中邦出战时，一番获馈在王庭，凤衔丹诏归阳畔，得享佳名四海荣。","解签":"吉利。交易、官司有胜利的把握。"},
{"签位":"内忧外患","签文":"堪叹外边忧，更嗟门里闹，意绪更牵缠，心神亦颠倒。","解签":"不吉之兆，得此签者处于公私纷繁，困扰重重之境。"},
{"签位":"别有洞天","签文":"一重山一重水，风波道坦然，壶中有别天。","解签":"如问机构内之事，则虽风波重重，终能安然，问家务事，因妇女高妙，亦安。"},
{"签位":"遇险别忧","签文":"遇险不须忧，风波何足忌，若遇草头人，咫尺青云路。","解签":"吉祥，化险为夷，若遇贵人，将可发迹。贵人或可注意姓名有草字头者。"},
{"签位":"事有疑猜","签文":"船棹中流急，花开春又离，事宁心不静，惹起许多疑。","解签":"心情纷乱，办事虑深，时运犹待新春，旅外慎防不测，婚姻出现暗礁。"},
{"签位":"蓄储良图","签文":"可蓄可储，片玉寸珠，停停稳稳，前遇良图。","解签":"不可浪费，遇良机时始能大展鸿图。"},
{"签位":"少小当家","签文":"小子早趋庭，青云久问程，贵人来助力，花谢子还成。","解签":"所测试之事有变革之意。须不断充实提高自己的能力。信守中道，事业成功有望。"},
{"签位":"一心两用","签文":"一心两事，一事两心，新花枯树，直待交春。","解签":"得此签者有心意不专，操之过急之毛病，未改之前难有成就。"},
{"签位":"大事难图","签文":"大事恐难图；残花不再鲜。","解签":"时机已逝，时光已老，欲图大事，已不可能。"},
{"签位":"进退遇阻","签文":"莫道事无讹，其中进退多，桂轮圆又缺，光彩更揩磨。","解签":"生活中的假象随时都有，要观察它的真伪，切忌眼光短浅，要作出正确的判断。"},
{"签位":"长竿金钩","签文":"莫叹事迟留，休言不到头，长竿终入手，一钓上金钩。","解签":"有耐心等待，调换方法与策略可获大功。"},
{"签位":"事宜借力","签文":"事称应有忌，未为恐先踬，欲往且迟迟，还须借势力。","解签":"不必操之过急，须仰人相助，或有所成。"},
{"签位":"两两相得","签文":"足不安，心不安，两两事相得，忧来却又欢。","解签":"中吉，先忧后喜。虽有过当之处，但仍有意外收获。有志同道合者。"},
{"签位":"重振旗鼓","签文":"鼎折足，车脱辐，有贵人，重整续。","解签":"所问诸事于开始非常不顺，命中有贵人相助，事情得以重整。"},
{"签位":"参评政事","签文":"参详言语，波涛扬沸，事久无伤，时间不利。","解签":"得此签者，恐有诉讼，或与人订约始终无法谈拢，亦或与人长时间有口舌之辩。"},
{"签位":"贵客相亲","签文":"贵客自相亲，功名唾手成，获金须积德，仰望太阳升。","解签":"得此签者注定显达，但需注意积德，否则将很快失去一切。"},
{"签位":"求事日难","签文":"平地起波澜，所求事日难，笑谈终有忌，同心事觉欢。","解签":"目前机运欠佳，须与知心友朋共事，庶几无患。"},
{"签位":"风吹墨云","签文":"狂风吹起墨云飞，月在天心遮不得，闲时无事暂相关，到底依然无克剥。","解签":"所问之事或人，如天心之月，皎洁无垢，非黑云所能遮掩。"},
{"签位":"淡泊明志","签文":"人倚楼，许多愁，澹然进步，事始无忧。","解签":"独处深思，总觉不悦，若能眼光放远，自然无忧。"},
{"签位":"三心两意","签文":"一点着阳春，枯枝朵朵新，志专方遇合，切忌二三心。","解签":"心志专一始能受到重视，略得提携即可步入佳境。"},
{"签位":"云开雾散","签文":"道路迢遥，门庭闭塞，雾拥去兮，云开见日。","解签":"应守时待运。"},
{"签位":"鱼难上钩","签文":"鱼上钩，丝纶弱，收拾难，力再着。","解签":"将得手之机会或财物，由于条件不济，力量不足，无法承受，须再加努力。"},
{"签位":"转忧为喜","签文":"相引更相牵，殷勤喜自然，施为无不利，愁事转团圆。","解签":"得此签者，平时乐于助人，故人际关系良好，事事均如意。"},
{"签位":"紧锁双眉","签文":"疑疑疑，一番笑罢一番悲，落红满地无人扫，独对西风怅黛眉。","解签":"凡猜疑之事，不可冒然尝试，须再三思考探求真相，方作决定，免乐极生悲。"},
{"签位":"劳而无功","签文":"上下不和同，劳而未有功，出门通大道，从此保初终。","解签":"与其在一个意见分歧不合之团体里，不如及早退出，另创局面。"},
{"签位":"报在三秋","签文":"大事可成功，有益还无咎，云中执鞭人，报在三秋後。","解签":"异人指点，凡事顺利，事成日在三秋后。"},
{"签位":"方知自然","签文":"桑榆催暮景，缺月恐难圆，若遇刀锥客，方知喜自然。","解签":"事情已到穷途末路，想有转机亦难，惟亦不必过于颓丧，能保性命即属庆幸。"},
{"签位":"喜得清风","签文":"遍书前後事，艰险往来难，若得清风便，扁舟过远山。","解签":"所问之事颇难如愿，须待天时。"},
{"签位":"春意浓浓","签文":"莫叹残花，花开枯树，屋头春意，喜笑嘻嘻。","解签":"得此签者，恐有失意事，惟转机已现。"},
{"签位":"事有成败","签文":"一事总成空，一事还成喜，若遇口边人，心下堪凭委。","解签":"凡进行之事，均属得失互参，与人交往洽事，若得遇亲信可靠之人，方可心安。"},
{"签位":"欲得月兔","签文":"欲得月中兔，须凭桃李拂，高山来接引，双喜照双眉。","解签":"要得到不易到手之物，非借不凡之力。"},
{"签位":"得意获鳞","签文":"事遂勿忧煎，春风喜自然，更垂三尺钩，得意获鳞鲜。","解签":"大吉，所问诸事均能如愿，且喜事连连。"},
{"签位":"时来始见","签文":"圆又缺，缺又圆，低低密密要周旋，时来始见缘。","解签":"要求功德圆满，但凭个人造化，机缘如何，所问诸事均如此。"},
{"签位":"病马危坡","签文":"乘病马，上危坡，防失跌，见蹉跎。","解签":"屋漏又遭连夜雨，船破偏遇当头风，衰透至极。"},
{"签位":"轻舟遇风","签文":"两事已和同，轻舟遇便风，道迷人得意，歌唱急流中。","解签":"得意勿忘形，忘形恐有灾。"},
{"签位":"英才须荐","签文":"白玉蒙尘，黄金埋土，久久光辉，也须人举。","解签":"虽有才华却遭埋没，须待有心人来提拔重用。"},
{"签位":"平地风波","签文":"上接不稳，下接不和，相缠相扰，平地风波。","解签":"无论在团体、在家庭或社会，上下皆不相容，经年纠葛不清。"},
{"签位":"求事有望","签文":"背後笑嘻嘻，中行道最宜，所求终有望，不必皱双眉。","解签":"心中所愿终可实现，何必愁眉深锁？"},
{"签位":"思念亲人","签文":"憔悴无人问，林间听杜鹃，一声山月笛，千里泪涓涓。","解签":"有被主所逐；客人傲主，反客为主而遭逢不测之灾祸。须改变方向和计划。"},
{"签位":"威名如山","签文":"菱荷香里受深恩，桂魄圆时印绶新，从此威名山岳重，光辉直上位丝纶。","解签":"此签如专就宦途而言，诚属上上大吉，可谓官运亨通，青云直上。"},
{"签位":"事在磨难","签文":"花落正逢春，行人在半程，事成还不就，索绊两三旬。","解签":"任何事均不得其时，尤其最近一月内，须防有所阻碍，诸事稍慢，等待转机。"},
{"签位":"得止且止","签文":"欲行还止，徘徊不已，动摇莫强，得止且止。","解签":"此签示人，若三心二意去做一件事，出于勉强，则一动不如一静。"},
{"签位":"逢龙有吉","签文":"心下事安然，周旋尚未全，逢龙还有吉，人月永团圆。","解签":"所问诸事，虽未圆满解决，但必能安然无虞，若遇龙龙年或属龙之人自有吉兆。"},
{"签位":"事成须时","签文":"梦里说关山，波深下钓难，利名终有望，目下未开颜。","解签":"总想换个新环境或工作，然却却不知如何着手，日后或有机运，目下尚不乐观。"},
{"签位":"闲语作歌","签文":"三箭开云路，营求指日成，许多闲口语，翻作笑歌声。","解签":"此签属机运亨通之签，尤对谋事、创业者而言。"},
{"签位":"恋春误事","签文":"休眷恋，误前程，终闹乱，出门庭。","解签":"莫为意中人或原留之地恋恋不舍，而误未来大事，不如早去为妙，免生祸乱。"},
{"签位":"破重重关","签文":"万里波涛静，一天风月闲，利名无阻隔，行路出重关。","解签":"积极进取，对胜利应抱有必胜之信心。"},
{"签位":"望梅止渴","签文":"渴望梅，画饼，漫劳心，如捉影，遇虎龙，方可省。","解签":"得此签者，恐有幻想之习，应即改之。"},
{"签位":"不久过关","签文":"事迷心不迷，事宽心不宽，一场欢喜会，不久出重关。","解签":"单办一项行业、活动或进行一件事，多力不从心，若有多人相助，则望可成。"},
{"签位":"传信有人","签文":"夜半渡无船，惊涛恐拍天，月斜云淡处，音信有人传。","解签":"得此签者，诸事不宜冒进，宜于天时、地利、人和俱备之后再行动。"},
{"签位":"往来闲塞","签文":"事若羁留，人不出头，往来闭塞，要见无有。","解签":"从事任何事，以谨慎机敏为上。"},
{"签位":"畅通无阻","签文":"万里片帆转，波平浪不惊，行行无阻滞，远处更通津。","解签":"所问诸事一向稳妥顺利，日后扩展，更属定操胜券。"},
{"签位":"东风便好","签文":"身历惊涛，东风便好，太平身退，目下还早。","解签":"此签对告老退休者，颇合其解，如问他事，则属有惊无险之局，刻下尚难抽身。"},
{"签位":"鹤出云中","签文":"鹤自云中出，人从月下归，新欢盈脸上，不用皱双眉。","解签":"尚有险难当前，知止不妄动，才会有好结果。新旧交替之象，先悲后喜。"},
{"签位":"常用心思","签文":"深潭鱼可钓，幽谷鸟可罗，只用久长心，不用生疑惑。","解签":"具有耐心，任何事均可成，不必怀疑。"},
{"签位":"明珠一颗","签文":"进不安，退不可，上下相从，明珠一颗。","解签":"所问诸事，处于进退两难之境，须相关诸人上下一心，始有成功之望。"},
{"签位":"前路不迷","签文":"着着占先机，其中路不迷，目前无合意，乍免是和非。","解签":"你所要求的事眼前不适当，勉强去争取有是非之嫌。"},
{"签位":"行人半途","签文":"雀噪高枝上，行人古渡头，半途不了事，日暮转生愁。","解签":"众说纷纭，莫衷一是，事情进行一半有阻滞，无法顺利完成。"},
{"签位":"苦得收成","签文":"凿石得玉，淘沙得珠，眼前目下，何用踌躇。","解签":"得此签者，时运特佳，做任何事都会有意外之收获。"},
{"签位":"人乐我忧","签文":"无端风雨催春去，落尽枝头桃李花，桃畔有人歌且笑，知君心事乱如麻。","解签":"好景不长，好花不再，避免小人挑拨坏事，幸灾乐祸。"},
{"签位":"传好音信","签文":"阆苑一时春，庭前花柳新，声传好信息，草木尽欣欣。","解签":"循序渐进，一路顺风，大事可成。"},
{"签位":"成事渺茫","签文":"门外事重叠，阴人多遇合，贤女虽助巧，渺渺终难洽。","解签":"自守其位，待机取事。有外遇之男女，要当心啊！"},
{"签位":"事好商量","签文":"事有喜，面有光，终始好商量，壶中日月长。","解签":"此签主诸事可通，事业健康发展。"},
{"签位":"忧心宜去","签文":"暗去有明来，忧心事可谐，终须成一笑，目下莫疑猜。","解签":"当下不要去疑虑，稍后有转机。"},
{"签位":"天衣无缝","签文":"宝镜无尘染，金貂已剪裁，也逢天意合，终不惹尘埃。","解签":"困难已经解决，理想已实现。无论婚姻、经商、交际诸事有成。"},
{"签位":"青云步步","签文":"和合事，笑谈成，喜音在半程，平步踏青云。","解签":"无往不利，能得众人拥戴。但须预防反复之事发生，半程之后的变化。"},
{"签位":"休往始安","签文":"花残月缺，镜破钗分，休来休往，事始安宁。","解签":"旧的格局已破，新的生活到来。要勇于辞旧迎新。"},
{"签位":"雁行折阵","签文":"门外好音来，生涯应有庆，名利有更迁，雁行终折阵。","解签":"得意之时，不可乐极生悲。要防止在升迁过程中遇到挫折。"},
{"签位":"万里江山","签文":"万里好江山，风沙尽日间，已吞钩上饵，何必遇波澜。","解签":"一个人光明磊落，不计得失，终会达到目的的。"},
{"签位":"无聊下台","签文":"双燕衔书舞，指日一齐来，寂寞淹留客，从兹下钓台。","解签":"不能冒进，退避一时是可取的。"},
{"签位":"明月出天","签文":"望去几重山，高深渐可攀，举头天上看，明月在人间。","解签":"谋望有困难，但可循序渐进。新的目标随着旧的目标达成后出现。"},
{"签位":"咫尺佳音","签文":"用之则行，舍之则藏，一骑出重关，佳音咫尺间。","解签":"用人应用有志节及才干之人，并放手让他施展，很快即有成就。"},
{"签位":"河山物新","签文":"积德施功有子孙，谷牛祭神及西邻，功名两字成全日，回首山河万物新。","解签":"行善积德，泽被乡里，将来必有好报。"},
{"签位":"雁飞南北","签文":"安坦路平夷，云中一雁飞，桃花逢骤雨，水畔女频啼。","解签":"此签若对男女间相恋、婚姻等，恐属大不利，如问他事，亦波折重重。"},
{"签位":"门内干戈","签文":"门内起干戈，亲仇两不和，朱衣临日月，始觉笑呵呵。","解签":"谨防家人失和，手足互残，并防身边亲人成仇家。恐有争斗官司。"},
{"签位":"获鹿被索","签文":"有一人，获一鹿，事团圆，门外索。","解签":"所问事必成，但须防后患，如得财富将有人强分，得配偶则第三者纠缠不放。"},
{"签位":"花逢严霜","签文":"汝往无攸利，花开又及秋，严霜物荐至，退步不存留。","解签":"凡事要有坚定信念，不可见异思迁，违背常理。"},
{"签位":"适时下网","签文":"新月为钩，清风作线，举网烟波，锦鳞易见。","解签":"须及时抓住有利的信息与事物。成功与失败在此一举。"},
{"签位":"小节须戒","签文":"先关锁，续提防，小节不知戒，因循成大殃。","解签":"要想渡过艰难，必须节俭、戒惧、谨慎，方能避免灾祸。"},
{"签位":"春花满院","签文":"燕语莺啼，花开满院，倚栏春睡觉，无语敛愁颜。","解签":"时运已转，凡事可以顺利进行无阻。"},
{"签位":"劳心有成","签文":"劳心劳心，劳心有成，清风借力，欢笑前程。","解签":"随时留心、深思，自必于事有补，前途开朗。"},
{"签位":"水边行客","签文":"进步且徘徊，春风柳絮吹，水边行客倦，枕畔有忧怀。","解签":"凡事求其循序渐进足矣，往往事将有成时又遭外来因素之阻扰。"},
{"签位":"后悔无益","签文":"玉石犹终昧，那堪小悔多，终无咎，笑呵呵。","解签":"所问诸事由于当事人之昏昧，小错很多，但并无大碍。"},
{"签位":"荣辱升迁","签文":"垂翼遥天去，皆因避难行，一途经济意，又是满园春。","解签":"狼狈脱逃一时，免却一场灾祸，在经过一番折腾后，终将回到安适生活中。"},
{"签位":"佳音笑脸","签文":"佳信至，开笑颜，飞腾一去，拨云上天。","解签":"大吉大利之上上签，已有喜讯佳音，机运一到，即可平步青云，直上九重。"},
{"签位":"吉中虑凶","签文":"青毡空守旧，枝上巢生风，莫为一时喜，还疑此象凶。","解签":"不祥，应加谨防，困窘之境依旧，且有风雨飘摇之险。"},
{"签位":"荆棘为恶","签文":"莫言荆棘恶，终为鸾凤栖，目前应有待，何用早踌躇。","解签":"虽有阻碍，终将鸾凤合鸣，如问他事，则亦好事多磨，但终将如愿。"},
{"签位":"团结光明","签文":"上下和，忧愁决，千嶂云，一轮月。","解签":"小事可获吉祥。小心处事为求同存异，处之泰然，自能应付自如。"},
{"签位":"玉出昆岗","签文":"玉出昆冈石，舟离古渡滩，行藏终有望，用舍不为难。","解签":"按最早预定的方案去办，可以成大功。"},
{"签位":"目下难舒","签文":"目下意难舒，有客来徐徐，金车虽历险，吝必有终与。","解签":"要解脱困境，须一步一脚印，量力而为之。先凶后吉。"},
{"签位":"寄托","签文":"可以寄，可以托，事迟迟，无舛错。","解签":"所问之事可以托付他人去办，不过进行缓慢，好在尚不至出错。"},
{"签位":"恐惧忧煎","签文":"恐惧忧煎，皆在目前，若逢明鉴，指破空传。","解签":"所问诸事忧患深重，若得人指点迷津，或可化险为夷。"},
{"签位":"云散月明","签文":"月掩云间，昏迷道路，云散月明，渐宜进步。","解签":"所问之事一时遭遇困阻，不辨路径，须排除障碍后，则再行进展可也。"},
{"签位":"仗贵人扶","签文":"道路狂招呼，风波一点无，时乖心绪乱，全仗贵人扶。","解签":"一切条件对已有利，亦无风险，奈何时运见拙而心烦意乱，唯有待贵人援手。"},
{"签位":"临渊放钩","签文":"临渊放钩，清绝点埃，巨鳌随得，不用疑猜。","解签":"做了抉择之后就应耐心以待，不必患得患失。"},
{"签位":"千里风帆","签文":"无中应有直，心事还成戚，云散月重圆，千里风帆急。","解签":"平平，示人须以“浮云散，明月照人来”之心情，进行心中之事。"},
{"签位":"造化自然","签文":"造化生来信自然，师征千里福绵绵，功名得就神明助，蛇兔相逢定变迁。","解签":"大吉，人生有些际遇必靠福份及神佑，事情只要含有蛇、兔因素，必有变迁。"},
{"签位":"歼灭群魔","签文":"大仗神威，群魔消灭，灭了又须威，神威亦极力，牢牢记取，免致久後失跌。","解签":"如援引外力助达目的后，要对外力有适当控制，以免外力从此将已束缚举债。"},
{"签位":"修道登仙","签文":"道必坚心，坚心必道成，建功勋，早回程，造茅庵，修真身，一日飞升，仙班列名。","解签":"勉人立身修业，勿图官宦之奢望，勿为功禄所贪恋。"},
{"签位":"一念之差","签文":"一念上天堂，一念入地狱，地狱天堂，便分荣辱，自立念头要真，不可随人碌碌。","解签":"荣耀或羞辱取决人之一念之间，人云亦云，昏庸一生岂不可惜？"},
{"签位":"拯救苍生","签文":"羊逸群，日对民，逢牛口，便咬人，一个君一个臣，君臣有些惊，须仗真神拯救苍生。","解签":"小人得势,君子就能忍则忍,方能由险转泰。"},
{"签位":"人明自悟","签文":"若是有缘人，一指便回首，执迷不悟者，屡引也不走。","解签":"所问事已步入歧途，当及时省悟回头，走为上计，方能保全名节。"},
{"签位":"海天一碧","签文":"月儿升东，清光可挹，万里无云，海天一碧。","解签":"有好机运来，可以大放异彩，凡事均无阻塞，今后环境更趋有利。"},
{"签位":"男儿得志","签文":"男儿若得封侯印，不负人间走一遭，功成身退烟霞啸傲，脱却紫罗袍，方是男儿道。","解签":"大才难有大用，应信守中道，不可妄动。"},
{"签位":"狐精迷人","签文":"心月狐狸，迷惑世人，世人不察，延久倾身。","解签":"世间有若干危害人体之嗜好，智者应以“妖狐”迷人为鉴。"},
{"签位":"蓦地狂风","签文":"蓦地狂风起，大树尽掀扬，枝叶未凋零，培植终无恙。","解签":"受到挫折后，当吸取教训，培养元气，方能化凶为吉，转危为安。"},
{"签位":"察阵对敌","签文":"虚日旺相，法要推寻，四围旋绕，对敌冲营。","解签":"勿为假相所欺，应多方深入探讨真相。"},
{"签位":"定国安邦","签文":"荣枯早定莫嗟伤，辛苦他邦安享家乡，为他人作嫁衣裳，今日君尝，他年改调别人尝。","解签":"荣枯天定，不要为失意伤情，应乐天知命。得此签者恐时下时运不佳。"},
{"签位":"女大当嫁","签文":"女儿大，喜临门，嫁良人，添子孙，同拜受，感皇恩。","解签":"吉祥，对儿女婚嫁、男女友谊、家室人丁等，更为称庆。"},
{"签位":"寒热病症","签文":"木生火，口不噤，疯癫作症，寒热相侵。","解签":"大不利，应谨言慎行，以防不测，免遭横事，此签于人为病痛，于事亦然。"},
{"签位":"浪子回头","签文":"休休休，过了三年又六周，不猛省，祸到头。","解签":"在近三年半左右，尽量减少兴革异动，对过去所为加以反省，如此或可避祸。"},
{"签位":"预防火灾","签文":"槛栏起火，孽畜遭殃，预防得力，灭火成康。","解签":"凡事先防范于未然，才能安全无虑。"},
{"签位":"已遂心愿","签文":"已遂心头愿，始知志气伸，三山须把握，频频定太平。","解签":"事情办成后，仍应持谨慎戒惧之心，否则恐出差错，使前功尽弃。"},
{"签位":"星斗满天","签文":"福星照映，桂子香闻，满天星斗，光耀逼人。","解签":"大吉大利，命中注定有神明护佑，逢秋八月或有贵人相助。"},
{"签位":"寻找泉源","签文":"东南北将来成故墟，燕蓟地苍生无存济，若要大奋雄心，水源不知何处？","解签":"环境至为险恶，既有近忧，又有远患，如想绝地求生，应先求取活命水源。"},
{"签位":"处事泰然","签文":"死有日，生有时，何事慢踌躇，飘然一往，心上无疑。","解签":"人生一切莫不有定数，对事不必过于计较。"},
{"签位":"消灭豺狼","签文":"往来行僻处，猝然着一惊，豺狼若当道，斩灭方称心。","解签":"进行之事突遇凶险，须拿勇气排除，事情方可顺利，得此签者恐有受惊吓之事。"},
{"签位":"布阵对敌","签文":"八门分八位，九星布九方，青赤黄白黑，五色卷锦装，交锋对垒，两两相当。","解签":"此签恐系诸葛当年用兵制敌之策略，所卜之事可能双方实力相当。"},
{"签位":"为人进取","签文":"终身不习上，在世却枉然，轮回不能免，永落深坑堑。","解签":"劝人不能昏沉渡日，当积极进取。"},
{"签位":"谋作欢欣","签文":"两个子女，同到齐行，阴阳和合，谋作欢欣。","解签":"得此签者诸事可成。"},
{"签位":"猛悟禅关","签文":"中有玄机赋，鸡鸣方显露，猛然悟禅关，打破君门路。","解签":"所问诸事疑难未解，但很快就能悟出解决之道。"},
{"签位":"鱼游四海","签文":"数尾金鱼吞饵，丝竿钓了回头，家食翻嫌太贵，五湖四海遨游。","解签":"意外之好运，有时不是福气反成负担。恐有先成后败之局面。"},
{"签位":"吉日良时","签文":"卯日儿出林，午时正福临，卯生於寅，方见天心。","解签":"天时依一定顺序运转，做任何事不能违背自然法则。"},
{"签位":"六耳同成","签文":"日中不决，日到方明，一场好事，六耳同成。","解签":"所问事一两日内尚难定，日子到了事情自明朗，应为三个人合力办成之好事。"},
{"签位":"妖精鬼怪","签文":"孤宿是妖星，猿猴及树精，入山遇此曜，迷了性和心。","解签":"此签示人 主防口舌是非。君子应自强不息，方能在破败中求生存。"},
{"签位":"晚渡关津","签文":"滴漏声催鸡唱，趱行人逐队放，晚渡关津，前程无量。","解签":"全力以赴，必有所成。"},
{"签位":"人在天涯","签文":"人在天涯外，久乏信音来，家人频望眼，草木畅胸怀。","解签":"目前境遇不佳，等待从困境中逃脱。"},
{"签位":"阴宅点穴","签文":"这颗树下，一穴生成，若迁此上，福禄骈臻。","解签":"寓意有二: 凡命运亨通者，即或居于枯树古井旁，福泽依然；切勿营华屋。"},
{"签位":"躬耕农田","签文":"躬耕陇亩，形神似劳，无拘无系，其乐陶陶。","解签":"过不求人之生活，身体虽劳，精神却愉快。"},
{"签位":"鬼病缠身","签文":"祸来见鬼，鬼病淹缠，金羊得路，身脱灾殃。","解签":"大祸临头，心被怪病淹没而纠缠不放，除非有“金、羊”有关事物来救。"},
{"签位":"去结同道","签文":"急起行，急起行，前途去，结同盟，只手擎天柱，史册好标名。","解签":"得此签者可能于仓猝间受命，代表所属协调重大事务，并获圆满成功。"},
{"签位":"虎抖神威","签文":"深山据猛虎，虎啸出山窝，扬威抖擞，何怕人多。","解签":"雄壮威严，果敢勇往始可折服众人。"},
{"签位":"天门地户","签文":"三天门，四地户，布阵成，明聚路，军马齐奔，鸣鼓进步。","解签":"吾人行事，宜先制定良策，方可致胜可能。"},
{"签位":"山上茅庵","签文":"山山山，山上建茅庵，不比人间栋宇，却如天上云昙。","解签":"知足常乐。"},
{"签位":"不计荣辱","签文":"来去原无定处，时来时去安身，跋涉无虑，荣辱不计。","解签":"得此签者一生劳碌，谋生之处屡易，好在住宿有着落，奔波途中亦安全。"},
{"签位":"人苦不足","签文":"有子长，成水局，时遇火反发福，不必过忧煎，人心苦不足。","解签":"世事难以尽如人意，不是太过就是不及，为此伤神忧虑，毫无意义。"},
{"签位":"黑夜行人","签文":"黑夜里，勿前往，一有值，要着慌，牢牢记，须结党。","解签":"陌生环境未了解前，勿冒然前往，如果必须前往，应结伴而行。"},
{"签位":"龙布雨露","签文":"蛰龙已出世，头角首生成，云兴雨泽，得济苍生。","解签":"大吉大利，所问之事，困局即将突破，从此可入坦途。"},
{"签位":"大火薰天","签文":"火势薰天，天边尽赤，遇际水源，庶乎成格。","解签":"一旦发生意外灾祸，事发就不可收拾，应有克制对策，庶几解除困难。"},
{"签位":"入城觅友","签文":"向南有大道，乘马入杭城，不知吴人唱，更有一知音。","解签":"工作地点以南方为宜，寻访可能得遇，交游虽不广，可获知己。"},
{"签位":"有田可耕","签文":"有田一亩，尽可耕耘，无穷收获，都在西成。","解签":"家有恒产，虽说不多，若能认真经营终必有成。得此签者不易离家另谋他业。"},
{"签位":"勿嫌儿丑","签文":"勿嫌儿无唇，疾足追不及，纳入猿穴中，走狗何处觅。","解签":"如果遇上性格如兔或是属兔的人，不能嫌弃他。失去他，你会后悔不及的。"},
{"签位":"农家乐园","签文":"六牛耕地，垦开无疆，收成结实，盈禀盈仓。","解签":"一分耕耘，一分收获，天下无侥幸而成之事。"},
{"签位":"扬武沙场","签文":"大奋冲天志，勿苦恋家乡，七八君行早，扬武在沙场。","解签":"成大事者应志在四方，勿囿于一角，把握时机及早行动七八或与时日机运有关。"},
{"签位":"君享太平","签文":"葵花向日，忠赤倾心，大开广厦，乐享太平。","解签":"得此签者深受部属爱戴，都能为其赤诚工作，使其事业鸿图大展。"},
{"签位":"玄门乐趣","签文":"人不识仙，那有真诀，一入玄门，津津有益。","解签":"进行一事，必先穷理探源，把握其中要领，方能得心应手。"},
{"签位":"仙道神功","签文":"道勿谓说话太沈，泥了就不成真，悟出千般奥妙，方识仙最神。","解签":"所问之事，面貌并不清朗，须用心去探求其内蕴。"},
{"签位":"练功上乘","签文":"功名虽多实际，何如修炼成真，真身不朽，万载长春。","解签":"与其汲汲于追求功名，不如修身养性。"},
{"签位":"路遇一狗","签文":"走走走，遇一狗，急思寻，可长久。","解签":"处理事情上不宜忽略小节，要特别注意突生之状况，并推想其缘由方可无事。"},
{"签位":"警惕假信","签文":"不知真消息，消息蓦地来，月圆月缺夜，不许把门开。","解签":"来得仓促之消息，不可轻信，变化飘忽或反覆无常事情，少管为妙。"},
{"签位":"济中未济","签文":"火旺处要不疲，水深处要不呆，到头当酌量，毋得惹他灾。","解签":"事情进行到最重要关头应慎思斟酌，方不致带来灾害。"},
{"签位":"雁远建功","签文":"宾雁远湖地，成陆便建功，却早回程。","解签":"见好就收。"},
{"签位":"风清月明","签文":"天上风，天边月，月白风清，两两相当。","解签":"时运正佳，故凡求职、求偶、求学、求财等均有吉利。"},
{"签位":"炼功得丹","签文":"叶归根，长立天地，水清源长流河海，人得金丹长生渊涯。","解签":"万物生长、新成代谢均循一定之自然趋势，人类亦然，能悟其理，自必长寿无灾。"},
{"签位":"兴尽终凶","签文":"乘马去长安，看花花正发，一日雨来淋，香色尽凋零。","解签":"花无百日娇，无千日好，得意常想失意时，诸般顺心时，应防突来失意或灾殃。"},
{"签位":"春秋兴衰","签文":"木长春天根干老，子实三秋枝叶凋，不凋不谢，不见根牢。","解签":"先经挫折磨练，然后其生命力必更坚强。"},
{"签位":"伸首舒眉","签文":"叫道叫道，天将明了，何不伸首舒眉，反做蓬蒿到老。","解签":"早起三光，晏起三荒，应及时努力，遇事不可因循不振。"},
{"签位":"神丹妙药","签文":"药饵真，服了宁，三剂後，足分明，神中神，清中清，固得紧，可长生。","解签":"任何事物，真即真假即假，一经多方考验，底细便明。"},
{"签位":"交真朋友","签文":"三天曾结社，四海尽知名，长骑骏马，直入天庭。","解签":"大吉大利，凡事左右逢源，得心应手。"},
{"签位":"童颜鹤发","签文":"闲来夫子处，偶然遇一人，童颜鹤发，笑里生春。","解签":"命中有吉人相助。"},
{"签位":"他乡故知","签文":"闲云野鹤望东行，惟有乡人便是知音，经营布置两三春，联街灯火後，锦帆前程。","解签":"悠闲自在态度追求理想者，际遇最佳，经过二三年之经营，即可有成。"},
{"签位":"江流滚滚","签文":"汉水无情，蜀水澄清，黄河滚滚，四处烟尘。","解签":"浊者自浊，清者自清，吾人须洁身自好，以处混乱之险恶世道。"},
{"签位":"潜龙勿动","签文":"潜龙已受困，尚不见云兴，伫看云四合，飞去到天庭。","解签":"求签者暂遇挫折，目前尚在守时待运阶段，待时机成熟。"},
{"签位":"谈笑生风","签文":"此处滋味浓，浓艳不耐久，何如谈笑生风，倒好东奔西走。","解签":"好花不常开，一旦处于绝佳之境，宜淡然处之，并另谋良图。"},
{"签位":"此有小人","签文":"这里有小人，切莫稍留停，忙打点，好起行，日月如逝勿久存。","解签":"所问诸事可能受到小人干扰破坏，与其争论无益，避之则吉。"},
{"签位":"雨济苍生","签文":"龙生头角，将沛甘霖，六七八早，好济苍生。","解签":"感应签，求职谋事创业等，遇龙年生者可得其助，迁居进宅等，逢678之日期较顺。"},
{"签位":"龙蛇争斗","签文":"太白现西南，龙蛇相竞逐，龙自飞上天，蛇却被刑戮。","解签":"此签示人 善恶终有报。"},
{"签位":"春花满院","签文":"曾把树栽，也要待春来，东风袅袅，开遍花街。","解签":"一分耕耘，一分收获，已为某事劳心尽力，但须待时机及人助方有成。"},
{"签位":"荒淫庸碌","签文":"四十馀年苦已深，而今汝乐度光阴，莫筹论，恩爱尚多欢喜事，惜甚青春，不减青春。","解签":"此签劝人要能知足，并把握光阴享受人生。"},
{"签位":"大才难用","签文":"三冬足，文艺精，到头处，亦成冰，急急回首，勿误前程。","解签":"所问诸事做法上恐有问题，应即改弦更张另作安排。"},
{"签位":"谨防错乱","签文":"奇怪奇怪，前番来了，今番又来，谨慎提防，勿被弄坏。","解签":"所问之事情况怪异，应提防生变，以免坏了大事。"},
{"签位":"勤耕有收","签文":"耕牛伏軏，辟土开疆，坐看收获，黍稷稻梁。","解签":"得此签者有以逸待劳，坐享其成之机运。"},
{"签位":"金殿将军","签文":"腰下佩青萍，步入金銮殿，覆护三山，千锤百链。","解签":"得此签者功勋卓著，必为行业中顶尖人物，所问诸事无不卓然有成。"},
{"签位":"神话传奇","签文":"雏鸟飞高，出谷迁乔，龙神牙爪，变化海岛。","解签":"此签以雏鸟喻人学艺未精不知天高地厚，初入社会难免饱受波涛翻滚之苦。"},
{"签位":"吉凶互变","签文":"吉吉吉，寻常一样窗前月，凶凶凶，有了梅花便不同，含笑向东风，人情不比旧时浓。","解签":"得此签者恐有不吉事情临头，并因而尝到人情淡薄之滋味。"},
{"签位":"宝鼎丹成","签文":"大火炎炎，宜水相济，宝鼎丹成，掀天揭地。","解签":"不经意引发之灾难总有克制之法，刻意策划之事端，往往一发不可收拾。"},
{"签位":"依法斩首","签文":"铁索一条，未把孤舟系，金刀一下，早把头落地。","解签":"所问之事宜以快刀斩乱麻方式处理，以杜后患。"},
{"签位":"子午流注","签文":"十二时中，紧急炼着，一刻少延，无处下脚。","解签":"做任何事，均要抱着积极态度不懈不怠全力以赴，若稍有停顿，将难以收拾。"},
{"签位":"奇门妙诀","签文":"风起西南，红日当天，奇门妙诀，一掌能着。","解签":"当时机成熟，谜题即可轻易揭开，所有疑难均会得到答案。"},
{"签位":"月正当空","签文":"万籁无声际，一月正当空，忽被云遮掩，皓魄反朦胧。","解签":"谨慎维护形象，以突破谣言扭曲，得此签者有招人忌怨、暗算之危。"},
{"签位":"常思己过","签文":"一个知音，却在天边等，切勿因循，静夜当思省。","解签":"得签者为人处事有“曲过高和太寡”之情形，宜检讨修正。"},
{"签位":"看家良犬","签文":"众犬相聚，砺齿咬牙，摇头摆尾，只顾看家。","解签":"此签示人勿为小人群聚时之假象欺骗。"},
{"签位":"恩义莫忘","签文":"妻前夫後一同行，好比先机兆已明，君若有情须切记，十年恩义莫忘心。","解签":"有的夫妻，妻强夫弱，得此签者有娶这种妻室之可能，婚后应重视恩义。"},
{"签位":"猫捕鼠图","签文":"鼠伏穴，本自宁，一露首，猫即跟，扬威伸爪，鼠丧残生。","解签":"凡事一动不如一静，坚守本份相安无事，或寓有应严守机密勿使泄露意思。"},
{"签位":"读书乐图","签文":"书中有女颜如玉，书中自有黄金屋，读尽五车书，志愿自能足，何必焦劳心中忙碌。","解签":"得此签者应切记斯言，不再忧心忡忡，终年劳碌而不读书。"},
{"签位":"赤身富贵","签文":"豹变成文采，乘龙福自臻，赤身成富贵，事事得振新。","解签":"得此签者将获佳婿，并因而使生命改观，荣华富贵享用不尽。"},
{"签位":"不得志图","签文":"孤阳微兮，群阴溢兮，力既殚兮，将不可耄兮，真谨慎兮，宜可保兮。","解签":"此签寓有“道消魔长”之意，处此情况唯有谨慎或可保全。"},
{"签位":"安贫乐道","签文":"晓雨初晴映碧溪，重重春色上柴扉，黄金不尽家殷富，何必区区羡锦衣？","解签":"此签示人:家道富裕，宜安于现状，不必另起为官或经商之念。"},
{"签位":"勤苦生涯","签文":"世道多荆棘，人情每用嗟，利名如有路，勤苦逐生涯。","解签":"求名求利各有各的路，不必在凶险世途上与人争夺，安份守己勤苦渡日最宜。"},
{"签位":"凡事莫强","签文":"山穷路转迷，水急舟难渡，万事莫强为，出处遭研妒。","解签":"跋山涉水出门远行，均属不利，若违拗命运一意孤行，往往会遇怨怼非议事。"},
{"签位":"边将凶险","签文":"时边多艰，战战兢兢，戒谨恐惧，如履薄冰，须识前程危与险，一笼风里一枝灯。","解签":"时运不佳，未来日子风险更多，得此签者，须多加谨慎提防为宜。"},
{"签位":"花枝艳芳","签文":"一朵花枝艳更芳，清香馥郁透兰房，时风吹送终成笑，好句筵前进几觞。","解签":"得此签者如为女性，必美且慧，远近赞美；如为男性则以品德高贵而受颂扬。"},
{"签位":"功在人先","签文":"自从持守定，功在众人先，别有非常喜，随龙到九天。","解签":"一人做任何事，具有恒心、毅力，则其成功机会较大。"},
{"签位":"始得渡滩","签文":"远涉波涛一叶舟，而今始得过滩头，年来心事才成就，屈指从前多可忧。","解签":"此签甚佳，凡事亨通，如 寻物得、谋事成、求偶佳、经商利、建屋吉。"},
{"签位":"守之吉昌","签文":"受君之禄，久降祯祥，盈而不覆，守之乃昌，毋怠毋骄，永保安康。","解签":"得签者久受重用，生活富裕，如起异心或心生骄怠，则可能失去一切。"},
{"签位":"疑天问天","签文":"万事不由人计较，一生尽是命安排，莫疑猜，命里有时总有分，何须碌碌混尘埃，休哉！","解签":"谋事在人，成事在天。对一切事物，莫过于贪婪奢求。"},
{"签位":"得失归休","签文":"一片忧心未肯休，花逢春雨艳难留，得意归休，失意归休，仙家只此一筹谋。","解签":"所问诸事均不顺遂，因而被重重烦忧困住，妇女得此签者宜防情感生活有变。"},
{"签位":"阴盛阳虚","签文":"两女一夫，上下相祛，阴气乘阳，用是耗虚。","解签":"对女色之困惑，须加以警惕，不可贪恋也，否则将有耗虚之虞。"},
{"签位":"燕归南国","签文":"双燕归南国，来寻王谢家，华堂春尽静，进此托生涯。","解签":"倦游归来，景物全非。"},
{"签位":"命运不济","签文":"命运蹇兮时违，灾殃及兮身疲，望皇天兮不我顾，嗟我亲兮病斯危。","解签":"不吉，诸事不宜。"},
{"签位":"春风啼鸟","签文":"采药天台路转迷，桃花流水赋佳期，春风啼鸟多情思，寄语刘郎且莫归。","解签":"在他乡工作时意外得遇知音，事事顺遂，暂且可不返乡。"},
{"签位":"入得仙般","签文":"出温入寒，被薄衣单，去我慈航，难解横愆。","解签":"因时运不济及自己过错，使得处境至为孤寂无助，应借助信仰力量以求自救。"},
{"签位":"五口一斗","签文":"三升三石放在一斗，满而溢，子自得。","解签":"示人不可削足适履，亦寓有“满招损”之意。"},
{"签位":"故乡月明","签文":"谁说故乡无滋味，飘零湖海在天涯，任咨嗟，中秋月隐春雨淋花，多少征人长忆家。","解签":"得此签者，恐终年在外奔波，受尽寂寥之苦，常起思乡之念。"},
{"签位":"一箭定功","签文":"云散月当空，牛前马後逢，张弓方抵御，一箭定全功。","解签":"鼠年及羊年会有一举成功机会。"},
{"签位":"万里江湖","签文":"马进徐行似有程，月沈西海日东升，运来何必劳心力，风送江湖万里清。","解签":"目前机运欠佳，事情进行缓慢，日夜操劳，来日运转，情况即可完全改观。"},
{"签位":"云横山际","签文":"云横山际水茫茫，千里长途望故乡，蹇厄事来君莫恨，倚门惆怅立斜阳。","解签":"困厄之事临身，一时难以解除，惆怅难免，怨恨则不必。"},
{"签位":"楫舟遇安","签文":"风波今已息，舟楫遇安流，自此功名遂，何须叹白头。","解签":"一切纷争已息，今后行程应平稳无险，刻下经营多顺利，虽慢了些又何妨？"},
{"签位":"风疾马快","签文":"巴到平安地，江山万里程，绿杨芳草处，风快马蹄轻。","解签":"历尽千辛万苦，如今终入佳境。"},
{"签位":"名达九重","签文":"雕鹗当秋势转雄，乘风分翼到蟾宫，荣华若问将来事，先後名声达九重。","解签":"时来运转，气势甚雄，做任何事均能顺利无比。"},
{"签位":"猫避鼠图","签文":"鼠为患终宵不得宁，猫儿一叫几夜太平，人岂识如兽，其理甚分明。","解签":"小人得志，嚣张狂妄，但为时不长。"},
{"签位":"参悟仙机","签文":"两人在旁，太阳在上，照汝一寸心，仙机曾否明。","解签":"举头三尺有神明，与人相处莫欺心，是非到头自分明。"},
{"签位":"正气不足","签文":"君子道消，小人道长，阴气郁郁，阳气不扬，如何如何，良贾深藏。","解签":"若大丈夫怀才不遇，则深藏不露乃为上策。"},
{"签位":"正逢天门","签文":"去到长安，东北转角，逢着天门，便有下落。","解签":"你所求的事要往繁华的都市去，东北方即为生门。"},
{"签位":"徐步天台","签文":"徐步入天台，为听好消息，采药有仙童，洞府列春色。","解签":"机运不能坐等，要亲自向可能之处探寻，寻必有所得。"},
{"签位":"思量一夜","签文":"思量一夜，不如打千一番，若还错，烦恼及肺肝。","解签":"如果坚持错误的主意和方法，就会引起肺部和肝部的疾病发生。"},
{"签位":"胆大心细","签文":"心细胆粗，可胜上将之任，勇往前行成败何必在心，胸中把持得定，敌人自能受困。","解签":"勇往直前，不必计较成败。打消疑虑，则吉利可待了。"},
{"签位":"清心见道","签文":"天念苦修人，终不落红尘，清心能见道，扰扰丧真灵。","解签":"对某件事能专心致志去做，收获必不同凡响。"},
{"签位":"无的放矢","签文":"捕兕於渊，求鱼於山，从朝至暮，功负力捐，改弦易辙，庶可图全。","解签":"走错方向，用错方法，难望有成，应改弦更张，另设他法，或有成就一天。"},
{"签位":"见者不来","签文":"手持一木鱼，沿街去化缘，不见徐公来，却遇一鸟去。","解签":"所问之事恐徒劳无功。"},
{"签位":"水火既济","签文":"水火既济，阴阳相契，育物新民，参天赞地。","解签":"所有冲突已化解，障碍亦撤除，环境无比和谐，适宜做任何事。"},
{"签位":"月宫一游","签文":"骑玉兔，到广寒，遇嫦娥，将桂攀，满身馥郁，两袖馨香。","解签":"得此签者机缘奇佳，得遇贵人，因而飞黄腾达事事遂心，如问姻缘，可得佳人。"},
{"签位":"真功显灵","签文":"一个神道，随尔去行，逢人说法，到处显灵。","解签":"得此签者手法高明，待人处事八面玲珑，如有神道随行。"},
{"签位":"功到丹成","签文":"炉中火，沙里金，功力到，丹鼎成。","解签":"功夫到了，任何事均可以做成。"},
{"签位":"遇花知音","签文":"此去万里程，却遇见知音，同心共济，大立勋名。","解签":"得此签者将有远行，并在当地遇知音，成家立业，赢得声名。"},
{"签位":"春花可爱","签文":"寻芳春日，适见花开，朵朵堪摘，枝枝可栽。","解签":"做任何事要能适当其时，才会处处逢源，事事顺心。"},
{"签位":"龙吟云兴","签文":"龙一吟，云便兴，冲霄直上，快睹太平，为文为武，君君臣臣。","解签":"所问之事，已出现祥瑞之兆，很快就有和谐局面出现。"},
{"签位":"山翁有趣","签文":"虎出金榜，有勇亦何济，怎似山翁，非富犹有趣。","解签":"若干情况出乎常情之外，不能以常理处之，此时须求助于专门人才。"},
{"签位":"功成思乡","签文":"过羊肠，入康庄，五陵裘马，当思故乡。","解签":"历尽辛苦，而步入舒适称意之环境，须饮水思源不可忘本。"},
{"签位":"源远流长","签文":"火遭水克，火灭其光，水势滔滔，源远流长。","解签":"处理紧急情况，不能急切，须防后患。"},
{"签位":"佳客自来","签文":"东阁筵开，佳客自来，高歌唱和，展挹舒怀。","解签":"得签人已颇有名望，且乐于交际应酬，往来多为高雅之士。"},
{"签位":"小心须防","签文":"世界似清宁，不知辞已休，打叠要小心，须防遭火 。","解签":"天下本无事，庸人自扰之，或谓苦恼皆因强出头。"},
{"签位":"跳跃龙门","签文":"跳龙门，须激浪，雷电轰轰，踊跃万丈。","解签":"要达崇高目标，须有超人本事，并能借机乘势。"},
{"签位":"山上古松","签文":"山上有古松，亭亭冲汉斗，干老枝更长，天地生荣久。","解签":"顺其自然，把握有利机运去求发展，才会有指望。"},
{"签位":"勿理诽谤","签文":"诽谤言，勿计论，到头来，数已定，碌碌浮生，不如安分。","解签":"对于挑拨离间之闲言杂语，不去理会，一切自有天数，冥冥之中报应不爽。"},
{"签位":"为有牺牲","签文":"一头猪，可祭天地，虽丧身，亦算好处。","解签":"天生万物必有用，寓意人万勿连猪狗都不如。"},
{"签位":"经营操劳","签文":"与其日营营，何如夜忖忖，日里多劳形，夜间却安稳。","解签":"要改变原有的思想方法，才能适应变化了的时空环境。"},
{"签位":"东风花开","签文":"东风来，花自开，大家喝采，畅饮三杯。","解签":"万事俱备，只欠东风，如今东风来了，自是令人开怀之事。"},
{"签位":"素食健身","签文":"疏食饮水，乐在其中，膏梁美味，反使心朦。","解签":"知足常乐。"},
{"签位":"谷米盈仓","签文":"黄牛辟土，大力开疆，西成时候，谷米盈仓。","解签":"一分耕耘，一分收获。"},
{"签位":"龙蛇威风","签文":"蛇可化龙，头角将出，平地一声雷，方显龙蛇力。","解签":"得此签者在平凡中力求不凡，即将有所成就。"},
{"签位":"九华仙境","签文":"九华山顶，紫气腾腾，异尽一舟，取去前行。","解签":"得签者可望取得通达之机缘，从此一帆风顺。"},
{"签位":"人无完人","签文":"人非孔颜鲜能无过，过而能改仍复无过，开花不足凭，结果方为准，放开怀抱意欣欣。","解签":"有错要知悔改，做事务必落实，心胸宽大，人生才有意义。"}]